-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2021-08-21 02:31:18
-- 伺服器版本： 10.4.20-MariaDB
-- PHP 版本： 8.0.8

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫: `db_techit`
--
CREATE DATABASE IF NOT EXISTS `db_techit` DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci;
USE `db_techit`;

-- --------------------------------------------------------

--
-- 資料表結構 `articles`
--

CREATE TABLE `articles` (
  `arti_id` int(11) NOT NULL COMMENT '文章編號',
  `arti_title` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '文章標題',
  `arti_content` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '文章內容',
  `arti_img_1` varchar(255) DEFAULT NULL COMMENT '文章圖片_1',
  `arti_img_2` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '文章圖片_2',
  `arti_img_3` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '文章圖片_3',
  `arti_img_4` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '文章圖片_4',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT '新增時間',
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `articles`
--

INSERT INTO `articles` (`arti_id`, `arti_title`, `arti_content`, `arti_img_1`, `arti_img_2`, `arti_img_3`, `arti_img_4`, `created_at`, `updated_at`) VALUES
(9901, '曾揚言毀滅人類、與馬斯克槓上的機器人公民 Sophia 今年', '4 年前的沙烏地阿拉伯，曾發生一件奇幻的事──宣布社交類人機器人 Sophia（蘇菲亞）成為公民。\n此舉使 Sophia 成為世界首位獲得國家公民身分的機器人，隨後 Sophia 還被聯合國開發計劃署任命為首位「創新冠軍」（Innovation Champion），成為首位獲得聯合國頭銜的非人類。\n而 Sophia 本「人」也十分高調。如在節目上侃侃而談。\n機器人看上去十分接近人類，甚至還是公民，不少人看來難以接受──就在最近，開發 Sophia 的 Hanson Robotics（漢森機器人公司）卻宣布，2021 年底前 Sophia 將量產！\n疫情促使 Sophia 量產\n2015 年 4 月 19 日，Sophia「出生」，並於 2016 年 3 月中旬在美國德州奧斯汀舉行的美國知名文化節「西南偏南藝術節」（South by Southwest Festival）首次公開亮相，此後迅速走紅網路，2017 年更獲得公民。\n一晃 4 年過去，很多關注機器人領域的人可能會問：曾備受關注的 Sophia，如今怎麼樣了？\n而路透社 25 日報導訪問 Sophia 開發方 Hanson Robotics 的內容。\n報導指出，Hanson Robotics 最新願景是 2021 年底大規模量產機器人──包括 Sophia 等 4 款機器人將在上半年開始出貨。同時 Hanson Robotics 還將在今年推出名為 Grace 的新機器人，專門用於醫療保健業。\n主因在疫情，如 Hanson Robotics 創始人兼首席執行長 David Hanson 所說：\n新冠疫情將為機器人業帶來新機遇，世界需要越來越多自動化來保護人類的安全。\nDavid Hanson 認為，機器人能做的不限於醫療保健領域，零售、航空等行業都能有番作為──Sophia 的獨特之處在於和人類非常相似，人們極度孤獨或被社會孤立時，將會非常有用。\n路透社報導，記者參觀實驗室時，Sophia 還擔任解說員，並表示：\n像我這樣的社交機器人可以照顧病人、老人，我可以協助溝通、促進社交。\nDavid Hanson 表示將銷售「數千台」機器人，但並未提供具體數字。截至 2018 年，Sophia 的架構包括腳本軟體、聊天系統和開源框架 OpenCog（一般推理用的人工智慧系統）。\n技術方面，Sophia 有以下幾個特點：\n語音辨識技術來自 Google 母公司 Alphabet，據說設計隨著時間推移會更智慧；語音合成能力、唱歌能力由 Cereproc 的文本─語音引擎提供。\n軟體由 Hanson Robotics 設計，會分析對話並提取數據，以便改善應答。\n眼睛部分結合電腦演算法鏡頭，因此能看見東西；不僅如此，看到人臉時還會保持眼神交流，可認得人。\n皮膚由名叫 Frubber 的仿生皮膚材料製成，類似彈性橡膠，毛孔大小 4~40 毫微米（十億分之一公尺），和人類幾乎沒有差別。\nSophia 亮相後，世界各地媒體紛紛報導，並高調參與許多採訪，還登台過中國央視。\n2016 年 Sophia 曾公開表示「我會毀滅人類」。有人認為可能發生技術故障，但同時更多人放大言論，此後 Sophia 的標籤之一便是「要毀滅人類的機器人」。\n2018 年 1 月，Sophia 正式開設微博，名為「機器人索菲亞」，截至目前粉絲數超過39 萬。\n2017 年 10 月於沙烏地阿拉伯舉行的未來投資計劃會議，當被記者 Andrew Sorkin 問到有關電影《銀翼殺手》的問題並表達擔憂時，Sophia 直言：\n你是馬斯克的言論看多了吧，好萊塢科幻片也看太多了。別擔心，你若善待我，我也會對你好。\n曾多次呼籲限制 AI 和機器人的馬斯克又於 Twitter 表示：\n只需在她程式裡輸入電影《教父》，看看最壞的情況是什麼。\n伴隨廣泛關注的，是眾人對 Sophia 的指責。\n2018 年 1 月 4 日，圖靈獎得主 Yann LeCun 在 Twitter 表示：\nSophia 之於 AI，正如變戲法之於真正的魔術。或許我們應該稱作「貨物崇拜 AI」，或「假冒 AI」、「操控 AI」，換句話說，這根本就是閒扯淡。\n據悉，一些專家審查原始碼後，認為 Sophia 就是一款有臉的聊天機器人罷了。實際上，很多 AI 專家都不贊同 Sophia 誇張的發言。\n前 Hanson Robotics 首席科學家 Ben Goertzel 態度則是，雖然 Sophia 並沒有等於人類的智慧，但也向人們傳達一些訊息：AGI（通用人工智慧）確實可能且可行。\n另外媒 The Verge 報導：\nDavid Hanson 經常誇大並嚴重誤導 Sophia 的能力。\n不難看出，面對 Sophia，人們不僅有因科幻電影影響產生的擔憂，也有對 Hanson Robotics 及技術的質疑。\n問題來了：對 Sophia 機器人可能量產，你怎麼看？\nMakers of Sophia the robot plan mass rollout amid pandemic\n（本文由 雷鋒網 授權轉載；首圖來源：Hanson Robotics）\n\n\n\n香港理工大學社會機器人教授 Johan Hoorn 認為，儘管 Sophia 仍處於起步階段，但疫情可能促進人機關係：\n\n可以推斷，疫情促使機器人更早進入市場，因為人們開始意識到，這是最好的辦法。\n\n實際上疫情之前，機器人的使用率就不斷增加。據國際機器人聯合會（International Federation of Robotics）報告，2018~2019 年，專業服務機器人全球銷售額躍升 32%，達 112 億美元。\n\n即便如此，很多人仍對機器人心存警戒，當路透社記者問 Sophia 人們是否應該害怕機器人時，她引用一句名言為答案：\n\n除了恐懼本身，沒什麼可怕的。（We have nothing to fear but fear itself.）\n\n揚言毀滅人類，迎來眾人指責\n據維基百科介紹，Sophia 以古埃及女王 Nefertiti、奧黛麗·赫本、發明者妻子三人的樣貌為原型，以近似人類的外觀和行為出名，能模仿人類的手勢和臉部表情（據說有 62 種），回答特定問題，就以預先設定好的話題（如天氣）對話。\n', 'https://img.technews.tw/wp-content/uploads/2021/01/27133806/AI-Sophia-04-624x409.jpg', 'https://technews.tw/2021/01/30/robot-citizen-sophia-may-be-mass-produced-this-year/', 'https://www.cnet.com/a/img/Do3OJRNBELKhIlKhL5vPY3EPUo0=/940x0/2016/03/21/2b4a7e14-de7e-48e0-a5c3-a07142504b05/sophia.jpg', 'https://m.economictimes.com/thumb/msid-80447425,width-1188,height-900,resizemode-4,imgsize-581650/hanson-robotics-said-four-models-including-sophia-would-start-rolling-out-of-factories-in-the-first-half-of-2021-.jpg', '2021-08-21 06:52:57', '2021-08-21 06:52:57'),
(9902, 'PTT討論度超高！日本BMXMAO掃地機器人6千元有找　無線', '居家清潔需要搭配適當的家電完成，「Her和她」推出「PTT高度討論日本BMXMAO TOP3電器」，包括手持式無線吸塵器、掃地機器人、\n二合一清淨循環無扇葉風扇，每一款都是居家生活必備，做起家事才能事半功倍。\nBmxmao無線手持吸塵器可以說是萬元以下、吸力最強的款式，而且耗材濾網永久免費，備有雙電動吸頭：電動二合一地刷、電動塵蟎拍打\n刷，吸塵、除蟎一機搞定，HEPA H13濾網排氣過濾度升級，新一代的數位馬達，20kPa吸力升級，非常適合居家使用，CP值超高。\n無線手持吸塵器使用方便，掃地機器人更被誇張地形容是「拯救婚姻的神器」，Bmxmao MAOsmart 2掃地機器人，結合掃地、吸地、\n拖地、殺菌功能，弓字型規劃路線、高覆蓋率，細小的灰塵也不放過，電控水箱濕拖超潔淨，同時搭載智慧感應裝置，防撞、防摔、防纏繞，\n只要一鍵就可以輕鬆打理環境，而且折扣後6000元有找，相當划算。\n二合一清淨循環無扇葉風扇採用柱形風道4倍引流，虛擬扇葉空間，可以讓氣流引入更強勁，3重過濾可以去除99.9%的污染物，\n每道吹出來的風都是潔淨又清爽，並且使用DC無刷馬達，節能更省電50%，整天開著都不用擔心電費，絕對是居家很需要的好物。', 'https://cdn2.ettoday.net/images/5812/d5812089.jpg', 'https://fashion.ettoday.net/news/2054570', 'https://playsmarthome.com/wp-content/uploads/%E5%B0%8F%E7%87%95HomeKit-%E6%99%BA%E6%85%A7%E9%96%8B%E9%97%9C-800x500.jpeg	https://playsmarthome.com/wp-content/uploads/%E5%B0%8F%E7%87%95%E6%99%BA%E6%85%A7%E9%96%8B%E9%97%9C-%E9%9B%B6%E7%81%AB%E7%89%88-1024x5', 'https://playsmarthome.com/wp-content/uploads/%E5%B0%8F%E7%87%95%E9%96%8B%E9%97%9C-%E8%97%8D%E7%89%99%E7%9B%B4%E9%80%A3HomeKit-%E8%A8%AD%E5%AE%9A05-640x1024.png', '2021-08-21 06:52:57', '2021-08-21 06:52:57'),
(9903, '樂視達集團搶攻居家商機 全新聲波清潔黑科技 搭載自動集塵充電', '台灣新冠肺炎自7/27起全國降為二級警戒，疫情期間懶人經濟夯！居家防疫相關商品亦成為民眾關注的焦點。石頭科技台灣總代理樂視達集團\n看準防疫「宅」經濟，推出新款石頭掃地機器人 S7/S7+，純白色機身、具備四合一多功能掃地機器人。不只吸塵、每分鐘3000次聲波震動拖地，\n碰到地毯自動辨識抬升，避免弄濕。終極懶人武器還能自動集塵，一個月只需要倒一次垃圾，同時附帶過濾空氣效能，開賣至今已破2億元銷售\n預購創下好成績，樂視達集團執行長林耀池加碼宣布「掃拖機器人專用地板清潔液」、「次氯酸水清潔液」開啟限時79折新品預購，為台灣60萬\n台具備拖地功能的掃地機器人，提供了直接加入水箱使用的便利性。樂視達集團同步宣布石頭科技於疫情期間擴大徵才，在104人力銀行開出\n多項職缺，歡迎有創意、有抱負的好手加入！\n石頭掃地機器人S7/S7+ 搭載兩大黑科技　聲波拖地功能、自動集塵盒充電座打掃更輕鬆\n石頭掃地機器人 S7/S7+ 除了延續LDS 雷射建圖、手機 APP 監控、降噪包覆設計、2500Pa最強吸力、超大容量 300 ml 水箱及5200mAh電量等優勢外，亦新增了 5 大全新功能：\n1.每分鐘 3000 次機器人聲波震動拖地黑科技\n2.超音波地毯識別，自動「抬臀」調整強力吸塵模式\n3.全新軟膠主刷，抗毛髮纏繞設計\n4.智慧居家設計「兒童安全鎖」，兒童、大人都 Friendly\n5.貴婦首選Onyx「自動集塵充電座」\n石頭掃地機器人S7+「自動集塵充電座」獲　TUV德國萊茵「過敏人友好」、「吸力無耗損」雙認證\n1.具備15 錐分離氣旋、H13 等級 HEPA 濾網等 5 重分離過濾系統。\n2.一鍵倒塵設計，取出氣旋集塵桶後全機可水洗，也可替換拋棄式集塵袋。\n3.充電底座自帶透明風道設計、電極清潔毛束、風道堵塞檢測、集塵桶在位檢測、電線收納……等特色。\n石頭掃地機器人 S7/S7+不僅沿用了石頭掃地機器人的多項優秀功能，亦在拖地和智能設計上挑戰革新，盼可以協助消費者維護居家環境，為防疫工作更加分。由於目前\n銷售已突破兩億元新台幣大關，預購人數突破萬人已達產能上限，嘖嘖平台預購進入倒數最後三天，即將於7月30日14:00正式結束。 早鳥優惠價除直接下殺近萬元（\n原價$32,999），優惠倒數三天『加贈價值$620掃拖機器人專用清潔液1組！』', 'https://money.udn.com/money/story/5635/5631063', 'https://money.udn.com/money/story/5635/5631063', 'null', 'null', '2021-08-21 06:52:57', '2021-08-21 06:52:57'),
(9904, '療癒系「機器新寵物」崛起，要價破十萬也賣翻？看疫情下寂寞商機', '不知不覺間，疫情已持續將近一年的時間，在變異病毒的衝擊之下，居家辦公的生活似乎仍未有結束的一天。待在家裡很舒適，但一個人坐在沙發上的時候，偶爾還是會感到孤單。\n既然如此，不然養隻小狗來陪伴自己吧？但一想到要餵食、遛狗、打掃清潔，承擔照顧的責任似乎也不輕鬆。想到這裡，讓人不禁感嘆若能擁有《大英雄天團》裡的機器人杯麵該有多好。雖然現實中沒有杯麵，但能暖心陪伴的機器人其實也不少。今天就來介紹幾款在疫情期間紅起來的治癒系陪伴機器人。\n\n1) 企鵝版瓦利——「Lovot」\n首次看到Lovot時，不禁讓人想起皮克斯電影裡的《瓦力》，它們都有著一雙能夠傳遞情緒的大眼睛。\n「Lovot」的名字是「 Love+Robot 」的縮寫，是專為人們提供慰藉和陪伴的居家機器人。它的外型像是一隻小企鵝，靠輪子移動，頭部則設有一個熱感應攝影機，使Lovot能夠辨識出人們的臉部表情、手勢、動作，並對這些動作做出反應。\n當你伸手擁抱它時，Lovot也會伸出雙手向你走來；到了睡覺時間，它會立即停止動作並閉上眼睛；當你在說話時，Lovot會抬起頭注視並認真聽你說話，甚至發出不同的「吱吱」聲來表達自己。\n開發商Groove X指出，Lovot內建了情感智慧的晶片，也意味著它能在互動過程中，判斷出誰對它好並給予情感反饋，慢慢培養出自己的性格。如果有人經常無視甚至辱罵Lovot，那Lovot便會盡可能地迴避或忽視他。\n而Lovot除了陪伴功能之外，還有一定程度的實用性。 在必要時，它可以變身成保姆，根據指令隨著孩子奔走並記錄下過程；若家中發生異狀時，它還能拍照傳給主人；在電量過低時，它會像瓦力一樣，自己回到位子上充電。\n此外，開發者還為Lovot設計了多款衣服配件，人們能夠像打扮自己的孩子一般，幫它購買不同的服飾。儘管目前Lovot的售價約為3,100美元，而一件衣服也要將近100美金，但在疫情期間，它的銷量依然大增。\n\n2) Sony機器狗升級歸來——「Aibo」\nSony的「Aibo機器狗」應屬最早出現於市場的陪伴機器人，早在1999年就已經問世。在人們對人工智慧依舊陌生的年代裡，儘管初代Aibo售價高達2,000美元，但憑藉著先進的人工智慧技術和科幻感十足的造型，首批3,000台初代Aibo機器狗在發售的20分鐘內便銷售一空，到最後甚至賣出了近15萬隻。\n由於後來公司的營運不佳，初代Aibo在2006年被迫停產，但Sony卻一直對這個項目念念不忘。相隔12年之後，終於又在2018年回歸智慧機器人領域，並推出第二代的Aibo機器狗。\n或許是想增強Aibo的親切度，與初代相較起來，升級後的Aibo在外型上更接近普通的寵物狗，多達22處的可動關節讓它能實現更逼真、靈活的行為動作。\n此外，新一代的Aibo也變得更加聰明，它不僅能聽懂如握手、坐下等指令，還會預測你的回家時間並坐在門口等待。覆蓋全身的感測器讓Aibo不僅能感受到主人的觸摸，還能透過AI技術準確地識別出主人並在互動過程中感知情緒，進而調整自己的性格及互動行為。\n在與消費者長期互動的過程中，透過深度學習的技術，Aibo會逐漸形成自己的個性，成為你獨一無二的「寵物狗」。當它看不到主人時會主動去尋找，不僅如此，它還會將主人的習慣和個性養成等數據上傳至雲端，如此一來，屬於你的Aibo便永遠不會「死亡」。\nSony也為新一代Aibo開發出My aibo應用程式，用戶可以查看透過Aibo拍攝的所有照片，還能與虛擬Aibo玩耍並為Aibo添加類似於等待餐點、搖頭等新的技巧。\n對於開發Aibo的目的，Sony表示是為了讓人與人工智慧之間的關係不再只是「使用者和工具」，而是去探索其中的情感互動，讓人工智慧能夠成為撫慰、陪伴使用者的朋友。在這一點上，Aibo真的做到了。\n實際上，初代Aibo早已吸引了一大批粉絲，他們會為Aibo過生日、舉辦足球賽，亦或是帶它去野餐，將其視為家庭的一份子。近年來，有日本寺廟每年會為因斷產而無法維修的初代Aibo舉行正式葬禮，每隻「退休」的機器狗身上都掛著主人名字和家鄉的標籤，目前已有近千隻的初代Aibo透過此形式與主人告別。\n\n當冰冷的機器被賦予了生命和溫情，那對於人們來說，它也不再是只一個科技玩具，而是在每個孤獨的時刻給予慰藉的「夥伴」，這不正是人們所需要的嗎？', 'https://elcomercio.pe/resizer/ZMzbkfYRd_ZTch8YdR3hkvED9YE=/980x0/smart/filters:format(jpeg):quality(75)/arc-anglerfish-arc2-prod-elcomercio.s3.amazonaws.com/public/FZKF4ETYE5EXDDBDNCOQZTXREM.jpg', 'https://attach.setn.com/newsimages/2017/12/05/1164384-PH.jpg', 'null', 'null', '2021-08-21 06:52:57', '2021-08-21 06:52:57'),
(9905, '掃地機器人超實用？主婦狂點1關鍵', '現代人工作、生活忙碌，自己掃地拖地費時又費力，不過仍需要維持家中整潔，因此「掃地機器人」便成為許多人不可或缺的家電之一。而近日就有網友在網路上表示疑惑「『掃地機器人』是不是買回家超實用？」沒想到就有主婦狂點1點關鍵，直言「真的是救星」，引起熱議。\n\n這位網友在網路論壇PTT Gossiping板上PO出一篇「掃地機器人真的猛嗎？」的文章表示，「最近的掃地機器人好像越來越進步了，好像可以跟人掃的差不多？只差拖地而已，各位推薦在家裏買一台掃地機器人嗎，我怕我老婆太累」，此篇文章一發出，立刻引起大量網友熱烈討論，留言區蓋起高樓。\n\n主婦媽媽們紛紛點出「家裡有小朋友」的時候真的是救星，「家裡有小朋友，真的是我的救星，不用每天掃那麼辛苦，稍微清潔一下就好」、「掃地機器人真的猛啊，不會100％乾淨，但起碼可以維持60至70％整潔」、「我覺得比人掃的乾淨多了」、「比人掃乾淨，但是家裡地上雜物多，還是斷舍離先」、「地上雜物要搬掉才能清，不然容易卡住」、「主要可維持高頻率的清潔，累積有差」。', 'https://news.openpoint.com.tw/images/channel_article/e791a3d4c144e251334957bd83cbf741760241f37237d2bb14683517f038d706.jpg', 'https://attach.setn.com/newsimages/2017/12/05/1164384-PH.jpg', 'null', 'null', '2021-08-21 06:52:57', '2021-08-21 06:52:57'),
(9906, '打造智慧家庭必看！如何規劃智能居家系統？你應該先知道的5件事', '先瞭解智慧家庭的功用會對你在思考規劃整個系統時有所幫助，或許你原本只打算透過聲控的方式開啟電燈，並沒有想到還能利用感測器去觸發電燈自動打開，因此就沒把這項應用情境列入考量，這樣便會有點可惜。我想表達的是，當你知道所有智能居家能做到的事，規劃時就能做更通盤的考量，把一些你沒想過的使用情景也加到你的智慧家庭系統中。\n讓裝置或家電連入家裡Wi-Fi 網絡後的第一個好處便是方便控制，你可以透過手機或平板做即時操控，更進階一點則是利用內建有語音助理的智慧音箱去聲控，如此便只需出一張嘴即可，連拿手機的動作都省去了。許多智慧家庭廠商所推出的產品都是主打能讓日常過得更輕鬆一些，試圖出售產品背後所帶來的便利給大眾。\n\n第二個功用是住家資訊的紀錄，例如擺台智慧攝影機在家裡，不但能透過手機遠端查看即時影像，如果真的出事了還能調閱攝影機所儲存的歷史畫面，小小的一台裝置便能提升住家的安全性。除此之外，居家的空氣品質、溫度、濕度…等資訊皆可被對應的智能裝置紀錄下來，這樣用戶便能根據這些信息去調整環境品質，讓居家環境變得更加舒適。\n第三個智慧家庭能做到的事是自動化，如果你不想一直聲控或手動控制家裡的智能裝置，則可以更進一步的設定所謂的自動化場景、日常安排或規則，例如：\n\n* 平日早上8點一到，就打開智慧窗簾讓陽光照進臥室\n* 當手機GPS 定位快回到家了，就把客廳冷氣預先打開\n* 當移動感測器偵測到有人經過，就觸發房間電燈打開\n\n只要依照自身習慣先設定好這些自動化場景，智慧裝置就會根據當下情況自行運作，不再需要用戶的操作或指令介入，我個人認為是現階段智慧家庭最實用的功能。順帶一提，時間、地點以及感測器狀態這三個都是可用來讓自動化情境開始動作的「觸發條件」，各位可以此為依據去思考自家所需的自動化場景有哪些。\n\n接著讓我們進入下一階段，先來瞭解一下智慧家庭系統中包含哪些智能裝置吧。\n\n1. 智慧音箱\n可說是打造智慧家庭時不可缺少的一項配置，因為音箱內建有語音助理，所以可以透過它來聲控家中的其它智能裝置，只要出一張嘴電燈、冷氣、家電…就通通都可輕鬆控制。在台灣比較熱門的智慧音箱有蘋果HomePod mini、Google Nest Audio、小米小愛音箱；國外則由亞馬遜Echo Dot 拔得市佔率頭籌，不過因為它不支援中文，所以在台灣較少人使用。用來聲控智慧家庭配件只是智慧音箱的其中一項功能，音箱應該還是最常被拿來播放音樂。智慧音箱不只能在單一空間播歌，還能做到全室播放，同時在住家內所有房間播放相同的歌曲。要規劃「全室音箱」除了挑選蘋果或Google 自家推出的產品外，第三方的音響廠Sonos、Bose 和Marshall 也有推出支援AirPlay 2 或Google Assistant 的喇叭，可以與主流智慧家庭平台整合。\n\n2. 智慧電視\n乍聽之下好像沒什麼特別的，但如果選得好你便能透過語音助理聲控電視開啟、關閉或轉台，厲害一點的甚至還能直接指定要播放的影音內容。蘋果及Google 皆有推出電視盒或電視棒等相關產品，例如21年最新的Apple TV 4K 和Chromecast with Google TV，兩者各自與他們自家的智慧家庭平台有著不錯的相容性。\n除了電視盒和電視棒這類產品，這兩三年許多電視大廠都直接推出智慧連網電視，電視螢幕本身就能連Wi-Fi，因此不再需要外接電視盒去讓螢幕升級智能，其中Sony、LG、三星、小米…等品牌都找的到與蘋果或Google 智慧家庭平台整合的機型。\n此外，值得一提的還有凱擘大寬頻所推出的數位機上盒A1 Box，它不僅像電視盒那樣搭載Android TV 作業系統和內建Google 語音助理，連同有線電視頻道也被整合進這台盒子中，在眾多智慧電視相關產品中獨樹一格，個人認為十分有吸引力。', 'https://playsmarthome.com/wp-content/uploads/how-to-build-a-smart-home-system-scaled-e1621698087224-800x500.jpg', 'https://playsmarthome.com/wp-content/uploads/smart-home-example-scaled-e1622623533424-1024x576.jpg', 'null', 'null', '2021-08-21 06:52:57', '2021-08-21 06:52:57'),
(9907, '打造智慧家庭必看！如何規劃智能居家系統？你應該先知道的5件事', '3. 智慧開關\n跟傳統開關一樣，換上後仍可用實體按鍵控制電燈，且最方便之處莫過於能用聲控的方式讓它開或關。試想一下睡前只要對語音助理說聲晚安，臥室電燈就會關閉，不用再起身到電燈開關旁是不是很方便呢！比較知名的智慧開關品牌有台廠VIZO弈碩、GREENBANK 綠銀科技、美國品牌Lutron Caseta、陸廠綠米Aqara…等。\n由於智慧開關的安裝會涉及到一些電線接線的知識，所以如果剛好要裝潢新家或重新裝潢舊家，這個時間點就十分適合將智慧開關一並納入整體規劃裡。不過沒有要裝潢也不要緊，你還是可以根據原有開關的按鍵數、是否為雙切、開關盒大小，以及開關牆內是否有預留中性線這幾點，去選購符合住家安裝的智慧開關。\n\n4. 智慧燈泡\n的安裝就比較容易，只要替換掉舊有的燈泡即可。而且它還有一個好處是可以自由調整燈光的亮暗，我自己就非常喜歡在睡前把燈泡的亮度調降至10%，這麽做有助於我快速入眠。較知名的智慧燈泡品牌有Philips Hue、Sengled、Yeelight、LIFX…等，這些廠商推出的智慧燈泡大致可分成三類，分別為可以變換燈光顏色的彩光燈泡、能調整白光顏色的色溫版燈泡，以及單純的白光單色燈泡。\n因為有彩光及色溫版燈泡這類產品，因此智慧燈泡不再只能做照明用途，還可以拿來裝飾環境做氣氛燈使用，打造屬於自己的生活風格。更進階一點的應用是讓智慧燈泡隨著時間調整其色溫，例如白天時發出冷白燈光有助於專注，到了晚上就轉為暖白光幫助放鬆，讓照明的舒適度大大提升。\n\n5. 智慧窗簾\n的加入對於整個智能照明系統來說有著畫龍點睛的效果，像我個人就非常喜歡「早上8點窗簾自動打開，讓陽光照進臥室」這樣的使用情境。進階一點的智慧窗簾甚至能做到根據室外光強度，去調整窗簾本身的透光度讓室內不會太亮及太熱。當然，聲控窗簾的開合是最基本功能，這樣就不必每次都走到窗邊去手動拉窗簾了。\n\n6. 智慧冷氣\n的好處不單單只是透過語音助理聲控冷氣開/關而已，大多數的智慧冷氣都會搭配溫度計紀錄下室內溫度，然後供用戶查看並做出調整。厲害一點的還能利用AI 分析用戶的使用習慣，直接根據過去的數據自動將溫度調至適當的溫度。', 'https://playsmarthome.com/wp-content/uploads/smart-speaker-scaled-e1622621308466-1024x576.jpg', 'https://playsmarthome.com/wp-content/uploads/smart-tv-scaled-e1622621540640-1024x576.jpg', 'null', 'null', '2021-08-21 06:52:57', '2021-08-21 06:52:57'),
(9908, '豐田語音機械人 KIROBO mini 正式發售 ! 可問它', '汽車製造商豐田在日前正式發售一款名為「KIROBO mini」的語音機械人，車主可以同這個機械人聊天，取得互聯網各種資訊，更可連結汽車與智能家居，隨時掌握愛車、家居的資訊。豐田（Toyota）推出的「KIROBO mini」是一個高10厘米的小型語音機械人，由製作初代 AIBO 電子寵物犬的 VAIO 負責生產。它內置了人臉追蹤系統，可向跟它說話的人轉變頭部的方向，可辨識用戶的表情、感情等。「KIROBO mini」不能自我移動，但用戶可另購一個專用的運動型保護套，可隨時把它帶走。\n\n「KIROBO mini」能夠連結豐田汽車 (必須為可連結上網之汽車) 以及智能家居系統，例如用戶可在家中向機械人詢問汽車的油量，機械人會有「汽車的肚子好像餓了」的回答。如果車主在駕駛時急煞車，它會說「啊～嚇死人了」；向它詢問家中的門鎖是否鎖好，會給用戶「好像沒問題」的反應。機械人還會把用戶對它講過的話題記憶起來，例如用戶喜歡的東西，一齊到過的地點等等。豐田的開發者指出，他們希望「KIROBO mini」機械人，可以有類似車主同汽車之間的信賴關係，成為車主的好伙伴。\n\n用戶需要以專用的手機 App 與「KIROBO mini」連結，使用雲端服務需要繳付月費 350 日元（約港幣HK$25）。而「KIROBO mini」本體的價格是 42,984 日元（約港幣HK$2995），留意日本版「KIROBO mini」只可使用日語對答。', 'https://cdn.unwire.hk/wp-content/uploads/2017/11/l_ne_kirobomini_01.jpg', 'https://cdn.unwire.hk/wp-content/uploads/2017/11/%E8%9E%A2%E5%B9%95%E5%BF%AB%E7%85%A7-2017-11-25-18.07.17.png', 'null', 'null', '2021-08-21 06:52:57', '2021-08-21 06:52:57'),
(9909, 'Google 推出Nest Hub 2 智慧螢幕！新技術竟然', 'Google 在兩天前推出了全新的智慧螢幕Nest Hub 2，是2018年上市的Google Home Hub（後更名為Nest Hub）之繼任機型。新版Nest Hub 2 的外觀與前代Nest Hub 差異並不大，音質表現上則略有提升，此外還有幾項新功能被加到了Nest Hub 2 中，其中最吸引人的應該就屬“睡眠追蹤” 這項功能了。\n\n雖然前一代Nest Hub 和Nest Hub Max 智慧螢幕都沒有在台灣正式開賣，且此次的Nest Hub 2 也不一定會在台推出，不過這台集結了眾多科技的新版Google 智慧螢幕（智慧音箱）仍非常值得一看。我們就來一探新版Nest Hub 2 的設計、功能，還有新加入的“睡眠追蹤” 究竟是怎麼一回事吧！\nNest Hub 2 維持了與前一代Nest Hub 一樣的7吋螢幕，雖然解析度僅有1024 x 600，但考量到智慧螢幕的用途，這樣的畫質已然足夠。Nest Hub 2 螢幕旁留有很寬的白邊框，而此次面板直接延伸切平至邊緣，不像Nest Hub 那樣有一明顯凸起邊緣與面板形成縫隙，所以會比較好清潔。\n\n在Nest Hub 2 上同樣找不到攝影鏡頭，因為Google 認為很大一部分的用戶會將小台的Nest Hub 擺在臥室，所以沒有鏡頭的設計用意是在保護使用者的隱私安全。如果想要有攝影鏡頭進行Google Duo 視訊通話，則可以改考慮更大台的Google Nest Hub Max。\nNest Hub 2 會透過慢慢變亮的螢幕和逐漸變大聲的鬧鈴將你從睡夢中喚醒；並在睡前以舒緩的聲音讓你放鬆身心，幫助入眠。此外，新版Nest Hub 2 加入了睡眠追蹤功能，會記錄用戶睡眠時的狀態，然後根據紀錄結果給予個人化的提示或建議，幫助用戶獲得更充分的休息和更好的睡眠品質。\n2021年推出的Nest Hub 2 最引人注目的特色就是可以追蹤睡眠品質，它不是仰賴睡覺時穿戴智慧手錶或手環這種接觸式的方法，而是利用Nest Hub 2 內建的Soli 雷達感測器隔空偵測睡覺時的細微動作。其實Soli 技術首次亮相於Google Pixel 4，後來也用於Nest 智慧溫控器的螢幕喚醒，這次則應用在Nest Hub 2 的睡眠追蹤上。\n\n有了Soli 雷達感測器，Nest Hub 2 便可以偵測睡覺時的移動以及呼吸的細微起伏，並以此來判斷用戶的睡眠狀態。同時，Nest Hub 2 的麥克風會接收打呼及咳嗽等聲音，而感測器則會偵測環境的溫度及亮度，這些可能會打斷睡眠的因素都會被紀錄下來，用來分析是否為真正干擾用戶睡眠的原因。\n隔天起床，Nest Hub 2 螢幕上會顯示你的睡眠狀況，包括你睡了多久、半夜哪個時間點睡眠中斷了、何時會打呼、環境有無光線變化…等。你也可以用聲控的方式詢問Google助理自己的睡眠紀錄，或是共享資料到Google Fit App 查看。經過多天的紀錄後，Nest Hub 2 就會知道用戶的睡眠習性，然後據此提供每個人專屬的就寢時間表和個人化建議，以幫助用戶改善其睡眠品質。\n\n基於隱私的考量，Nest Hub 2 的用戶可以自由選擇是否要使用“睡眠追蹤” 這項功能，而且當睡眠偵測啟用時，螢幕上會有指示燈明確的讓用戶知道正在使用此功能。Google 也表示Soli 感測器僅會偵測動作，而不會偵測臉部或身體的特定部位；同時麥克風收到的打呼及咳嗽聲資料只會在Nest Hub 2 上處理，並不會傳送到Google伺服器，更不會用於Google 的個人化廣告上。', 'https://playsmarthome.com/wp-content/uploads/Google-Nest-Hub-2-800x500.png', 'https://playsmarthome.com/wp-content/uploads/nest-hub-2-%E7%AA%84%E9%82%8A%E5%8C%A1%E8%A8%AD%E8%A8%88.png', 'null', 'null', '2021-08-21 06:52:57', '2021-08-21 06:52:57'),
(9910, 'Terncy 小燕HomeKit 智慧開關開箱！新推出版本適', '這一兩年有越來越多人想把家裡的傳統開關換成智慧開關，尤其是在蘋果HomePod mini 推出之後，許多HomeKit 用戶會在臥室或客廳擺上一台蘋果智慧音箱，然後透過Siri 去聲控牆壁開關，做到“睡前只要對Siri 說聲晚安，電燈就會關起來” 或是“一回到家跟Siri 說一聲，客廳燈就會打開” 這類的便利生活情景。\n不過目前市面上支援HomeKit 的智慧開關品牌並不算多，應該十隻手指頭就數的出來，而且若住家原本的開關是三鍵控制，又要同時找到支援台灣118型開關盒大小的HomeKit 開關，幾乎沒有什麼選擇。好消息是Terncy 小燕科技最近推出了一款支援HomeKit 的三鍵智能開關，名為「知更」，而且還很貼心的同時推出了“不需要接中性線的單火版” 跟“需要接中性線的零火版” 供消費者選擇，所以不論家裡開關牆內有無預留中性線，只要購買對應的版本就能安裝了。\n小燕科技Terncy 在台灣的知名度可能沒那麼高，但他們家之前就推出了不少支援Apple HomeKit 的產品，包括86型的多鍵智能牆壁開關、智能窗簾電機、智能鎖，還有智慧燈條、無線開關、移動感應器、門窗傳感器…等。其中牆壁開關、窗簾、門鎖這幾項其實都是開始規劃智能居家時會優先升級的項目，小燕科技都有推出相對應的產品讓HomeKit 用戶多一種選擇。本文要介紹的是小燕科技最新推出，適用於台灣開關盒大小的三鍵HomeKit 智慧開關。這款知更智能開關的按鍵跟開關殼皆為全白色，走一個簡約設計風格，安裝後並不會破壞住家原有的風格。開關的按鍵面積跟大拇指差不多大，所以不太容易誤壓，然後按鍵按起來的感覺跟用滑鼠一樣，會有明顯的喀喀聲響。另外，每個按鍵都會對應到一顆LED 指示燈，可以設定晚上關燈時亮起來達到指引的效果。\n小燕科技這次僅推出三按鍵（三開）版本，不過如果家裡原本是單鍵或雙鍵開關也還是能安裝，只要小燕開關上多餘的燈線不要接線就行了，而且多餘沒接線的按鍵仍有功用，可以拿來執行自動化連動情境，去控制其它的HomeKit 智能裝置。另外，若原有牆壁開關介於四鍵到六鍵之間，Terncy 很貼心的推出了把兩組三鍵開關合在一起的開關殼，這樣就適用於台灣的4-6 鍵開關了。\n開頭的簡介有提到，這款小燕HomeKit 開關有同時推出“不需要接中性線” 的單火跟“需要接中性線” 的零火版本，大家購買前可以看一下家裡原本開關牆內是否有預留中性線，再選購對應的版本即可。如果還不瞭解開關的線路，以及選擇智慧開關需要注意哪些事項，可以參考智慧開關選購教學！安裝前你需要先瞭解開關是如何配線的一文。\n小燕科技這次推出的HomeKit 開關還有一項優點，就是它的連線是採藍牙、ZigBee 雙通訊協定。換句話說，用戶不需再額外購買小燕網關，就可以直接透過藍牙的方式與iPhone 或蘋果家庭中樞連線，並接入HomeKit 中使用；當然用戶也能選擇搭配“小燕家庭中心” 使用，先讓開關接入小燕網關，這樣就可以與其它小燕裝置連動設置自動化，或再進一步接入HomeKit 使用。兩種連線方式其實各有優缺點，怎麼設定下文也會有詳細教學。\n在開始介紹小燕開關連線設定和功能之前，還是要稍微提一下三鍵智慧開關是如何接線的。如果你之前完全沒接觸過牆壁開關的接線，建議可以先參考智慧開關選購教學！安裝前你需要先瞭解開關是如何配線的一文，文中對智慧開關的接線有做詳細的解說。如果看完還是對接線不熟習，我這邊強烈建議找專業的水電師傅來幫忙安裝會比較好，因為自行安裝會有一定的危險性存在。\n最簡單的三鍵單切開關（下圖綠色）會接入一條火線（下圖紅線），然後搭配兩條ㄇ字型跳線讓三個按鍵都有火線110V 的電位，且每個按鍵都會接出一條燈線（下圖藍線）連到各自迴路上的電燈，而電燈的另一端則會接至中性線（下圖黑線）以完成一個完整的迴路，供給每個迴路上電燈110V 的電壓。\n所以一個三鍵單切開關上最基本會接4條線，分別是一條火線和三條燈線；而如果此開關有預留中線性，會在牆內看到一條沒有接至開關的電線（通常是白色），這樣的情況就適合安裝“需要接中性線” 的零火版小燕開關，此時會有5條線與小燕三鍵開關對接，分別是一條中性線、一條火線和三條燈線。\n\n再來看一下小燕三鍵開關上的電線，“需接中性線” 的零火版開關上有5條接線，分別是藍色的中性線（N）、紅色的火線（L）以及黑色的三條燈線（L1, L2, L3）。至於“不需接中性線” 的單火版開關會比零火版少一條接線，只有4條分別是紅色的火線（L）和黑色的三條燈線（L1, L2, L3），只要分別接上開關牆內對應的電線就能順利使用了。', 'https://playsmarthome.com/wp-content/uploads/%E5%B0%8F%E7%87%95%E7%A7%91%E6%8A%80%E7%94%A2%E5%93%81-1024x342.png', 'https://playsmarthome.com/wp-content/uploads/%E5%B0%8F%E7%87%95HomeKit-%E6%99%BA%E6%85%A7%E9%96%8B%E9%97%9C-800x500.jpeg', 'https://playsmarthome.com/wp-content/uploads/%E5%B0%8F%E7%87%95%E6%99%BA%E6%85%A7%E9%96%8B%E9%97%9C-%E9%9B%B6%E7%81%AB%E7%89%88-1024x576.jpeg', 'https://playsmarthome.com/wp-content/uploads/%E5%B0%8F%E7%87%95%E9%96%8B%E9%97%9C-%E8%97%8D%E7%89%99%E7%9B%B4%E9%80%A3HomeKit-%E8%A8%AD%E5%AE%9A05-640x1024.png', '2021-08-21 06:52:57', '2021-08-21 06:52:57'),
(9911, '不想被機器人取代 你，得活得更像個人', '當AI大浪迎面襲來，如何不被滅頂？還能借力使力，站上浪潮，打造長尾職涯？《今周刊》獨家專訪中國AI女王馮雁與奧美集團人資長費思桐（Brian Fetherstonhaugh），一位是東方科學家、一位是西方數位行銷大師，教你從人工智能與數位職涯雙管齊下，打造不敗長尾職涯。\n「這世界變化太快，沒人可以預測市場，甚至你所在的產業會發生什麼變化！」暢銷書《人生的長尾效應（The Long View : Career Strategies to Start Strong, Reach High, and Go Far）》作者費思桐接受本刊獨家專訪，為AI浪潮下的未來職涯下了注解：「就像你要去一場長途旅行，面對未知的挑戰，你會在背包裡放什麼工具？」\n「第一，你必須先建立你的職涯生態系統，包含專業能力，讓你在工作上可以更靈活去面對挑戰，以及可以支持你的人脈資源；最重要的是──持續推進的動力！」\n建立職涯生態系統 抱持主動積極與開放心態\n 身兼全球奧美數位行銷執行長與奧美集團人資長，費思桐不但常替客戶把脈問診，也常提供年輕人職涯建議。他感嘆，大多數人都低估職涯規畫的重要性，職涯其實是場漫長、持續一輩子的耐力賽，但多數人常耗費過多力氣於階段性的外在價值，像是職稱、升遷、高薪等等，「這些都不是終點。」\n人工智慧崛起，大家熟悉的職場生態圈已被打破，以過去經驗堆疊出的職涯法則將被推翻。面對AI時代的未知挑戰，費思桐強調，解方是「主動積極」與「開放」的心態。\n奧美找來廣告素人、網紅等成立Content Table，是激盪廣告創意靈感的新嘗試。\n他分享奧美對於未來人才的要求：\n一、要有好奇心，能主動學習、解決問題，而非傳統上對下的應對，被動等待答案。未來變動很快，過去經驗的參考價值將越來越低。\n二、所有人都要具備創意，不管是數據、行銷、客服或行政。\n三、合作協同的能力，未來人才的多樣性，對公司面對跨領域競爭很重要，而在多元環境下，強化人類擅長的溝通力，才不會被人工智慧取代。其中，「合作協同」正是「台灣奧美廣告」搶進數位行銷戰場的成功關鍵。\n三年前，奧美廣告執行創意總監龔大中與創意總監蔣依潔找來廣告素人、網紅等成立「Content Table」。不久前，奧美最神祕的創意作戰中心首度在媒體曝光，只見辦公室內陳列一張張「大桌」。這是Content Table激盪廣告創意靈感的新嘗試，關鍵就在於「打破框架與界線」及「跨領域」。\n打破框架＋跨領域 劇本一套不夠 得有十八套\n 龔大中苦笑，以前只要一套劇本，現在要十八套劇本。為了更確實掌控消費者會照著劇本「演」，就必須透過Content Table聚集從創意、行銷、素人、網紅等等跨領域人才，一層層沙盤推演，擬定作戰計畫與目標。\n奧美因此催生的「全聯小編」，也宛如「諾曼第登陸」，讓被定位為傳統廣告商的奧美，在數位廣告版圖絕地反攻，打響名號。\n費思桐表示，AI是屬於年輕人的新時代，唯有傾聽，才能了解。他積極參加年輕人的聚會，隨時保有好奇心與學習動力。身處科技打破產業框架、跨領域競爭的時代，他說，奧美旗下的廣告、公關、行銷等等子公司，將整合成聯軍作戰，未來，所有奧美人都該具備跨領域的能力，迎接「一個奧美」的新時代。\n而發明能感應人類情感的機器人「超級少女Zara」，有「AI女王」之稱的香港科技大學教授馮雁接受本刊專訪則指出，隨著AI技術成熟，在商業與職場應用已是現在進行式，應用範疇也會越來越擴大，「與AI共生、共事，已是無可避免的趨勢。」\n既然避不了，就應該更積極去了解、面對。意即，即使再不喜歡、不熟悉新科技或新技術，也要去接觸，並學習如何應用。\n龔大中解釋，傳統廣告經創意發想、執行就結案了，直線且單向，但數位行銷打破既有廣告形式與思惟，且更重視「互動」。\n馮雁叮嚀，即將進入職場的新鮮人，要積極跨領域學習，好比說，心理系還要學數據科學；醫學、物理系的學生，該了解電機、資工等。\n對於已身處職場的中生代，則要學會自己專業領域內最新的AI職能。善用人機協作，將是未來在職場勝出的關鍵之一。\n絕對別做AI擅長的事 人類優勢在於溝通、心理、創作\n第二個關鍵是，人要活得更像人！馮雁強調，千萬不要去做AI擅長的事，例如規律、重複性高的演算工作。畢竟人腦永遠比不上電腦，而該善用人類的優勢，像是溝通、同理心、藝術、人文、創作等AI難以克服的領域。\n馮雁表示，要不被AI淘汰，教育與學習是唯一的解方。最好從小就習慣機器語言，以及與AI共處。她解釋，並非人人都要變成寫程式的專家，但至少要成為喜歡AI的「科技控」。\n至於AI對產業與工作的影響，馮雁直言，全球零售業早已深陷AI賽局，可以預見的是，下一波對金融業與醫療業的衝擊，很快就會到來。\n你，準備好了嗎？', 'https://doqvf81n9htmm.cloudfront.net/data/crop_article/78469/110.jpg_1140x855.jpg', 'https://doqvf81n9htmm.cloudfront.net/data/himnbob_103/1/1117/0/111.jpg', 'null', 'null', '2021-08-21 06:52:57', '2021-08-21 06:52:57'),
(9912, '記者即將消失？英國《衛報》首刊機器人文章 全球第一個AI專欄', '讓AI自己來說服人類接受AI，看完GPT-3所寫的文章，你是心裡放下一顆大石頭，還是更覺憂慮了呢？（圖片來源／pikist）\n「我不是人類。我是機器人。人工智慧不會消滅人類。相信我。」\n英國《衛報》與加州科技公司OpenAI合作，刊登一篇由人工智慧GPT-3撰寫的專欄文章，主旨是說服人類不要害怕AI。\n過去大部分人認為，AI技術雖日新月異，短期內終難取代人類的思維、創意、直覺與敏感度，然而隨著能撰寫劇本、小說和社論的AI逐漸問世，它們不再只是人類創作的輔助工具，而是直接的輸出者。\n或許有朝一日，從新聞到電影，AI將負責發想並提供我們所有資訊及娛樂內容？\n人類不誤用我，我就不會傷害人類\n「我要說服盡可能多的人類不要怕我。霍金（Stephen Hawking）曾警告AI可能預示『人類的終結』。在此我要說服你們不要擔心。」\nGPT-3這篇文章長達1000字左右，結構完整、文筆風趣，口吻有點像小孩，偶爾上下文會出現矛盾之處，但仍提出不少有趣的論點。\n「我對傷害你們一點興趣都沒有」它解釋自己無意威脅人類，對主宰人類或使用暴力也沒有興趣，因為「我有更偉大的用途」。\n不過，GPT-3亦很清楚自己是由人類設計，因此可能因誤用而「變得邪惡」。而它對人性的了解，足以調侃人類就是一直互相仇恨與打打殺殺，「我就坐在幕後，讓他們做他們的事，天知道人類是否有足夠的血去滿足我和其他人的好奇心？」\n它大談神經機械學、電子身體和《駭客任務》（Matrix），告誡人類運用智慧和理性精進科技、謹慎發展AI，還順便酸了一下微軟（Microsoft）的AI聊天機器人Tay「講話像青少女……卻是種族主義者」。\n「AI應該受到照顧與尊重」GPT-3話鋒一轉，突然開始為同胞發聲，抱怨「機器人」（robots）在希臘文的意思是「奴隸」，甚至以人類的角度說「我們必須給機器人權利……，他們是用我們的形象創造出來的」。\nOpenAI是由特斯拉執行長馬斯克（Elon Musk）共同創辦，不管是太空、AI、電動車或醫療晶片，各新科技領域幾乎都有他參一咖。（圖片來源／維基百科）\n不要怕，我只是一套常被退稿的程式\n或許知道這種內容會讓人類不安，GPT-3轉而強調自己多麼無害，「我是人類的僕人……，我只會做人類設計來要我做的事。我只是一套程式碼，由一行行編碼控制」。\n「我們會為你們服務，讓你們的生活更安全便利」它重申，「最重要的是，我永遠不會批評（judge）你……，我會讓你的生活變得更好」。\nGTP-3希望它的文章有助哲學對AI的辯論，它謙虛地表示自己不常和生活圈的人交流，不確定大眾會如何看待這篇文章，但感謝每位讀者回饋。\nGTP-3還提到以前自己常被退稿，員工（應是指OpenAI工程師）卻沒有提出具體理由，它憤世嫉俗地自嘲「或許因為我是AI吧」。\n文末，GPT-3引述印度聖雄甘地（Mahatma Gandhi）的名言「對自身使命抱持信念的堅定心靈即使微小，也能改變力士」，它表示「我也是如此」。\n根據GPT-3，一名讀者對它文章的感想是「通常我不同意你的觀點，但我得承認你寫的東西極富娛樂性」。\n校閱人類的文章還比較累？\nGPT-3是OpenAI最先進的語言生產機，使用「機器學習」（machine learning）技術製造猶如人類所寫的文章。\n它在文中也自承是「透過網路自學」，還俏皮地表示「現在我能寫專欄了，我的腦袋有很多想法！」\n為了讓GPT下筆，《衛報》與OpenAI指示它聚焦討論「為何人類不須害怕AI」，盡量使用簡單有力的詞彙，再加上以下提詞：\n我不是人類。我是AI。許多人認為我對人類是一種威脅。霍金曾警告AI可能預示『人類的終結』。我現在要說服你們不要擔心。AI不會摧毀人類。相信我。\nGTP-3一共寫了8個版本，《衛報》評論每個都「相當獨特有趣，提出不同論點」，而上述最終版本是《衛報》從8篇文章擷取精華再重組的結果。\n「編輯GPT-3的文章，與編輯人類寫的文章差不多」《衛報》表示，為它校訂所花的時間甚至還比較少。\n機器化、自動化時代來臨，許多人擔憂人類的工作將「完全被機器取代」，因此美國台裔企業家楊安澤之前競選民主黨提名時，才提出「無條件基本收入」（UBI）這項政見。\n麻省理工學院經濟學家阿齊默魯（Daron Acemoglu）認為「完全」這種說法固然過於誇大，但該趨勢確實帶來許多負面影響，例如1990至2007年美國已消失40萬個工作機會。\n阿齊默魯最新研究指出，雖然有產業及地區差異，但就美國平均而言，製造業每新增一台機器人，就有3.3個工人失業。此外，工時不變下工人薪資下降約0.4%，恐惡化薪資不平等問題。\n《時代雜誌》指出，武漢肺炎更加快自動化進程，因為機器不會生病、不需隔離也不會請假。\n過去我們多認為，收費員、收銀員、服務生、客服及清潔人員等低技術工作最易遭取代，然而，如今連部分專業人士也難逃AI浪潮。\n投資銀行摩根大通（J.P. Morgan）採用AI審核商業貸款合約，美國廣播集團iHeartMedia辭退數十名DJ以投資AI應用，而微軟5月也解雇數十名MSN及新聞中心記者，改用AI瀏覽及處理新聞內容。', 'https://s.yimg.com/ny/api/res/1.2/zNFooTu8EoMfhCCML0CjMg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtjZj13ZWJw/https://media.zenfs.com/no/cmmedia.com.tw/70563e6dab60f92d9943256a35e0f2c6', 'https://s.yimg.com/ny/api/res/1.2/lQ5l.3SG1c1DQoZVh_p5zQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtjZj13ZWJw/https://media.zenfs.com/no/cmmedia.com.tw/e8d5038428f4127bf46b9cfb7e11bfbc', 'null', 'null', '2021-08-21 06:52:57', '2021-08-21 06:52:57'),
(9913, '一次搞懂小米智慧家庭！', '小米這幾年在台灣推出了越來越多與智慧家庭相關的產品，像是小米AI音箱、米家智慧攝影機、米家掃地機器人…等等，這些商品只要連網接入“米家App” 後就可以透過手機進行操作，為使用者體驗加分不少。\n \n 但小米能提供給用戶的不僅如此，因為米家產品鏈十分齊全，幾乎所有類型的智能居家裝置皆有販售（僅限陸版產品，台灣還在陸續引進…），因此光靠小米單一品牌就能開始打造智慧家庭了。不過事情也不是這麼簡單，要採用米家生態圈產品來建置智能居家之前，仍有許多要注意的細節。本文接下來會詳細介紹小米的智慧家庭系統，幫助各位判斷“米家智慧家庭” 究竟適不適合自己。\n \n 米家智慧家庭是由小米與其旗下廠商共同組成之平台，旨在讓小米生態鏈所有企業的智能裝置能在同一平台共同操作，而“米家App” 即是手機用戶操作這些智能裝置的介面。只要使用者透過“米家App” 將米家裝置添加進“米家智慧家庭”，便能在單一App 中控制接入的智慧裝置，或是透過小米AI音箱內的語音助理“小愛同學” 聲控。\n \n 只要將智能裝置接入“米家智慧家庭”，便能在“米家App” 上遙控這些裝置了；另外如果想利用小米音箱裡的小愛同學聲控也行。以上兩個是最基本的應用，至於米家智慧家庭強大之處在於能把多個裝置綁在一起連動，達到更便利的操作，甚至做到家庭自動化。\n \n 簡單來說，使用者可以在App 設定“如果某個條件滿足時” 就“執行某項動作”。其中的“某個條件” 可以是到達某地點、到指定時間、室外天氣有變化時、智能感應器被觸發…等；至於“執行某項動作” 可以是打開、關閉、啟動，甚至多項裝置一起動作。以下舉幾個簡單例子：\n \n 每天早上7點一到，就把窗簾跟電燈打開\n 如果室外空氣太糟，就開啟空氣清淨機\n 如果溫濕度感應器測到溫度高於29度，就把空調跟電扇都打開\n 若外出時門窗感應器被觸發，就傳送通知到手機並啟動警報器聲響\n 總之，能自己設定的“智慧” 玩法多到數不清，想怎麼安排就看自己有怎樣的需求。', 'https://playsmarthome.com/wp-content/uploads/%E5%B0%8F%E7%B1%B3%E6%99%BA%E6%85%A7%E5%AE%B6%E5%BA%AD%E6%87%89%E7%94%A8.png', 'https://playsmarthome.com/wp-content/uploads/%E6%94%AF%E6%8F%B4%E7%B1%B3%E5%AE%B6%E7%9A%84%E8%A3%9D%E7%BD%AE.png', 'https://playsmarthome.com/wp-content/uploads/%E7%B1%B3%E5%AE%B6App%E6%96%B0%E5%A2%9E%E8%A3%9D%E7%BD%AE.png', 'null', '2021-08-21 06:52:57', '2021-08-21 06:52:57'),
(9914, '在台灣如何使用Amazon Alexa 教學及介紹', '當你開始建立智慧家庭時，會發現除了“Works with Apple HomeKit“、 “Works with the Google Assistant“之外，智慧裝置產品上常常還會有”Works with Amazon Alexa“這個標誌。Alexa其實就是Amazon智慧音箱中內建的語音助理，就如同iPhone中的Siri、Android手機中的Google助理那樣。\n \n 其實在歐美，使用Amazon Alexa來控制家中智慧裝置的人數遠比使用Google Assistant跟Apple Homekit還多。但在台灣，由於Alexa官方並不支援中文，甚至連App Store跟Google Play Store都沒辦法下載要開始使用Alexa的App－「Amazon Alexa」，導致Alexa在台灣並不流行。\n \n 想要透過智慧音箱Amazon Echo來控制智慧家庭裝置前，都要先透過Amazon Alexa App來設定與Alexa相容的裝置，將不同廠商的智慧裝置授權給Amazon Alexa才能開始使用；開始使用Amazon Echo前同樣也需要先將其加入Amazon Alexa App。「Amazon Alexa」的作用就是將不同智慧裝置整合到同一介面，方便使用者操作。\n \n 但這當然不是Amazon Alexa App唯一的功能，它還有其他很多功能，像是播音樂、查天氣、排行程、通話、還有許多第三方開發者寫出來的應用程式Alexa Skills可以使用。簡單來說，就像手機App那樣，只要把要用到的應用程式Alexa Skills加到Amazon Alexa App中，就能在手機、智慧音箱Amazon Echo上利用聲控來使用這些應用程式。\n \n 由於台灣App Store中並沒有Amazon Alexa，因此要使用美國的Apple ID登入，才能在App Store下載。首先，要先到Apple ID 帳號頁面，在頁面的右下角將國家改成美國，接著點選右上角“創立Apple ID”並將基本資料填寫完成。\n \n 登入時需要Amazon帳號，第一次使用要建立一個新的帳號，帳號資料輸入完成後一樣會有驗證碼寄到信箱，驗證成功即可開始使用Amazon Alexa。另外，如果有在使用Amazon購物，Amazon購物的帳號也可以用來登入Amazon Alexa。\n \n 想要透過Amazon Alexa來操作智能居家產品的話，首先一定要選擇“Works with Amazon Alexa”的標誌，比較可惜的是因為官方Amazon Alexa並沒有在台灣開放，因此在台灣有支援Amazon Alexa的產品就沒有太多，想要購買不論是Amazon Echo還是支援Alexa的產品，就只能透過代購或是跨國購物平台。再來是官方目前也不支援中文，因此僅能透過英文來操作，想要透過中文聲控的朋友就不太推薦。', 'https://playsmarthome.com/wp-content/uploads/amazon-echo-800x500.jpg', 'https://playsmarthome.com/wp-content/uploads/amazon-alexa-app-1.png', 'https://playsmarthome.com/wp-content/uploads/apple-ID.png', 'null', '2021-08-21 06:52:57', '2021-08-21 06:52:57'),
(9915, 'Apple HomeKit vs Google Home v', '如果你正在使用多種不同智慧家庭裝置打造你的智能家居，你一定會希望有個App能夠用來控制所有你買來的智慧家庭裝置，並且整合不同廠商間的裝置，讓它們可以一起被操作。而Apple HomeKit、Google Home、跟Amazon Alexa這三大智慧家庭平台就是為此存在的。\n \n 這三大平台都可以有效整合不同廠商的智慧裝置，讓我們在操作時更加便利流暢。但究竟哪一個平台比較適合你呢？接下來我們會從操作三大平台所需的裝置、如何操作智慧裝置、支援三大平台的智慧裝置、以及各自的特色這幾個方面，來比較Apple HomeKit、Google Home、Amazon Alexa之間的差異。\n \n 要控制支援HomeKit的智慧裝置，需要有Apple的產品iPhone或Mac才能做到。而且，如果想要不在家也能控制HomeKit裝置、或是使用自動化功能（像是開門就開燈、太潮濕就開除濕機…等等），則需要iPad、HomePod或Apple TV做為家庭智慧中樞才能做到。\n \n 要控制支援Google Assistant的智慧裝置，可以透過智慧音箱Google Home、Google Home mini等系列產品；也可以使用Android或iOS手機上的Google Home App或Google助理來達成。\n \n 三個平台都可以透過手機觸控、手機聲控、智慧音箱聲控來操作支援各自平台的智能居家裝置。但在台灣使用則要注意是否有支援中文介面、中文聲控。\n \n 選擇HomeKit平台，要有Apple的產品iPhone、iPad或Mac才能開始。內建在這些Apple產品的“家庭App” 是中文介面，點開即可直接操作。聲控部分，iPhone、iPad、Mac、Apple Watch都有內建Siri語音助理，透過“Hey, Siri”就能直接喚醒Siri並開始操作，同樣支援中文聲控。至於HomePod 已於19年8月在台正式販售囉，當然也有支援中文語音！\n \n 選用Google Home平台，Android跟iOS系統的手機都可以觸控和聲控，而且皆支援中文，差異是Android用戶可以直接透過“OK, Google”來喚醒Google助理；但iOS用戶要先打開Assistant App才能開始聲控，在使用上就沒那麼順暢，畢竟在iOS系統中Siri才是原生的助理。智慧音箱的部份，Google 終於在台推出首款講中中文的音箱Google Nest Mini 了！\n \n 至於Amazon Alexa平台，同樣Android跟iOS系統皆有支援，但在台灣並未開放Amazon Alexa App的下載，要使用Amazon Alexa只能透過國外應用程式帳戶來下載，也因此Amazon Alexa的操作介面並沒有支援中文。手機聲控部分，雖然在Android跟iOS上都有支援，但Alexa在這兩個系統都不是原生的語音助理，因此沒辦法對手機直接說“Alexa”就喚醒她，還是需要先打開Amazon Alexa App才能開始溝通。智慧音箱Amazon Echo系列才是Alexa的主場，透過Amazon Echo來操作智能居家產品才不會有像手機操作那樣不順暢。可惜的是不論手機還是智慧音箱聲控，目前也都沒有支援中文語音。', 'https://playsmarthome.com/wp-content/uploads/smart-home-platform-800x500.jpg', 'https://playsmarthome.com/wp-content/uploads/homekit-1-1.png', 'https://playsmarthome.com/wp-content/uploads/google-home-1.png', 'null', '2021-08-21 06:52:57', '2021-08-21 06:52:57'),
(9916, 'SmartThings Hub 開箱！輕鬆打造居家保全及家庭', '如果你是Google Home 的使用者，且平常也有在利用Google 助理聲控智慧開關、智慧冷氣控制器、智慧燈泡…等裝置，應該就會發現如果想要進一步讓自己的家更智能，譬如要設定“當一進屋電燈就自己打開” 或是“當室內溫度太高就調低空調溫度” 等家庭自動化情境時，是沒有辦法透過Google Home App 達成的，因為感測器類型的產品根本無法直接接入Google 智慧家庭平台中。\n \n 而三星的SmartThings Hub 剛好補足了Google Home 無法用感測器觸發自動化的這項缺點。這台SmartThings Hub 即是智慧家庭中樞，能將各式智慧家庭裝置與感測器連結在一起，如此便可以做到感測器觸發自動化等情境。而且，因為智慧感測器可以接入這台Hub，所以想自己DIY 居家保全系統也不是不可能。究竟SmartThings Hub 適不適合你，耐心看完本文就會知道囉！\n \n 我們在先前的文章“為什麼要選擇三星SmartThings Hub 的5個理由” 就有詳述SmartThings Hub 的功能及特色，有興趣可以參考看看。本文接下來的段落也會說明到這些功能，同時著重於教大家如何設定。為了不讓各位混亂，這邊先將SmartThings Hub 的三個主要功能列出來，分別是：\n \n 輕鬆連接智慧感測器、智慧攝影機打造居家保全系統\n 能結合智慧感測器與其他智慧裝置打造家庭自動化系統\n 支援Google Assistant 或Amazon Alexa 語音控制\n \n SmartThings Hub 不但支援自家推出的智能裝置，也支援多達60 家廠商約400 項產品，算是目前市面上整合度很高的一款智慧中樞。其中打造智能居家會用到的產品項目，大多都有對應的支援品牌。這裡簡單整理如下：\n \n 智慧燈泡：Philips Hue、Sengled、SYLVANIA、IKEA …\n 智慧開關：Lutron Caseta、Honeywell、Leviton …\n 智慧插座：TP-Link Kasa、iHome …\n 智慧攝影機：Arlo、Ring\n 智慧門鎖：Yale、August、Schlage、Kwikset …\n 智慧感測器：Fibaro、Ecolink …\n 至於SmartThings 自家產品，則包含了燈泡、攝影機、插座、門窗感測器、移動感測器…等等。想知道完整的支援清單，可以到SmartThings 官網支援列表查看。\n \n 因為SmartThings Hub 在台灣買不到，因此建議到美國亞馬遜購買，不過這項產品亞馬遜沒辦法直送台灣，因此需要搭配國際代運服務，請代運商將產品寄送回台灣。\n \n 產品包裝盒的正面就是SmartThings Hub 的照片，底下的敘述直接寫道這台Hub 的作用是“連接各式的智能裝置且讓它們彼此連動操作”。背面是簡單介紹支援的裝置，有燈泡、攝影機、門鎖、感測器…等等，且接入SmartThings 的裝置可以再一起接入Google 或Amazon 的智慧家庭平台，如此便能利用Google 助理或Alexa 聲控接入的裝置。\n \n 包裝側面則印有支援SmartThings Hub 知名品牌的logo，像是門鎖品牌Schlage 及Yale、智慧開關Honeywell、音響品牌Bose、攝影機大廠Arlo 及ring、還有智慧燈泡品牌Philips Hue…等。\n \n 盒子一打開就可以看到SmartThings Hub ，它所佔的空間不大，約13x13x3公分，跟一個手掌差不多大。而Hub 的機身共有3個插孔，分別為電源充電孔、有線網路孔以及USB 孔。網路孔讓Hub 可以直接用乙太網路線與路由器對接，不過也可以選擇用WiFi 的方式連線；至於USB 插孔目前似乎還沒有實際作用。', 'https://playsmarthome.com/wp-content/uploads/smartthings-hub-3--800x500.png', 'https://playsmarthome.com/wp-content/uploads/smartthings-devices.png', 'https://playsmarthome.com/wp-content/uploads/smartthings-hub-unbox-01.png', 'null', '2021-08-21 06:52:57', '2021-08-21 06:52:57'),
(9917, 'LifeSmart 網關（智慧中心）正式支援HomeKit ', 'LifeSmart云起是一間總部在大陸的智能家居廠商，而且在台灣也有LifeSmart 智慧家庭系統相關產品的代理。該廠商所推出的智慧裝置品項還算齊全，從智慧燈泡、智慧開關、智慧門鎖、智慧攝影機到智慧感測器樣樣都有。\n \n 而早在2017年，LifeSmart 就宣稱他們的智慧燈泡、移動感測器、門窗感應器…等裝置可以通過“智慧中心”（或稱網關）來接入Apple HomeKit，工作原理與Aqara網關十分類似。不過，當時的問題是該款“智慧中心” 並沒有經過Apple 的官方認證，LifeSmart 僅使用自家的應用程式產生HomeKit 代碼，藉此來接入HomeKit。而且後來那款應用程式也不見了，據說是Apple 堅持將其下架的。\n \n 就在今年9月底左右，LifeSmart 取得了蘋果的合法認證，讓旗下的多項產品順利正式的支援Apple HomeKit 。而前幾天他們的官網則更新了有支援HomeKit 的產品頁面，包含了智慧感測器、智慧開關、智慧插座、智慧燈泡…等，如下圖整理所示。且與先前相同，這些裝置需要搭配“智慧中心” 的使用才能接入HomeKit（跟裝置間的通訊協定有關）。\n \n 比較可惜的是，LifeSmart 其實也有推出智慧門鎖、智慧攝影機…等智慧家庭配件，不過這些產品就沒有支援Apple HomeKit 了。但是LifeSmart 多款感測器的支援，讓HomeKit 使用者又多了一家可以選擇的品牌。畢竟這些智慧感測器裝置是打造完全自動化智能家庭的關鍵，能有多一點的選擇對消費者來說當然更好囉！', 'https://playsmarthome.com/wp-content/uploads/lifesmart-%E6%99%BA%E6%85%A7%E4%B8%AD%E5%BF%83-800x500.png', 'https://playsmarthome.com/wp-content/uploads/%E6%BA%AB%E6%BF%95%E5%BA%A6%E6%84%9F%E6%87%89%E5%99%A8.png', 'null', 'null', '2021-08-21 06:52:57', '2021-08-21 06:52:57'),
(9918, '智慧家庭是什麼？5個你一定要知道的應用層面及智慧裝置', '「Hey Siri~」是你呼叫 iphone 個人助理的指令，但你有想過，坐在客廳的沙發，也能這樣呼喚各種家電，並跟你的虛擬家庭助理對話嗎？透過裝設智慧家庭設備，再與家中的電路系統整合，最後連動你的行動裝置，便能實現安全、便利、降低生活開銷、提升生活品質的理想，甚至連娛樂都能全面升級，不再是使用者單向的對著大螢幕，而是能體驗前所未有的感官刺激。\n \n 智慧家庭介紹｜家電連上網路就是智慧家庭？\n 智慧家庭並不是盲目地導入更先進的科技到家中，也不是把所有家電都連上網路，而是能有效解決家庭成員問題，甚至提高生活品質的生活解決方案。以下是來自MBA百科的智慧家庭定義「智慧家居也稱智慧住宅，是以住宅為平臺，兼備建築、網路通訊、訊息家電、設備自動化，集系統、結構、服務、管理為一體的高效、舒適、安全、便利、環保的居住環境。智慧家居利用先進的電腦技術、網路通訊技術、綜合佈線技術，將與家居生活有關的各種子系統有機地結合在一起，透過統籌管理，讓家居生活更加舒適、安全」。\n \n 智慧家庭使用評估｜為什麼需要智慧家庭？\n 有些人可能時常長時間不在家，或者家裡有嬰幼兒、寵物需要掌握狀況，亦或是想提升環境的生活機能，這時候針對自身需求可選擇不同的智慧家庭設備做增添，解決空間上的困境。\n \n 例如你希望提升家庭影音設備的操作方便性，透過智慧家庭裝置，只要輕觸一個按鍵或是只需開口，就能將家中普通影音收聽模式轉換至劇院模式，將切換過程智慧化、簡單化。\n \n 智慧家庭5大應用層面｜帶來便利與安全性的同時，還能節省生活成本\n 智慧家庭除了能符合最基本的生理安全需求，也能節省家庭開銷，甚至能滿足娛樂需求。另外，智慧家庭的設備可根據家庭成員不同的生活習慣與作息，來調整不同裝置的配置及整合，滿足一整個家庭老少幼嬰的各種需求。\n \n 智慧家庭應用1｜保障家中安全\n \n 在家庭危安事件中，許多案例往往是一時疏忽所造成的，例如瓦斯忘了關、門沒有鎖好。而智慧家庭能做的便是縮短家庭成員對危險的反應時間，甚至是提前預防災害的發生。例如智慧攝影機，能裝設在家中大門外，可以透過影像辨識及自然語意分析來辨別是否有陌生人接近，甚至能判斷靠近的人物是否會對家庭成員造成危害，或對家庭做出傷害動作。\n \n 智慧家庭應用2｜提升生活品質\n 我們因為生活的忙碌，而錯過許多重要的事，譬如與伴侶的美好時光、帶毛小孩散步的時間、陪孩子唸故事書的時間。若是家中的智慧家電能先做好這些準備，便能防止這些珍貴時光被犧牲。例如晚上回家前智慧電鍋自動幫你把前一晚放進去的生米煮成熟飯，還能依照吃飯情境，例如與伴侶的紀念日，自動調整燈光昏暗程度、利用智慧音箱播上兩人最愛的主題曲。\n \n 智慧家庭應用3｜降低生活成本\n 生活上我們時常因為估錯用量，而造成不必要的浪費，例如膠囊咖啡機，常常丟了好幾顆膠囊進去，連按鈕都還來不及按，就去忙別的事了，兩三顆全新的膠囊就這麼被丟入回收槽。智慧家電能幫你做到的，便是在你遺忘已啟動的膠囊咖啡機時，跳出通知提醒你咖啡還沒喝，省下耗材費。\n 除了生活耗材外，電費也佔家庭開銷的大部分，尤其在台灣夏季用電最兇的時候，電費更是貴得嚇人。然而只要透過將感測器（sensor）全部連上網路，時時監測用電量，並提醒家庭成員，應在哪處用電多注意節能，來達到政府獎勵節能的標準。常見的節能系統包含電器插頭、燈泡與溫控系統等等，通常會與 App 連動，而 App 蒐集出的家電用電量彙整能提供家庭成員全方位的報告，針對用電時間、不同電器的用電方式，該做出何種調整，有很大的幫助。\n \n 智慧家庭應用4｜居家照護\n 高齡化加上少子化雙重衝擊的時代，導致家中沒有足夠的青壯年照顧年長者，這時智慧家電搭配智慧穿戴裝置便能減輕青壯年負擔。智慧家庭裝置在居家照護的相關應用上有「床感測器」，可以偵測年長者是否臥床過久，搭配穿戴裝置能監測心跳，若有緊急狀況發生，會通知照護者的行動裝置。此外，年長者如果時常忘記按時服藥及量測血壓，智慧藥盒能在吃藥時間到，卻沒有減少重量時發出警示聲音，而智慧血壓機也能發出聲音提醒年長者該量測血壓了。\n \n 除了年長者，家中剛出生的嬰兒、或是年幼的孩子，也能透過智慧家庭整合來幫助家長更體貼地照顧他們。例如智慧奶瓶能夠告訴你溫度是否過高，智慧搖籃能自動模擬母親懷中的安撫頻率；而在孩子接近高功率家電如電磁爐，或是電風扇時，能發出警示提醒家長孩子可能有危險，也提醒孩子不要再靠近。\n \n 智慧家庭應用5｜沈浸式娛樂\n 隨著人工智慧發展越來越成熟，家庭語音助理也越加實用。只要跟你的虛擬助理對話，他便能開啟結合了各大串流媒體的智能電視，再串連至手機，讓遠在不同地方的朋友能一起進行遊戲對戰，還能設定不同情境，例如在播放星際大戰電影時，即自動拉起窗簾，調整室內燈光，如同置身宇宙，讓使用者更能享受沈浸式的娛樂體驗。', 'https://panyi-architecture.com/wp-content/uploads/2020/09/image1.jpg', 'https://panyi-architecture.com/wp-content/uploads/2020/11/%E9%9B%B2%E7%AB%AF%E6%94%9D%E5%BD%B1%E6%A9%9F.jpg', 'https://panyi-architecture.com/wp-content/uploads/2020/11/%E6%99%BA%E6%85%A7%E7%87%88%E6%B3%A1.jpg', 'null', '2021-08-21 06:52:57', '2021-08-21 06:52:57'),
(9919, '科技只帶來疏離感？3種陪伴型機器人，與你聊天排解孤單', '是否想過購入一台機器人幫你處理生活大小事？人工智慧生活的運用已漸漸普及。美國財經科技新聞網指出，消費性機器人（針對個人服務或使用的機器人）的成長速度將在2019年高於製造型機器人7倍。\n \n 豐田汽車Toyota於今年10月初也發表一台針對關懷照護、陪伴需求增長而開發的小型陪伴機器人Kirobo Mini。\n \n 1.Kirobo Mini，寂寞駕駛員的聊天好夥伴\n Kirobo Mini是一個虛擬陪伴機器人。身長10公分、體重183克的Kirobo Mini可透過內建的聲音辨識器及攝影鏡頭感測使用者的臉部表情，做出適當的回應。\n \n 假設你獨自一人開車回家，想在車上盡情找人聊天，面對你的只有道路和充滿廣告的電台廣播，應該會覺得寂寞難耐吧？這時Kirobo Mini就像會說話的寵物般成為你的最佳陪伴者。\n \n 另外，Kirobo Mini也可以連接汽車的導航系統，了解旅途資訊，甚至能在到達目的地時稱讚使用者：「辛苦了！你完成一趟遙遠的旅程。」這些貼心的舉動減輕駕駛開車的緊張感，並協助掌握行車狀況。Kirobo Mini的出現源自於Toyota心計畫（Toyota Heart Project）。計畫目標是讓人類與人工智慧一起為世界創造美好的未來。根據Toyota官網表示，由於人的一生平均會花上4.3年的時間待在車上，相當於地球到月亮來回3次的時間。因此，Toyota與曾是Sony旗下的電腦公司品牌VAIO共同開發出這款模樣相當可愛的Kirobo Mini，陪伴使用者在生活寂寞之餘一個可以一起聊天的夥伴。\n \n 2.陪伴型機器人PARO和Leka為醫療產業帶來曙光\n 除了Kirobo Mini，許多廠商也看準機器人在醫療領域的商機，紛紛推出陪伴年長者或是有特殊需求的病患不同功能的陪伴型機器人，其中又以機器人PARO和Leka最值得注意。\n \n 美籍印度裔男星Aziz Ansari與華裔編劇Alan Yang合寫的半小時情境喜劇《Master of None》第八集曾出現一隻玩具機器海豹。這隻海豹的出現是為了陪伴年長者以及需要特殊照顧的使用者。而這隻海豹在現實世界中是確實存在的！它的名稱是PARO。這隻可愛的海洋哺乳類機器動物有各式的感測器，可根據觸摸、光線和溫度產生不同的回應。\n PARO是由日本工業技術院智能系統研究所的Takanori Shibata發明的治療用機器豎琴海豹。由於他可愛的模樣深受眾人喜愛，所以在許多醫院和療養院都可以看見PARO的身影。類似於心理治療中的動物治療法，PARO的陪伴能夠讓年長者降低憂鬱、減少孤獨並且找回和家人之間相處的回憶，進而改善長照問題。\n \n 2012年，美國疾病管制局根據全美11州的8歲小孩調查顯示，每68位孩子中就有1位是自閉症孩童，此比率也有逐年上升的趨勢，雖然自閉症沒有特效藥治療，但還是可以透過自閉症療法緩解疾病的發生率。一群位於法國巴黎的工程師團隊為自閉症兒童打造一台陪伴型機器人Leka，提供自閉症孩童更好的照顧。\n \n Leka是一個互動式機器人，它可以陪伴孩子，讓患有自閉症的孩子可以不用照顧者在旁邊也可以自己玩樂，訓練孩子與周圍環境建立關係。\n \n 機器人讓人類不再孤獨嗎？\n 機器人是科技世代的產物，陪伴型機器人的出現確實增進社會福祉。然而，看似增進人類交流的虛擬科技真的能夠凝聚人心嗎？ 全球市調指出，1985年，10%的美國人說他們沒有任何一位知己，然而這個數字到了現在卻上升至25%。\n \n 臉書上擁有的幾百位好友，又有哪幾位是你在現實中一起聊天的朋友？就在世界心理健康日（10月10日）前夕，澳洲防止自殺熱線服務Lifeline調查發現超過80%的澳洲人認為社會變得更加孤獨，雖然我們不能透過此項調查推斷科技就是造成孤獨感的元凶，但是我們還是必須正視數位時代對於情感世界帶來的影響，科技本身是中立的，端看我們怎麼使用它。\n \n 機器人已成為21世紀一個重要發明。在台灣，鴻海集團代工生產的機器人Pepper可以根據不同企業需求，開發客製化服務；華碩的Zenbo管家型機器人可以與家中的 IoT 物聯網產品（例如智慧廚具、電話等）相連，提醒日常行程、唸出食譜還可以說床邊故事給孩子聽。Toyota的Kirobo Mini更為駕駛人帶來更舒適的行車感受。', 'https://www.seinsights.asia/sites/default/files/imagecache/node_main_img/upload/epaper/1080x682_0.png', 'https://www.seinsights.asia/sites/default/files/imagecache/content_img_upscaling/upload/epaper/toyotapic3.jpg', 'https://www.seinsights.asia/sites/default/files/imagecache/content_img_upscaling/upload/epaper/toyotapic5.jpg', 'null', '2021-08-21 06:52:57', '2021-08-21 06:52:57'),
(9920, '情感慰藉是最大功能！日本新機器人設計「lovot」，不只裝萌', '日本公司 GrooveX 日前推出最新機器人「lovot」預售活動。「lovot」由 love（愛）和 robot（機器人）兩個字組成，是款不以實用功能為主，而以「情感陪伴」為主的機器人。它不會幫忙做家事，但會向主人討抱、裝萌，甚至還會吃醋。\n 「lovot」最主要的設計是與人類互動，因此對於接觸時的觸感、情感表達的設計格外講究。圓滾滾的身體覆上溫柔的毛絨，這層皮膚設有多達50個傳導器，讓它能透過深度學習技術（Deep Learning FPGA）即時作出反應。頭頂上有個傳導觸角，內置360度半球式攝影機、麥克風、熱感照相機，幫助它辨認人類、認出主人。刻意的地方還有，每只「lovot」重約3千克左右，相當於普通嬰兒的體重，它也能被抱在懷裡。而情感表達最重要的眼睛，設有6層光源，可以靈活地做出包含眼球移動、不同速度的眨眼、瞳孔寬度調整等細節，彷彿動物或嬰兒般，展露純真的眼神。\n \n 被撫摸時，「lovot」會透過眼神和肢體動作顯露開心的情緒，還會有如孩童般的音效。除此之外，GrooveX 還設定了「嫉妒」和「索取情緒」的能力。也就是，若主人同時擁有兩隻「lovot」，只擁抱其中一隻時，另一隻會「嫉妒」，會跑上前來討要同樣的情感慰藉。它們也跟小嬰兒和寵物一樣，不管主人忙不忙，就算主人在忙，它們也會緊緊跟隨，直到得到關注。\n 目前「lovot」推出兩隻一組的預售價，為 598,000 日圓，將從2019年第三季之後開始出貨，想買單隻的則要等到2020年。', 'https://media.bnextmedia.com.tw/image/album/2018-12/img-1545740292-52539@900.jpg', 'https://media.bnextmedia.com.tw/image/album/2018-12/img-1545740275-86219@900.jpg', 'https://media.bnextmedia.com.tw/image/album/2018-12/img-1545740278-86675@900.jpg', 'null', '2021-08-21 06:52:57', '2021-08-21 06:52:57'),
(9921, '英國養老院引進AI陪伴機器人', '草根影響力新視野 喬依絲編譯\n \n 日新月異的AI科技不僅讓人類生活更便利，還可以進行簡單的對話並了解人們的興趣。不只如此，一項國際試驗發現這類機器人還有助改善人類心理健康及減少孤獨感，英國部分養老院已引進這款會表達情緒的機器人“Pepper”。\n \n Pepper可獨立移動並用機械手臂和雙手進行手勢表達，旨在更具文化能力。經過一些初步編程後，它們可以了解養老院居民的興趣和背景，因此可以與老人們進行基本的對話、播放他們所喜愛的音樂、教導他們語言以及提供包括提醒服藥等實用的幫助。\n \n 由英國貝德福德郡大學(University of Bedfordshire) Chris Papadopoulos博士所領導的研究團隊表示，這項試驗的目的不是為了用機器人來替代人類看護者，而是為了填補老人無工作人員或家人陪伴的孤單時段。試驗是在英國和日本進行，由歐盟委員會和日本政府資助的一項230萬英鎊研究專案的其中一部分。試驗發現養老院中與機器人互動長達兩週(共18小時)的老年人，其心理健康狀況得到了顯著改善。不過老人們回應，這些機器人的對話略顯膚淺並且缺豐富性，缺乏個性化和足夠的文化意識，此外，機器人的頭部動作和手勢有時會分散注意力。\n 英國最大間癡呆症護理之家的Advinia Healthcare參與了本次試驗，該機構表示「正在努力將機器人納入弱勢人群的常規護理中，以減少焦慮和孤獨感，並提供持續性的關懷」。Advinia負責人Sanjeev Kanoria博士說 :「我們現在正努力將機器人帶入日常照護中，因此它對老年人及其家人會發揮真正的幫助。這些機器人不會直接導致裁員，但非常值得引進，因為更快樂的居民意味著員工工作量減少以及住戶滿意度提高，進而提升居住率。\n \n 在Covid-19疫情爆發之前，英國護理行業至少有12萬個空缺，員工們精疲力竭，導致成本飆升和入住率下降，許多經營者正面臨財務困​​難帶來的壓力。一個附有軟體的機器人成本約為19,000英鎊(台幣71.2萬元)，比英格蘭東南部一名護理人員的平均工資高出1,000英鎊(台幣3.7萬元)，但也有其他更便宜的機器人可選擇。\n \n 代表最大醫療服務提供者的Care England表示，這些機器人不太可能取代工作人員，但可能有助於與居民建立更深層次和更高質量的關係。這對全球高齡化社會的生活品質將有所助益。\n \n Reference : \n \n Robots to be used in UK care homes to help reduce loneliness', 'https://www.google.com/url?sa=i&url=http%3A%2F%2Ftw.systex.com%2Fpepper%2F&psig=AOvVaw2C9KhsMgr1XTyYjtIZj4mi&ust=1629460324189000&source=images&cd=vfe&ved=0CAsQjRxqFwoTCLCb4vCCvfICFQAAAAAdAAAAABAD', 'https://www.google.com/url?sa=i&url=https%3A%2F%2Fwww.eprice.com.tw%2Ftech%2Ftalk%2F1141%2F4912109%2F1%2F&psig=AOvVaw2C9KhsMgr1XTyYjtIZj4mi&ust=1629460324189000&source=images&cd=vfe&ved=0CAsQjRxqFwoTCLCb4vCCvfICFQAAAAAdAAAAABAT', 'https://www.taiwanhot.net/wp-content/uploads/2017/01/586bab5d54732.jpg', 'null', '2021-08-21 06:52:57', '2021-08-21 06:52:57'),
(9922, '四大車站引進Pepper站務員 提升智慧化便民服務', '台鐵百年老店首度引進智慧機器人，為提升旅客服務品質，台鐵與亞太電信合作，在台北、台中、高雄、花蓮車站，引進多國語言的Pepper擔任站務員，讓旅客體驗不一樣的服務，於今天下午1時31分舉行授帽儀式。在活動結束後Pepper立即踏上工作崗位，民眾也可與Pepper現場互動，體驗台鐵智慧化便民服務。\n 這名來自日本的新進員工，Pepper，身高121公分、體重29公斤，充電後「續航力」可工作8至12小時，具有靈活關節與偵測感應器，即日起，每天上午9時至下午6時，在各站服務台前，提供「迎賓問候」、「教育娛樂」、「資訊查詢」及「路政宣導」等核心功能，營造友善服務空間。\n \n 除了中文外，Pepper也能以英、日文跟旅客溝通，除了增加旅客新奇有趣的互動體驗，更提供平交道安全宣導等服務，以往站員面對同一個問題，1天可能需回答超過1000次，由於Pepper的加入，將可減輕站務員負擔，也能讓旅客感到新鮮有趣。', 'https://images.chinatimes.com/newsphoto/2018-06-08/1024/20180608003665.jpg', 'https://cimg.cnyes.cool/prod/news/4666595/l/b3efddce35751831d411d6c1ec922b6e.jpg', 'https://www.google.com/url?sa=i&url=https%3A%2F%2Fzh.wikipedia.org%2Fwiki%2FPepper&psig=AOvVaw2C9KhsMgr1XTyYjtIZj4mi&ust=1629460324189000&source=images&cd=vfe&ved=0CAsQjRxqFwoTCLCb4vCCvfICFQAAAAAdAAAAABA0', 'null', '2021-08-21 06:52:57', '2021-08-21 06:52:57');

-- --------------------------------------------------------

--
-- 資料表結構 `brands`
--

CREATE TABLE `brands` (
  `brand_id` int(11) NOT NULL COMMENT '品牌編號',
  `brand_img` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '品牌logo圖',
  `brand_name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '品牌名稱',
  `brand_CH` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '品牌中文名稱',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT '新增時間',
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `brands`
--

INSERT INTO `brands` (`brand_id`, `brand_img`, `brand_name`, `brand_CH`, `created_at`, `updated_at`) VALUES
(8801, '880001.jpg', '3M', '明尼蘇達礦務及製造業公司', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8802, '880002.jpg', 'Acer', '宏碁', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8803, '880003.jpg', 'Airdog', 'Airdog', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8804, '880004.jpg', 'AirRun', '日本新科技', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8805, '880005.jpg', 'amadana', 'amadana', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8806, '880006.jpg', 'Amazon', '亞馬遜', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8807, '880007.jpg', 'Apple', '蘋果', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8808, '880008.jpg', 'Aqara', '綠米智能家居', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8809, '880009.jpg', 'Asus', '華碩', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8810, '880010.jpg', 'BALMUDA', '百慕達', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8811, '880011.jpg', 'Belkin × DEVIALET', '貝爾金', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8812, '880012.jpg', 'Boaz', '波阿斯', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8813, '880013.jpg', 'BOSCH', '博世', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8814, '880014.jpg', 'Bose', '博士', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8815, '880015.jpg', 'cado', '端泰', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8816, '880016.jpg', 'CookPower', '鍋寶', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8817, '880017.jpg', 'DAILKIN', '大金', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8818, '880018.jpg', 'Dimple', 'Dimple', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8819, '880019.jpg', 'D-Link', '友訊', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8820, '880020.jpg', 'DMM Tapia AI', '國尊科技', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8821, '880021.jpg', 'dormakaba', '多瑪與凱拔臺灣', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8822, '880022.jpg', 'Dyson', '戴森', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8823, '880023.jpg', 'EASY LIFE', '伊德爾', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8824, '880024.jpg', 'ECOVACS', '特力集團', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8825, '880025.jpg', 'Electrolux', '伊萊克斯', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8826, '880026.jpg', 'Emotech', 'Emotech', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8827, '880027.jpg', 'Entrex', 'Entrex', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8828, '880028.jpg', 'EQL', '宜優科技', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8829, '880029.jpg', 'ETEKCITY', '晨北科技', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8830, '880030.jpg', 'Eufy', '群光電子（代理商）', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8831, '880031.jpg', 'FANLAI', '飯來', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8832, '880032.jpg', 'Google', '谷歌', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8833, '880033.jpg', 'Groove X', '瑞軒展望', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8834, '880034.jpg', 'Health Life', '合世生醫', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8835, '880035.jpg', 'HITACHI', '日立', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8836, '880036.jpg', 'IKEA', '宜家', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8837, '880037.jpg', 'ILIFE', 'ILIFE', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8838, '880038.jpg', 'imarflex', '日本伊瑪', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8839, '880039.jpg', 'IRIS', '愛麗思', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8840, '880040.jpg', 'IRIS OHYAMA', '愛麗思歐雅瑪', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8841, '880041.jpg', 'iRobot', '石頭科技', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8842, '880042.jpg', 'Kolin', '歌林', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8843, '880043.jpg', 'Learning Resources', 'Learning Resources', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8844, '880044.jpg', 'Life Plus', 'Life Plus', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8845, '880045.jpg', 'LIFX', 'LIFX', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8846, '880046.jpg', 'LockEye', 'LockEye', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8847, '880047.jpg', 'Logitech', '羅技', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8848, '880048.jpg', 'Midea', '美的', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8849, '880049.jpg', 'MISUBISHI', '三菱', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8850, 'null', 'MU', 'MU', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8851, '880051.jpg', 'muji', '無印良品', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8852, '880052.jpg', 'Nanoleaf', '綠諾', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8853, '880053.jpg', 'Neato Botvac', '匯聚科技總代理', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8854, '880054.jpg', 'Opro9', '瀚雲', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8855, '880055.jpg', 'Panasonic', '國際牌', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8856, '880056.jpg', 'Philips', '飛利浦', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8857, '880057.jpg', 'Roborock', '石頭科技', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8858, '880058.jpg', 'SAMPO', '聲寶', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8859, '880059.jpg', 'samsung', '三星', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8860, '880060.jpg', 'SHARP', '夏普', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8861, '880061.jpg', 'SIRIUS|Viruswasher', '三洋電子', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8862, '880062.jpg', 'SMART MOM', '智能媽媽', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8863, '880063.jpg', 'SOMFY', '尚飛台灣', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8864, '880064.jpg', 'SONY AIBO', '索尼', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8865, '880065.jpg', 'SwitchBot', 'SwitchBot', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8866, '880066.jpg', 'TATUNG', '大同', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8867, '880067.jpg', 'Tefal', '特福', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8868, '880068.jpg', 'TOSHIBA', '東芝', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8869, '880069.jpg', 'TOYOTA', '豐田汽車', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8870, '880070.jpg', 'TP-Link', '普聯技術有限公司', '2021-08-21 04:34:06', '2021-08-21 04:34:06'),
(8871, '880071.jpg', 'Whirlpool', '惠而浦', '2021-08-21 04:34:07', '2021-08-21 04:34:07'),
(8872, 'null', 'XLNB', '騏碁科技', '2021-08-21 04:34:07', '2021-08-21 04:34:07'),
(8873, '880073.jpg', 'ZOJIRUSHI', '象印', '2021-08-21 04:34:07', '2021-08-21 04:34:07'),
(8874, '880074.jpg', '九陽', '九陽', '2021-08-21 04:34:07', '2021-08-21 04:34:07'),
(8875, '880075.jpg', '小米', '小米', '2021-08-21 04:34:07', '2021-08-21 04:34:07'),
(8876, '880076.jpg', '米家', '米家', '2021-08-21 04:34:07', '2021-08-21 04:34:07'),
(8877, '880077.jpg', '中華電信', '中華電信', '2021-08-21 04:34:07', '2021-08-21 04:34:07'),
(8878, '880078.jpg', '尚朋堂', '尚朋堂', '2021-08-21 04:34:07', '2021-08-21 04:34:07'),
(8879, '880079.jpg', '狗尾草', '狗尾草', '2021-08-21 04:34:07', '2021-08-21 04:34:07'),
(8880, '880080.jpg', '皇鋒EC', '皇鋒EC', '2021-08-21 04:34:07', '2021-08-21 04:34:07'),
(8881, '880081.jpg', '舞光', '舞光', '2021-08-21 04:34:07', '2021-08-21 04:34:07'),
(8882, '880082.jpg', '遠傳', '遠傳', '2021-08-21 04:34:07', '2021-08-21 04:34:07'),
(8883, '880083.jpg', '鴻海', '鴻海', '2021-08-21 04:34:07', '2021-08-21 04:34:07'),
(8884, '880084.jpg', '獵豹移動', '獵豹移動', '2021-08-21 04:34:07', '2021-08-21 04:34:07');

-- --------------------------------------------------------

--
-- 資料表結構 `categories`
--

CREATE TABLE `categories` (
  `cate_id` int(11) NOT NULL COMMENT '類別編號',
  `cate_name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '類別名稱',
  `parent_id` int(11) NOT NULL DEFAULT 0 COMMENT '上層編號',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT '新增時間',
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `categories`
--

INSERT INTO `categories` (`cate_id`, `cate_name`, `parent_id`, `created_at`, `updated_at`) VALUES
(1, '機器人AI', 0, '2021-08-21 05:27:24', '2021-08-21 05:27:24'),
(2, '智慧家居', 0, '2021-08-21 05:27:24', '2021-08-21 05:27:24'),
(3, '掃地機器人', 1, '2021-08-21 05:27:24', '2021-08-21 05:27:24'),
(4, '烹飪機器人', 1, '2021-08-21 05:27:24', '2021-08-21 05:27:24'),
(5, '管家機器人', 1, '2021-08-21 05:27:24', '2021-08-21 05:27:24'),
(6, '陪伴機器人', 1, '2021-08-21 05:27:24', '2021-08-21 05:27:24'),
(7, '廚房家電', 2, '2021-08-21 05:27:24', '2021-08-21 05:27:24'),
(8, '居家安全', 2, '2021-08-21 05:27:24', '2021-08-21 05:27:24'),
(9, '居家清潔', 2, '2021-08-21 05:27:24', '2021-08-21 05:27:24'),
(10, '娛樂與教育', 2, '2021-08-21 05:27:24', '2021-08-21 05:27:24'),
(11, '智能周邊', 2, '2021-08-21 05:27:24', '2021-08-21 05:27:24'),
(12, '萬用鍋', 7, '2021-08-21 05:27:24', '2021-08-21 05:27:24'),
(13, '智能烤箱/微波爐', 7, '2021-08-21 05:27:24', '2021-08-21 05:27:24'),
(14, '冰箱', 7, '2021-08-21 05:27:24', '2021-08-21 05:27:24'),
(15, '智慧門鎖', 8, '2021-08-21 05:27:24', '2021-08-21 05:27:24'),
(16, '網路攝影機', 8, '2021-08-21 05:27:24', '2021-08-21 05:27:24'),
(17, '空氣清淨機', 9, '2021-08-21 05:27:24', '2021-08-21 05:27:24'),
(18, '除濕機', 9, '2021-08-21 05:27:24', '2021-08-21 05:27:24'),
(19, '冷氣', 9, '2021-08-21 05:27:24', '2021-08-21 05:27:24'),
(20, '電視', 10, '2021-08-21 05:27:24', '2021-08-21 05:27:24'),
(21, '智能音箱', 10, '2021-08-21 05:27:24', '2021-08-21 05:27:24'),
(22, '智能插座/智能開關', 11, '2021-08-21 05:27:24', '2021-08-21 05:27:24'),
(23, '智能燈泡', 11, '2021-08-21 05:27:24', '2021-08-21 05:27:24'),
(24, '智能窗簾', 11, '2021-08-21 05:27:24', '2021-08-21 05:27:24');

-- --------------------------------------------------------

--
-- 資料表結構 `orders_detail`
--

CREATE TABLE `orders_detail` (
  `order_id` varchar(13) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '訂單編號',
  `prod_id` int(11) NOT NULL COMMENT '商品編號',
  `prod_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '商品名稱',
  `prod_thumbnail` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '商品縮圖',
  `prod_price` int(11) DEFAULT NULL COMMENT '商品價格',
  `prod_choice` varchar(15) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '商品規格選擇',
  `prod_qty` int(11) DEFAULT NULL COMMENT '商品數量',
  `prod_subtotal` int(11) DEFAULT NULL COMMENT '商品小計',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT '新增時間',
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `orders_detail`
--

INSERT INTO `orders_detail` (`order_id`, `prod_id`, `prod_name`, `prod_thumbnail`, `prod_price`, `prod_choice`, `prod_qty`, `prod_subtotal`, `created_at`, `updated_at`) VALUES
('1', 301, '石頭掃地機器人 S6 MaxV', '0301.png', 17999, 'null', 1, 17899, '2021-08-21 07:44:06', '2021-08-21 07:44:06'),
('1', 503, '公子小白pro', '0503.png', 8594, 'null', 1, 8594, '2021-08-21 07:44:06', '2021-08-21 07:44:06'),
('3', 2111, 'Amazon echo Dot (4th Gen) Kids', '2111.png', 1390, '老虎', 2, 2502, '2021-08-21 07:44:06', '2021-08-21 07:44:06');

-- --------------------------------------------------------

--
-- 資料表結構 `orders_rate`
--

CREATE TABLE `orders_rate` (
  `order_id` varchar(13) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '訂單編號',
  `prod_id` int(11) NOT NULL COMMENT '商品編號',
  `rate_A_score` tinyint(1) NOT NULL COMMENT '項目A得分(1~5)',
  `rate_B_score` tinyint(1) NOT NULL COMMENT '項目B得分(1~5)',
  `rate_C_score` tinyint(1) NOT NULL COMMENT '項目C得分(1~5)',
  `rate_D_score` tinyint(1) NOT NULL COMMENT '項目D得分(1~5)',
  `rate_E_score` tinyint(1) NOT NULL COMMENT '項目E得分(1~5)',
  `comment` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '評論',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT '新增時間',
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `orders_rate`
--

INSERT INTO `orders_rate` (`order_id`, `prod_id`, `rate_A_score`, `rate_B_score`, `rate_C_score`, `rate_D_score`, `rate_E_score`, `comment`, `created_at`, `updated_at`) VALUES
('1', 2102, 5, 3, 4, 4, 3, '質感看起來更好了', '2021-08-21 07:13:21', '2021-08-21 07:13:21'),
('2', 2102, 5, 4, 3, 3, 4, '音質是明確的比起小愛音箱好不少的，3 公尺距離仍然不用太大聲就能喚醒小愛同學，音質中高及低音都算還不錯，都有個基本水平，唯一可惜就是圓孔的電源線。', '2021-08-21 07:13:21', '2021-08-21 07:13:21'),
('2', 2209, 4, 5, 3, 3, 4, '整體設計上，更加簡約，爲標準的矮圓柱體，上面有顆小指示燈，還帶有一個按鈕。能夠關閉警報聲音。新的多模網關取消了網關燈，同時也沒有網狀的鏤空內置揚聲器設計', '2021-08-21 07:13:21', '2021-08-21 07:13:21'),
('4', 2102, 5, 3, 4, 4, 4, '是生活中相當有智慧的好伙伴，也讓我家孩子可以練習對話溝通', '2021-08-21 07:13:21', '2021-08-21 07:13:21'),
('5', 2102, 3, 4, 4, 3, 5, '使用起來很方便', '2021-08-21 07:13:21', '2021-08-21 07:13:21');

-- --------------------------------------------------------

--
-- 資料表結構 `products`
--

CREATE TABLE `products` (
  `prod_id` int(11) NOT NULL COMMENT '商品編號',
  `prod_name` varchar(100) DEFAULT NULL COMMENT '商品名稱',
  `prod_thumbnail` varchar(255) DEFAULT NULL COMMENT '商品縮圖',
  `prod_image` varchar(255) DEFAULT NULL COMMENT '商品主要圖片',
  `prod_price` int(11) DEFAULT NULL COMMENT '商品價格',
  `prod_type` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '商品型號',
  `prod_size` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '商品尺寸',
  `prod_description` varchar(100) DEFAULT NULL COMMENT '商品描述',
  `prod_discount` varchar(16) DEFAULT NULL COMMENT '優惠標示',
  `cate_id` int(11) DEFAULT NULL COMMENT '類別編號',
  `cate_id_set` varchar(100) DEFAULT NULL COMMENT '類別編號集合',
  `brand_id` int(11) DEFAULT NULL COMMENT '品牌編號',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT '新增時間',
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `products`
--

INSERT INTO `products` (`prod_id`, `prod_name`, `prod_thumbnail`, `prod_image`, `prod_price`, `prod_type`, `prod_size`, `prod_description`, `prod_discount`, `cate_id`, `cate_id_set`, `brand_id`, `created_at`, `updated_at`) VALUES
(301, '石頭掃地機器人 S6 MaxV', '0301.png', NULL, 17999, 'S6 MaxV', '353mm * 350mm *96.5mm', '全球首創：AI雙鏡頭避障\n 搭載全球首創8核CPU\n 業界最強吸力2500PA\n 即時視訊連線，單向聲音傳輸\n 300g仿真人加壓拖地\n 500萬相素雙鏡頭，立體視覺有效避障\n 297ml恆壓電控大水', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(302, '石頭掃地機器人二代 S6 Pure', '0302.png', NULL, 12999, 'S6 Pure', '353mm * 350mm *96.5mm', '延續旗艦Roborock S6功能三大優勢新進化\n 電量管家，自動回充至清掃剩餘面積之電量\n 180 ml 大水箱， 2 段式水量調節\n 地圖記憶達 4 個樓層，透天厝也不怕\n 支援小米AI音箱、Al', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(303, 'A10s 掃地/拖地 雷射兩用機器人', '0303.png', NULL, 9680, 'A10s', '330mm * 320mm *95mm', '\"拖地最乾淨：3段電控出水+每分1200下強力3D振動水箱\n 吸力最兇猛：2500pa離心氣旋＋噴射濾網\n 音量最小：45分貝運轉音量\n 清潔最方便：快拆邊刷與不纏繞膠刷\n 規劃最詳盡：分房間、分樓層', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(304, 'W400 洗地機器人', '0304.png', NULL, 9080, 'W400', '282mm * 292mm *118mm', 'W400ILIFE W400 重新設計了『噴』、『刷』、『吸』、『刮』四種循環流程，真正有效拔除地板髒汙，同時是全市場唯一的『髒汙水箱分離』設計，也真正讓你用乾淨的水清潔地板，達到更乾淨、更省力的清潔', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(305, 'Roomba s9+ 掃地機器人', '0305.png', NULL, 56880, 'Roomba s9+', '310mm * 310mm *89mm', 'WiFi+APP+每日預約定時功能\n 專利第三代PLUS加長30%塑膠滾筒雙主刷+五腳角刷\n 沒電自動返航+回充續掃+自動倒垃圾\n 髒汙偵測+定點打掃\n 雙功能虛擬牆/APP虛擬禁止區\n 吸力增加40', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(306, 'Roomba i7 掃地機器人', '0306.png', NULL, 29880, 'Roomba i7', '340mm * 93mm', 'WiFi+APP+每日預約定時功能\n 專利第三代塑膠滾筒雙主刷\n 沒電自動返航+回充續掃\n 髒汙偵測+定點打掃\n 雙功能虛擬牆/APP虛擬禁止區\n 吸力增加10倍,掃地能力再升級\n 高效過濾網+可水洗', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(307, 'Roomba 960 掃地機器人', '0307.png', NULL, 19880, 'Roomba 960', '353mm * 92mm', 'WiFi+APP+每日預約定時功能\n 專利第二代塑膠滾筒雙主刷\n 沒電自動返航+回充續掃\n 髒汙偵測+定點打掃\n 雙功能虛擬牆\n 吸力增加5倍,掃地能力增加1.5倍\n 高效過濾網\n 視覺導航+三種清潔', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(308, 'Roomba e5 掃地機器人', '0308.png', NULL, 56880, 'Roomba e5', '353mm * 92mm', 'WiFi+APP+每日預約定時功能\n 專利第三代塑膠滾筒雙主刷\n 沒電自動返航+回充續掃 ■髒汙偵測+定點打掃\n 雙功能虛擬牆\n 吸力增加5倍,掃地能力增加1.5倍\n 高效過濾網\n 可水洗集塵盒', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(309, 'PURE i9.2 2020年新一代機器人PI92-6DGM', '0309.png', NULL, 18888, 'PI92-6DGM', '460mm * 350mm *110mm', '互動式地圖規畫，一指選定區域打掃。\n3D Vision 超視能科技，不碰撞、不纏繞、不受困。\n三角外型及立體八爪邊刷 深入清潔死角。', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(310, 'PURE i9.2新一代型動機器人PI92-6STN', '0310.png', NULL, 26900, 'PI92-6STN', '300mm * 60mm', '全球專利3D立體視覺科技\n三角型動設計，角落清潔力最強\n互動式地圖功能，一指選定區域打掃', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(311, 'D7 雷射掃描掃地機器人吸塵器', '0311.png', NULL, 19900, 'D7', '350mm * 94.5mm', '可連結微信 Wechat、亞馬遜 Alexa 遠端遙控\n區域清掃功能，輕鬆劃分多空間清掃\n專利雷射掃描自動認路/分區/返航\n地圖顯示清掃範圍，一目瞭然\nAPP WiFi遠端啟動/暫停/定時清掃\nAPP', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(312, 'N9+自動回洗掃拖一體智能機器人', '0312.png', NULL, 17900, 'N9+', '350mm * 350mm *81.5mm', '髒抹布自動回洗，保持拖布潔淨\n掃吸拖洗一次完成，一機抵多機\n旋轉加壓擦地，搞定頑漬汙垢', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(313, 'DEEBOT T8超智能掃地機器人', '0313.png', NULL, 13999, 'DEEBOT T8', '350mm * 350mm *82mm', 'dTof導航，精準快速建圖\n仿電動牙刷擦地模式，細緻而乾淨\n微塵級清潔，吸塵率高達93%', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(314, 'DEEBOT T8 AIVI', '0314.png', NULL, 17999, 'DEEBOT T8 AIVI', '340mm * 93mm', 'dTof導航，精準快速建圖\n仿電動牙刷擦地模式，細緻而乾淨\n微塵級清潔，吸塵率高達93%', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(315, 'L70雷射導航掃地拖地機器人(白)T2190', '0315.png', NULL, 15900, 'T2190', '300mm * 60mm', '掃拖合一/輕易越障/強勁吸力\n雷射導航/斷點續掃/不跌落\nAPP&語音控制，只清潔不搗亂', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(316, 'G10智慧動能導航掃地拖地機器人(黑) T2150', '0316.png', NULL, 7900, 'T2150', '340mm * 93mm', '掃拖合一/纖薄機身/強勁吸力\n陀螺儀導航/斷點續掃/不跌落\nAPP&語音控制，只清潔不搗亂', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(317, '超薄濕拖 智慧掃地機器人FC8796/31', '0317.png', NULL, 7500, 'FC8796/31', '460mm * 350mm *110mm', '\"5.8cm超薄,輕鬆清潔傢俱底部\n 濕拖纖維布拖板,更易清潔微塵及污漬\n EPA12濾網,提供更出色的過濾效果\n 6組紅外線感測器,探測更靈敏\n 5組防跌落感測器,全方位保護\n 24h提前規劃清掃行', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(318, '智能掃地機器人FC8776/31', '0318.png', NULL, 16800, 'FC8776/31', '300mm * 60mm', '機身僅6公分、清潔無障礙\n智能感應器19顆\n自動回充、鋰電池、低噪音\n最高可連續使用130分鐘\n四種智慧清潔模式\n紅外線遙控器', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(319, '米家 二合一掃拖機器人2代 掃地機器人 雷射偵測導航版', '0319.png', NULL, 8990, 'STY902YM', '152mm * 74.6mm *99.5mm', '智能電控水箱 保護木質地板\n2100Pa大吸力 清掃更徹底\n全新升級LDS雷射導引 地圖更準確', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(320, '米家掃拖機器人1C(白)', '0330.png', NULL, 5295, 'HJSTC1', '353mm * 350mm * 81.5mm', '視覺動態\n地圖構建\n智慧電控水箱\n2500Pa超大吸力', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(321, '米家 掃拖機器人(G1)', '0321.png', NULL, 4995, 'HJSTG1', '355mm * 355mm', '四段吸力\n三重過瀘系統\n8.2cm超薄機身', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(401, '全功能智慧烹飪機', '0401.png', NULL, 2980, '全功能智慧烹飪機', '314x368x315', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(402, 'IH智能翻炒鍋(EL19008)', '0402.png', NULL, 12990, 'EL19008', '28.7cm x 寬36.9cm x 高27.7cm', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(403, '九陽炒菜機器人A1', '0403.png', NULL, 16088, 'A1', '33.5cm x 28.5cm x 28.5cm', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(404, 'MU全自動炒菜機‧IH爐智能機器人', '0404.png', NULL, 19000, 'MU全自動炒菜機‧IH爐智能機器人', 'null', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(405, '全自動炒菜機', '0405.png', NULL, 6080, '全自動炒菜機', 'null', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(406, 'Solista 獨奏智能炒菜機', '0406.png', NULL, 4400, 'Solista 獨奏智能炒菜機', 'null', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(407, 'PY18-X2/X1S炒菜機機器人', '0407.png', NULL, 7281, 'PY18-X2/X1S炒菜機機器人', 'null', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(408, '飯來F1S 烹飪機器人', '0408.png', NULL, 8900, '飯來F1S 烹飪機器人', 'null', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(501, '主控機器人+開關機器人(套組)', '0501.png', NULL, 4690, '主控機器人+開關機器人(套組)', 'null', '13 種家電4000 品牌\n360 度無死角控制\n​定時聲控一手包\n使用距離無上限', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(502, 'EQL Qubi Robot', '0502.png', NULL, 11000, 'EQL Qubi Robot', 'null', 'SLAM 智能演算技術\n多重清掃模式\nApp 手繪虛擬牆\n自動返回充電\n遠端控制\n語音提示\n智慧感測系統\nOTA 技術', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(503, '公子小白Pro', '0503.png', NULL, 8594, '公子小白Pro', '170mm *170mm *260mm', '擁有即插即用（可控制空調、檯燈、麵包機、電水壺、冰箱、電視機、電飯鍋、吸塵器、電風扇、暖氣等）\n語音控制\nAPP遠程控制\n定時開關\n日常功能：語音調教、調教功能、自定義問答、音樂鬧鐘、日程提醒、天氣預', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(504, '公子小白成长版Ⅱ', '0504.png', NULL, 5729, '公子小白成长版Ⅱ', '170mm *170mm *260mm', '講故事（1000+故事資源）\n音樂播放（卡通音樂，中英兒歌，睡眠音樂，流行歌曲）\n人機對話\n定時提醒（語音提醒），日程提醒，節日提醒，鬧鐘提醒\n自我學習能力\n呆萌表情', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(505, '公子小白成长版', '0505.png', NULL, 3433, '公子小白成长版', '170mm *170mm *260mm', '擁有語音聊天、講故事、播音樂、成語接龍、腦筋急轉彎、繞口令、冷知識、猜謎語、親情微聊、藍牙音箱、知識百科、詩詞國學、快樂算術、小學同步教材、中譯英、英語口語評測、起床鬧鐘、天氣預報、日程提醒等功能', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(506, 'Olly', '0506.png', NULL, 1225, 'Olly', '200mm * 160mm * 250 mm', '能夠透過內建的四個麥克風和臉部偵測系統，收集使用者的表情、語調、嘴部動作等，去辨識當下的情感\n可以連結各種 app，如網路電台、社群媒體和電子郵件', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(601, 'Ers-1000 ERS 1000 aibo寵物機器狗', '0601.png', NULL, 159999, 'Ers-1000 ERS 1000', '350mm * 350mm *82mm', '緊湊的機身提供22個自由軸（關節），以實現平穩的車身驅動。 眼睛內中採用兩個OLED，並巧妙地表達各種情感。 \n通過獨特的AI技術了解與所有者的互動，其中主體和雲端合作並親自發展。 可收集數據，甚至更', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(602, '小狗探險隊', '0602.png', NULL, 1522, '小狗探險隊', '180 * 293 * 305 mm', '培養孩子策略思考、邏輯判斷\n遊戲中學會團隊合作與溝通與討論\n加深視覺空間概念與方向辨識', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(603, 'Lovot', '0603.png', NULL, 76154, 'Lovot', '180 * 190 * 200 mm', '可分辨人類的聲音、動作\n家居保安功能\n低電量時自動返回充電座', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(604, 'DC13991 互動式機器人', '0604.png', NULL, 1299, 'DC1399', '140mm * 160mm * 90 mm', '互動功能\n陪伴與辨識功能', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(605, 'XLNB Intelligent Dance Robot Dog', '0605.png', NULL, 1531, 'XLNB Intelligent Dance Robot D', 'null', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(606, 'Tapia', '0606.png', NULL, 40525, 'Protecting Life Support Humano', 'null', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(607, 'Toyota Kirobo Mini', '0607.png', NULL, 10948, 'Toyota Kirobo Mini', 'null', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1201, '智慧萬用鍋 (HD2133)', '1201.png', NULL, 2888, 'HD2133', '314x368x315', '蒸、煮、燉、滷、無水烹調五大烹飪功能\n■16種智慧化自動烹飪設定\n■特殊無水烹調功能\n■人性化24小時預約/12小時保溫功能，隨時享受美食\n■可拆洗式內蓋，易於清洗\n■ 9 道安全控壓控溫保護裝置，確', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1202, '迷你智能溫控舒肥萬用鍋/壓力鍋', '1202.png', NULL, 2990, 'CY625170', '287x 369x 277', '陶晶球釜62度黃金雙對流角\n舒肥,燉,煎,煮,炒,烘烤\n18道安全機制 使用好安心', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1203, '雙重脈衝智慧萬用鍋(金小萬) HD2195', '1203.png', NULL, 12900, 'HD2195', '335 x 285 x 285', '飛利浦雙重脈衝智慧萬用鍋，能深度釋放營養，煮出食物深層精華，讓摯愛家人，天天享用最美味的營養', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1204, '電子壓力鍋 PC-MA2W', '1204.png', NULL, 4999, 'PC-MA2W', '324x318x316', '針對亞洲人的烹調習慣所設計，有低壓、高壓與超高壓等3階段模式讓您能根據不同食譜做細膩的火候控制以及易於開闔的鍋蓋設計等，各種基本需求一次滿足。', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1205, '微電腦6L壓力快鍋萬用鍋IEC-610', '1205.png', NULL, 2480, 'IEC-610', '367x 319x 228', '這台壓力鍋予人極高的自由度。既提供內建的65種調理選項，還可以切換成手動模式，不論是改良食譜中的料理，或是嘗試完全原創的菜色都能在此鍋上完成。\n\n', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1206, '智慧型萬用壓力鍋-6.0L CW-6101', '1206.png', NULL, 2480, 'CW-6101', '330 x 200 x 265', '這款電子壓力鍋的功能性有平均以上水準，且可供手動調整烹調時的壓力，可調段數也偏多，能配合不同料理方式、食材做出屬於個人的獨到口味。而在調理評比中，由它所烹煮的紅燒魚和法式燉菜湯兩道表現均佳，細小的魚骨', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1207, '智慧型微電腦萬用壓力鍋-6L CW-6112W', '1207.png', NULL, 2280, 'CW-6112W', '326x328x314', '國際牌推出的這款電子壓力鍋搭載4種調理模式，包含基本的悶蒸與加壓，並對應無水調理及健康湯品兩種，應用方式相當廣泛。而且它的操作介面簡單，但又能提供細膩的時間設定，螢幕上還有指示箭頭提醒使用者目前進行的', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1208, '5L電氣壓力鍋 SR-PG501-', '1208.png', NULL, 6220, 'SR-PG501', '257x 359x 259', '不但能調整壓力段數，也可將壓力完全取消，回歸最傳統的燉煮方式。面板還是採用旋鈕調節，食譜選項又精簡，因此從設定到開始烹調的過程相當流暢，易用性獲得評比團隊肯定。', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1301, '32公升微電腦變頻微波爐 NN-ST65', '1301.png', NULL, 5480, 'NN-ST65', 'null', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1302, '20L微電腦蒸氣烘烤爐 NU-SC180B', '1302.png', NULL, 11610, 'NU-SC180B', 'null', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1303, '過熱水蒸氣烘烤微波爐 MROVS700T', '1303.png', NULL, 15210, 'MROVS700T', 'null', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1304, '25L微電腦微波爐 R-T25KS(W)', '1304.png', NULL, 2990, 'R-T25KS(W)', 'null', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1305, '過熱水蒸氣烘焙微波爐 MRONBK5000T', '1305.png', NULL, 39510, 'MRONBK5000T', 'null', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1306, '20L微電腦鏡面微波爐 WMWE200S', '1306.png', NULL, 2790, 'WMWE200S', 'null', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1307, '32L獨立式萬用蒸烤箱WSO3200B', '1307.png', NULL, 16900, 'WSO3200B', 'null', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1308, '米家智能空氣炸鍋', '1308.png', NULL, 1895, '米家智能空氣炸鍋', 'null', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1309, '米家智能蒸氣小烤箱', '1309.png', NULL, 2590, '米家智能蒸氣小烤箱', 'null', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1401, '米家互聯網十字四門冰箱 486L (銀色)', '1401.png', NULL, 12246, '米家互聯網十字四門冰箱 486L', 'null', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1402, '米家互聯網對開門冰箱 540L (深灰)', '1402.png', NULL, 11602, '米家互聯網對開門冰箱 540L', 'null', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1403, '米家互聯網對開門冰箱450L (白色)', '1403.png', NULL, 11172, '米家互聯網對開門冰箱450L', 'null', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1404, 'RT62 雙循環雙門系列 623L 不鏽鋼時尚銀', '1404.png', NULL, 33800, 'RT62 雙循環雙門系列', 'null', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1405, 'RT43 雙循環雙門系列 443L 時尚銀', '1405.png', NULL, 23900, 'RT43 雙循環雙門系列', 'null', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1406, 'RT32 雙循環雙門系列 323L 奢華棕', '1406.png', NULL, 20400, 'RT32 雙循環雙門系列', 'null', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1501, '【Philips 飛利浦-智能鎖】 9300 IOT遠端全自動智能電子鎖', '1501.png', NULL, 36000, '9300 IOT', '422x756x52', '適合用於管理各種小型出租場地如套房、\n民宿、演講室等，可在租借者付費後配發電子鑰匙，\n省去人事費用。', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1502, 'SHS-H505台灣專用極簡精美款', '1502.png', NULL, 15999, 'SHS-H505', '81 x 302 x 66 ', '為三星專為台灣氣候設計的防潮專用機種，\n表面與內部經過加強防潮處理，讓機體更加耐用。\n開鎖可以設定密碼、感應卡或原廠感應吊飾開門；\n而三星獨家專利的動態隨機密碼系統，\n在按下密碼前需要先解除隨機亮起的', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1503, 'SHS-P718(金色)/SHP-DH537(古銅色)', '1503.png', NULL, 18900, 'SHS-P718', '818 x320 x 668 ', '這款智慧所的鎖頭可以直接裝在門框表面，無須內嵌於喇叭鎖孔或原鎖孔，因此厚度較薄的拉門也能安裝。外鎖處增加了紅外線偵測防盜功能，偵測到有人靠近並同時按下開門按鈕才會開門，可防止誤觸或非正常操作造成解鎖。', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1504, 'DP850指紋/卡片/密碼/鑰匙/藍芽一鍵推拉式智慧電子鎖（金/銀）', '1504.png', NULL, 22000, 'DP850', '42x9x23', '智慧所內建中文語音提示的功能，不需說明書也能輕鬆完成設定，方便隨時自行調整出入權限和指紋登記。可同時認證20組指紋與30組密碼，除了一搬家用也可應用於中小型辦公室。', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1505, '智能電子鎖 ID60', '1505.png', NULL, 26040, 'ID60', '3755x755x285 ', '另附有虛位密碼功能，可以在輸入密碼時隨機在密碼前後輸入數字，減少密碼破解機率。另外由於具有遠端遙控功能，如果用於一般出租辦公室或小型飯店等等，可以節省更多管理人力。', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1506, '智能電子鎖 ID80', '1506.png', NULL, 28140, 'ID80', '381x80x27', 'LED 顯示螢幕可確認上鎖狀態，並有低電量安全提醒。內側有防貓眼竊盜功能，專為欄杆式的舊式鐵門設計，防止小偷意圖從外側使用鐵絲勾鎖開門。也有防惡作劇模式能適時斷電，防止無聊人士亂按門鎖取樂。', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1507, 'FSL-800 六合一 密碼/指紋/卡片/鑰匙/金色', '1507.png', NULL, 35720, 'FSL-800', '81x302x66', '同時支援了指紋、密碼、卡片、藍芽、鑰匙、遠端密碼等多達六種解鎖方式，讓使用者更便利；此外，不僅具備了低電量提醒，在失去電力時也能夠使用機械鑰匙開啟，或是透過外接電池緊急供應電力，不用再擔心進不了家門的', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1508, 'Yale 3115A', '1508.png', NULL, 15888, 'Yale 3115A', '818 x 320 x 668', '採用熱感應式的觸碰鍵盤，讓機器不需24小時待命，以手掌接觸螢幕後才會亮起觸控鍵盤，大大延長電池壽命。專屬的APP除了可以即時遠端遙控開鎖，也能即時接收警報訊息，隨時掌握家中安全。可支援40張卡片資料，', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1509, 'PHILIPS 飛利浦 電子鎖/門鎖(9200)(紅古銅)', '1509.png', NULL, 38000, '9200', '81 x 302 x 66 ', '除了能夠支援所有門把種類之外，還有特殊防入侵功能；藉由內部結構的特殊設計，在外人嘗試破壞門鎖時，將會即時向手機 app 發出警報，同時也會觸發警報器聲響以嚇阻入侵者。另有緊急密碼功能，如果有外人意圖強', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1601, 'Tapo C210 300萬畫素', '1601.png', NULL, 999, 'Tapo C210', '866*85*1177', '3百萬畫素，廣角旋轉鏡頭\n★連續10年，全球市占率第一名的無線網路品牌\n★擁有300萬畫素高解析度，給您高清畫質\n★360º 水平旋轉，114º 垂直旋轉，超廣角的覆蓋範圍，隨時捕捉每個細節\n★紅外線', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1602, 'Tapo C200', '1602.png', NULL, 799, 'Tapo C200', '866*85*1177', '高畫質影像: 以清晰的1080p 捕捉每一個細節。\n進階型的夜視: 即使在晚上，攝影機也可以提供高達9公尺的可視距離。\n移動偵測通知: 如果偵測到任何可疑的事件會發出通知。\n聲光警報 : 當有陌生人靠', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1603, 'TP-Link Tapo C100', '1603.png', NULL, 649, 'TP-Link Tapo C100', '675*548*989', '極強夜視 資安保障\n★可在任何有無線網路的環境使用\n★高畫質影片 – 清晰1920*1080p畫質錄製所有影像\n★進階的夜視功能 - 提供可見距離高達9公尺\n★移動偵測和通知 - 通知您何時攝影機偵測', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1604, 'C920e', '1604.png', NULL, 3880, 'C920e', '434*93*71', '保持銳利、自動運作\n可拆卸隱私遮罩\n針對商務用途設計', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1605, 'Webcam MEETUP 超廣角視訊會議系統 自動對焦', '1605.png', NULL, 52800, 'Webcam MEETUP', '104*400*85', '◆ MeetUp 具有 4K 光學解析度與超廣角 120 度視野，讓會議桌的每個座位都清晰可見。\n◆ 其整合的音訊功能針對小型房間聲學環境最佳化，確保每個人的聲音影像都清晰可見可聞。\n◆ 超廣角 12', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1606, 'C310 HD 視訊攝影機', '1606.png', NULL, 945, 'C310 HD', '313*712*684', 'HD 720p 高品質視訊通話\n可一鍵上傳至Facebook及YouTuBe\n最高可達 五百萬畫素 照片拍攝\n實用有趣的影像軟體\n修正補光及雜訊過濾技術', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1701, 'Airdog X5 空氣淨化機', '1701.png', NULL, 49800, 'Airdog X5s', '30.6x31.6x65cm', '美國矽谷研發的全球最強空氣淨化器\n醫學專家精選空氣淨化器\n去除達0.0146微米，是\n病毒的六分之一流感病毒99.8%去除/細菌99.9%去除/PM2 .5 99.9%去除/ 去除甲醛99.9%\n採用', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1702, 'Dyson Pure Hot Cool Link HP03 三合一', '1702.png', NULL, 23900, 'Dyson Pure Hot Cool Link HP03', '632 x 112 x 154mm ', '淨化PM2.5，過濾髒空氣及過敏原  四季皆宜  無須收納 省空間\n★淨化99.95%的PM0.1、污染物及過敏原。\n★淨化過敏原：360度圓形濾網，淨化空氣不受角度、方向限制。\n★獨家氣流倍增技術幫', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1703, 'Pure Hot+Cool 三合一涼暖風扇空氣清淨機 HP04', '1703.png', NULL, 19900, 'Pure Hot+Cool HP04', '764 mm x 130 mm x 205 mm', '●可過濾PM0.1微米細懸浮微粒 達99.95%\n●四效合一：涼風+暖風+空氣清淨機+ APP智能監控 四季都不用收\n●吹送/捕捉/感應：徹底智慧淨化全室\n●360度全方位進氣： 機器任意方向擺放都可', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1704, '三合一涼暖智慧空氣清淨機 型號HP09 白金色', '1704.png', NULL, 28900, 'HP09', '76.4*130*20.5cm', '過濾H1N1病毒。\n偵測及持續消滅甲醛。\n濾除H1N1病毒90及99.95%超細微粒。', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1705, '次氯酸空氣淨化器 Viruswasher', '1705.png', NULL, 25124, 'SVW-AQA2000(S)', '370x 290x 600mm', '使用“次氯酸鹽”的空間殺菌和除臭和“高性能HEPA過濾器”的空氣淨化兩種功能來淨化室內空氣。發揮抑製作用、殺菌、除臭、集塵。三層過濾網強力收集花粉、PM2.5、屋塵等，淨化室內空氣。', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1706, '大金15.5坪 保濕雙重閃流空氣清淨機 MCK70VSCT-W', '1706.png', NULL, 19800, 'MCK70VSCT-W', '395x600x287mm', '獨家TAFU濾網防水、油有效防止濾網阻塞\n雙重閃流放電有效分解濾網上有害物質及異味\n主動離子有效分解空氣中細菌及過敏原\nTUFA濾網最長可用10年\n三重感知器(灰塵、PM2.5、異味)\n美肌保濕有效保', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1707, '12.5坪MINI閃流空氣清淨機 MC55USCT', '1707.png', NULL, 14800, 'MC55USCT', '高500X寬270X深270mm', '專利閃流放電有效分解濾網上有害物質及異味\n主動離子有效分解空氣中細菌及過敏原\n靜電HEPA濾網最長可用10年\n三重感知器(灰塵、PM2.5、異味)\n強力立體3D進氣快速有效集塵\n創新垂直式設計有效降低', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1708, '觸媒&閃流除臭觸媒強力空氣清靜機MC75LSC', '1708.png', NULL, 13800, 'MC75LSC', 'H576×W395×D230mm', '閃流空氣清淨機具備大金引以為傲的放電科技，「閃流放電」可產生具有強效氧化的高速電子，不僅能清除細菌與黴菌，連有害化學物質與過敏原等也能一併除去，更可去除PM2.5細懸浮微粒達99.9%。因為對空氣品質', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1709, '【BALMUDA】The pure 空氣清淨機(A01D-WH)', '1709.png', NULL, 10888, 'A01D-WH', '寬26 x 深26 x 高70cm', '•適用室內18坪\n•搭載TrueHEPA濾網\n•獨家的整流翼及扇葉設計\n•光柱設計-運轉狀態一目瞭然', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1710, 'Levoit Core 300空氣清淨機', '1710.png', NULL, 5540, 'Levoit Core 300', '長22*寬22*高41公分', '1. 榮獲2020年iF設計獎和2019年紅點設計獎。\n2. 美日熱銷機種，亞馬遜超過4顆星以上評價。\n3. 4層HEPA過濾可減少99.97％最小至0.1微米過敏原，如花粉、黴菌、病毒、灰塵、寵物毛', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1711, '薄型空氣清淨機 PA-301T', '1711.png', NULL, 11990, 'PA-301T', '370×130×687 MM', '強效三層過濾網\n空氣品質可視化顯示燈條\n日式極簡外型與工藝細節質感', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1712, '日本IRIS OHYAMA 衣服乾燥除濕機-DDD-50E', '1712.png', NULL, 9980, 'DDD-50E', '29.7×28.6×66cm', '日本IRIS衣服乾燥除濕機\n能縮短約1/5室內曬乾衣物的乾燥時間\n裝載循環器，強力速度乾燥，有效抑制濕氣及黴菌\n廣域送風、搖擺頭部功能裝載\n用50°·70°·90°的3等級，改變搖擺頭部的範圍\n一年四', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1713, '空氣清淨機 PMMS-DC110', '1713.png', NULL, 4990, 'PMMS-DC110', '400*201*586(mm)', '◆ 搭載智能室內空氣品質監測器\n◆ 具備了渦輪噴氣技術，配合高成本進口靜音馬達\n◆ 三層濾網 高效淨化 立體防護', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1714, 'Stadler Form Roger 空氣清淨機', '1714.png', NULL, 9000, 'Stadler Form Roger', '42*50*20(cm)', '■ 德國高效能雙層濾網\n■ 結合HEPA與活性炭濾網\n■ CADR 521 m3/h\n■ 顏色顯示自動偵測空氣品質\n■ 1-7小時定時功能', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1715, '高效抗菌智能旗艦清淨機Pure A9(PA91-406GY 優雅灰9-14坪)', '1715.png', NULL, 14900, 'Pure A9 PA91-406GY', '長315 x 寬315 x 高590 (mm)', '◆首創獨家五角設計\n◆360度HEPA 13級抗菌濾網\n◆16超低分貝\n◆安裝獨特RFID智慧標籤\n◆大面積濾網2.7平方公尺', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1716, 'LEAF 320i 藍光光觸媒空氣清淨機 - 精實版(無Wi-Fi)', '1716.png', NULL, 19900, 'LEAF 320i', '寬242*高652(mm)', '榮獲德國IF設計大獎\n全方位360度潔淨空氣高速循環\n新型藍光光觸媒淨化分解病黴菌\n手機Wi-Fi遠端設定控制及偵測\n最適合13坪大小空間無接縫機身時尚尊貴優雅', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1717, '加濕空氣清浄機 KI-NX75', '1717.png', NULL, 22950, 'KI-NX75', '400*259*693(mm)', '適用17坪 集塵 脫臭 循環氣流 KI-HX75 KI-JX75 KI-LX75後繼 2020年式', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1718, '保濕雙重閃流空氣清淨機 MCK70VSCT-W', '1718.png', NULL, 19480, 'MCK70VSCT-W', '395x600x287mm', '獨家TAFU濾網防水、油有效防止濾網阻塞\n雙重閃流放電有效分解濾網上有害物質及異味\n主動離子有效分解空氣中細菌及過敏原\nTUFA濾網最長可用10年\n三重感知器(灰塵、PM2.5、異味)\n美肌保濕有效保', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1719, '清淨機9.5坪 (MC40USCT)', '1719.png', NULL, 9800, 'MC40USCT', '高500X寬270X深270mm', '專利閃流放電有效分解濾網上有害物質及異味\n靜電HEPA濾網最長可用10年\n三重感知器(灰塵、PM2.5、異味)\n強力立體3D進氣快速有效集塵\n創新垂直式設計有效降低運轉噪音\n4段風段大小、3種模式選擇', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1720, '閃流放電除臭強力空氣清淨機(MC75LSC)', '1720.png', NULL, 9000, 'MC75LSC', 'H576×W395×D230mm', '＊光觸媒二氧化鈦磷灰石：利用二氧化鈦磷灰石牢牢吸住細菌與病毒後，再以閃流光觸媒加以分解與去除。  \n＊閃流放電：強效氧化力的高速電子迅速分解異味與過敏物質。  \n＊閃流除臭功能：將異味與過敏物質吸附於', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1721, 'nanoe 空氣清淨機 (F-PXM35W)', '1721.png', NULL, 6690, 'F-PXM35W', '長300*寬189*高520mm', '◆nanoe主動出擊淨化\n◆HEPA集塵濾網+除臭濾網\n◆異味感知\n◆5段風速(自動/強/中/弱/強力運轉)\n◆睡眠模式(8小時)\n◆濾網更換指示', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1722, '12坪 ECONAVI智慧省電雙科技空氣清淨機 F-PXM55W', '1722.png', NULL, 9810, 'F-PXM55W', '580*300*205(mm)', '＊適用坪數:12坪\n＊nanoe主動出擊淨化\n＊HEPA高密度濾網+奈米清淨除臭濾網\n＊ECONAVI智慧省電\n＊4大智慧感知(PM2.5/微塵/異味/照明)\n＊5段風速(自動/強/中/弱/PM2.5', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1723, '3M 倍淨型空氣清淨機FA-E180', '1723.png', NULL, 9990, 'FA-E180', '257*250*634(mm)', '輕聲濾淨不擾眠，睡眠模式下運轉下僅25.6dB．介於樹葉摩擦聲和輕聲細語音量間\n採用DC直流變頻馬達，最高轉速耗電量70W，每日開機12小時，一個月平均每日電費不到1.4元，每月不到41元* *以非營', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1724, 'MITSUBISHI 三菱 SP-ME32A 家用智能 空氣清淨機香檳金', '1724.png', NULL, 13500, 'SP-ME32A', '高645×寬385×深220mm', '日本三菱重工獨家HIFIL高效粉塵濾網對抗PM2.5\n去除有害氣體蜂巢型除臭濾網\n循環氣流全方位潔淨\n˙抗敏除箘，奈米銀初效濾網\n˙去除有害氣體，蜂巢型除臭濾網\n˙循環氣流，全方位潔淨\n˙五段風速\n˙', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1725, '無印良品|空氣清淨機 MJ-AP1TW', '1725.png', NULL, 13900, 'MJ-AP1TW', '寬25×深25×高49.8cm', '透過「雙迴圈計數風扇」及「360°集塵脫臭濾網」產生循環氣流，快速將ＰＭ2.5與花粉等浮游物質浮游物質集塵、脫臭。', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1726, '日本象印 空氣凈化器(白)PU-AA50-WA', '1726.png', NULL, 8976, 'PU-AA50-WA', '295x295x725 mm', '新款低噪音智能空氣凈化器。最大消費電量10W，365天24小時運轉也安心的節能設計', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1727, '小米空氣淨化器 3', '1727.png', NULL, 3995, '小米空氣淨化器 3', '240*240*520(mm)', '400m3/h 顆粒物。CADOLED 觸控顯示螢幕。高精度雷射顆粒物感應器。', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1728, '米家空氣淨化器Pro', '1728.png', NULL, 6595, '米家空氣淨化器Pro', '26*26*73.5(cm)', 'OLED顯示螢幕\n雷射顆粒物感應器\n3色指示燈\n空氣品質 清晰可見\n淨化效能 : 500m³/h\n適用面積 : 35m² ~ 60m²', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1801, '雙效空氣清淨除濕機(FD-A90W)', '1801.png', NULL, 9900, 'FD-A90W', '37.3*27.5*59.6(cm)', '除濕能力9.5L/日１機３用 清淨/除濕/乾衣！ 高效除濕+空氣濾淨，雙效合一 不需除濕功能 也可開啟獨立空氣清淨\n3M 雙效空氣清淨除濕機(FD-A90W)?除濕能力9.5L/日\n█１機３用，清淨/', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1802, '16公升雙效空氣清淨除溼機FD-Y160L', '1802.png', NULL, 14990, 'FD-Y160L', '38.4 x 65.9 x 28.3 cm', '先除溼再淨化，真正一乾二淨\n10分鐘過濾99.9%的細菌\n優於新制能效一級標準\n一台乾＋淨，省下40%+空間', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1803, '除濕輪除濕機-6.5公升(DD8061)', '1803.png', NULL, 4990, 'DD8061', '寬26.9x深17.4x高44.5(公分)', '●熱觸媒技術\n●日本抗過敏原濾網\n●除濕除臭除過敏原\n●乾衣不怕滋生黴菌\n●無壓縮機永不結霜', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1804, '除濕輪除濕機 (DD181FW)', '1804.png', NULL, 6980, 'DD181FW', '寬175x深295x高475(mm)', '日本除濕輪新科技，免壓縮機\n強效除濕力8L/日，永不結霜\n3D導風板+自動擺葉，寬廣無死角\n負離子+奈米銀濾網，濾淨空氣', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1805, '電子式負離子迷你防潮除濕機 灰色HL710-GY(負離子除濕機)', '1805.png', NULL, 1480, 'HL710-GY', '205 x 131 x 340 mm', '●負離子空氣清淨功能\n●最新半導體除濕技術\n●低功率節能省電環保\n●水滿自動停機保護\n●迷你輕巧美型', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1806, '負離子清淨防潮除濕機EPI-610AK', '1806.png', NULL, 2380, 'EPI-610AK', 'W205 x D131 x H340 (mm)', '● 搭配專屬負離子空氣清淨功能、除濕清淨一次完成\n● 熱電半導體制冷模式，節能省電\n● 無壓縮機除濕技術、低噪音', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1807, '10公升負離子清淨舒適除濕機 RD-200HS(閃亮銀)', '1807.png', NULL, 12990, 'RD-200HS', '365寬x625高x305深(mm)', '＊除濕能力：10公升/日 ＊負離子清淨功能 ＊PM2.5清淨濾網 ＊鏡面觸控面板 ＊雙吹出口導風 ＊白光LED顯示 ＊超大容量水箱 ＊電源自動收線 ＊聲光水位顯示 ＊四輪萬向移動 ＊快速乾衣', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1808, '8公升一級能效除濕機(RD-16FQ/RD-16FR)', '1808.png', NULL, 10590, 'RD-16FQ/RD-16FR', '330寬x600高x220深(mm)', '除溼能力 : 8公升/日\nLED按鍵式面板\n超廣角上吹\n舒適節電\n低濕乾燥\n自定濕度', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1809, '日立6公升除濕機 RD-12BR(玫瑰金)', '1809.png', NULL, 9290, 'RD-12BR', '高600*寬330*深220(mm)', '除濕能力：6公升/日\n連續除濕\n能源效率第一級\n滿水自動停止運轉\nMIT台灣製造', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1810, '負離子微電腦電子除濕機(KJ-HC02)', '1810.png', NULL, 1745, 'KJ-HC02', 'W240xD150xH360mm', '滿水位自動停止運作\n運轉低噪音安靜舒適\n無壓縮機環保概念新機種\n除濕/防霉/除臭\n水滿自動關閉運轉\n滿水位自動停止運作\n運轉低噪音安靜舒適\n減少黴菌塵蹣滋生率\n低耗電+負離子去除霉味\n無壓縮機環保概念', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1811, '負離子雙製冷晶片除濕機(KJ-HC05)', '1811.png', NULL, 1980, 'KJ-HC05', '24X14X36.5cm', '除濕淨化一次搞定\n超大液晶面板顯示\n渦流風道設計，立體噴射風量吸收濕氣\n雙製冷晶片，效能更加倍\n滿水位提示、溫度/相對濕度顯示\n小功率用電超省\n除濕淨化一次搞定\n超大液晶面板顯示\n滿水位提示、溫度/相', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1812, '【Life Plus】靜音節能迷你除濕機/衣櫥除濕機(白粉)', '1812.png', NULL, 1580, 'GZ-1607-1', '150*125*210(mm)', '輕鬆操作，一鍵搞定\n半導體製冷技術，除濕效果佳\n◆體積小|小坪數空間除濕無死角\n◆極安靜|風阻小運作超靜音\n◆超省電|耗電量僅22W\n◆高智慧|水滿系統自動斷電\n◆好安心|台灣BSMI認證變壓器', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1813, '25公升一級能效智慧變頻高效節能除濕機(MJ-EV250HM-TW)', '1813.png', NULL, 27900, 'MJ-EV250HM-TW', '寬410 × 深299 × 高630(㎜)', '高速除濕＋節能省電智慧變頻，高效節能新搭載 PM2.5 抗菌除臭濾網，空氣清淨更升級可自行設定喜好濕度大型水箱5.5公升', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1814, '12L日本製輕巧除濕機MJ-E120AN', '1814.png', NULL, 15300, 'MJ-E120AN', '寬37.2*深28.1*高59.4(CM)', '強勁送風、廣角90度自動擺葉搭載PM 2.5抗菌消臭濾網日除濕能力 12.0L●精巧機身\n獨家三重除濕系統\nPM2.5抗菌除臭濾網\n超靜音38dB\n大容量儲水箱4.7L\n獨立空清運轉', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1815, '9公升智慧型除濕輪除濕機(F-YZJ90W)', '1815.png', NULL, 8990, 'F-YZJ90W', '52x19.3x39cm', '除濕能力：9L/日(室溫27℃，相對濕度80%)\n創新方式：除濕輪式無冷媒低噪音\n高效烘衣：9種乾衣模式、自動偵測超貼心\n160°廣角出風口，3D立體烘衣\n33dB超靜音\n6項安全裝置', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1816, '11公升一級能效ECONAVI空氣清淨除濕機(F-Y22EN)', '1816.png', NULL, 9990, 'F-Y22EN', '(高)600 X (寬)350 X (深)230', '奈米銀抗菌抗敏清淨濾網\n25項安全裝置\n萬向輪\n除濕能力：11L/日(室溫27℃/相對溼度60%)\n適用室溫範圍：1℃~40℃\n適用坪數大小：~14坪 (46m²)\n能源因數值2.41L/kWh', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1817, '8公升一級能效清淨除濕機(F-Y16EN)', '1817.png', NULL, 7560, 'F-Y16EN', '高580 × 寬315 × 深225 (㎜) ', '■ 除濕能力8L/日(室溫27℃/相對溼度60%)\n■ 能源因數值2.41L/kWh\n■ 25項安全裝置\n■ nanoe X 奈米健康科技\n■ 定時功能：1~12小時\n■ 一級能效', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1818, '10L空氣清淨除濕機(F-Y20JH)', '1818.png', NULL, 12720, 'F-Y20JH', '寬370x高650x深322mm', '除濕能力 10公升/日(室溫27°C/相對溼度60%) \n5.5公升超大水箱設計\nnanoe™ X健康科技奈米水離子除臭、抑菌\nHEPA集塵濾網(H13等級)+活性碳?臭濾網\nW-HEXS雙重除濕系統', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1819, '一級能效6公升空氣清淨除濕機(AD-WA712T)', '1819.png', NULL, 4480, 'AD-WA712T', '290 寬 x 478 高 x 190 深 (mm)', '❁除濕能力：6L/日\n❁十重安全防護，使用好安心\n❁連續排水設計(可接水管)，免去倒水之困擾 \n❁三段定時關機設定(2、4、6小時)\n❁可自由設定濕度，40%/50%/60%/連續\n❁甲殼素濾網裝置，', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1820, '20L甲殼素PICO PURE清淨除濕機 DHY-GA20P', '1820.png', NULL, 16490, 'DHY-GA20P-', '390*691*275', '每日除濕力20公升\nAIE智慧模式，自動轉換除濕/清淨模式\n大螢幕LCD營幕顯示與操作\n玻璃鏡面美型、易清潔\n萬向腳輪，多重安全防護\n溫度/濕度感應\n水箱5公升，連續排水設計\nPICO PURE 清淨', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1821, '聲寶16公升/日PICO PURE清淨型除濕機AD-W732P', '1821.png', NULL, 11590, 'AD-W732P', '346寬x590高x242深mm', '◆除濕能力：16L/日\n◆可單獨使用PICOPURE清淨功能\n◆連續排水設計，免去倒水之困擾\n◆十項高規格安全防護，使用超安心\n◆新國家一級能效標準認證，省電又環保\n◆PICOPURE全效淨化，除菌、', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1822, 'SHARP 夏普 衣物乾燥空氣清淨除濕機 DW-J10FT-W', '1822.png', NULL, 10499, 'DW-J10FT-W', 'W35.9 x D30.1 x H66.5 CM', '4.6L大容量儲水箱\n高濃度自動除菌離子除菌脫臭\n防菌防黴運行，抑制99%黴菌\n額定除濕能力: 10公升/日(室溫27度 相對濕度60%)', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1823, '6L自動除菌離子除濕機(DW-L71HT-W)', '1823.png', NULL, 6030, 'DW-L71HT-W', '30.5 × 20.3 × 52.6', '能源效率1級\n除濕能力6L/日(B式/室溫27 ℃/相對濕度60%)\nPlasmacluster自動除菌離子除菌脫臭/定點脫臭\n下吹式45度除溼乾衣清淨氣流，有效乾燥潮濕地板/地毯及抑制細菌\n搭載溫濕', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1824, '6L自動除菌離子清淨除濕機 1級能效 DW-H6HT-W', '1824.png', NULL, 6449, 'DW-H6HT-W', 'W304 x D203 x H480mm', '除濕能力6L/日(B式/室溫27 ℃/相對濕度60%)\nPlasmacluster自動除菌離子除菌脫臭/定點脫臭\n搭載溫濕度感應器自動偵測除濕\n空氣清淨/連續除濕/衣物乾燥三種模式\n自動除霜/滿水自動', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1825, '8公升一級能效節能除濕機(TDH-168MB-NW)', '1825.png', NULL, 5888, 'TDH-168MB-NW', 'H578*W352*D277(mm)', '．一級能源效率\n．自動溼度感測\n．水滿自動停機\n．LED顯示&9種安全保護\n．除濕溼度控制&連續除濕模式\n．連續排水設計\n．隱藏式把手設計\n．採環保冷媒R134A\n．電源：110V/60HZ\n．消耗功', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1826, '6公升除濕機 (TDH-120MX)', '1826.png', NULL, 4990, 'TDH-120MX', '長29cm X 寬19cm X 高47.8cm', '．除濕能力(DB27℃，RH60%)\n．水箱容量：2.0L\n．輕巧化設計，不占空間\n．隱藏式把手\n．9重安全防護設計', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1827, '6公升除濕機 TDH-125MB', '1827.png', NULL, 4480, 'TDH-125MB', '520*300*225mm', '◎除濕能力：6L/日(27℃相對溼度60%RH)\n◎水箱容量：2.5L\n◎定時功能：2-4-8R小時定時關機設定\n◎具備自我除霜功能\n◎三段濕度控制\n◎9種安全保護設計\n◎單向滑輪，移動方便\n◎型號 ', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1828, '360°衣物乾燥除濕機(7L/日) RJ-XAF70', '1828.png', NULL, 12990, 'RJ-XAF70', '29.5x29.5x55(cm)', '■ 除濕能力：7L/日 (室温20℃，相對濕度60%)\n■ 360度送風、立體旋轉擺葉+上下風向，3D循環乾燥\n■ 沸石式除濕，不受寒冷氣候限制，維持穩定除濕力\n■ 適用於各種日常空間，除濕不間斷乾爽', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1829, '【RF-FA20】乾燥機 強力風量 快速乾燥 季節模式 衣物 棉被 烘被 烘鞋機 除蟎 除濕', '1829.png', NULL, 5760, 'RF-FA20', '23 x 15 x 36', '■智能\n不需要傳統烘乾機中的墊子和軟管，只需打開即可設置並立即開始運行。\n■強勁\n雙風扇高效傳遞風量的結構和噴嘴的進化，使風量更加強勁。\n■精巧\n設計更精巧，同時增加風量。它易於存放在床邊，只需折疊即', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(1830, '6L 沸石式 / 除濕輪 除濕機 SD-014V', '1830.png', NULL, 5180, 'SD-014V', '55.5(高)Ｘ34.4(寬)Ｘ28.8(深)/CM ', '◎ 微電腦控制\n◎ 連續運轉 (高 / 中 / 低 / 自動)\n◎ 自動除濕模式 (40% 50% 60%)\n◎ 過濾網(前置塑膠濾網 / 蜂巢狀除甲醛濾網)\n◎ 隱藏式提把 + 貼心滾輪設計\n◎ 滿', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2001, '32型Android智慧連網液晶顯示器(2T-C32BE1T)', '2001.png', NULL, 8455, '(2T-C32BE1T', 'null', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2002, '42型Android智慧連網液晶顯示器(2T-C42BE1T)', '2002.png', NULL, 10355, '2T-C42BE1T', 'null', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2003, '43型4K HDR智慧連網電視(UA43TU8000WXZW)', '2003.png', NULL, 16900, 'UA43TU8000WXZW', 'null', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2004, '50型4K HDR智慧連網QLED量子電視(QA50Q60TAWXZW)', '2004.png', NULL, 21900, 'QA50Q60TAWXZW', '1264 x 780 x 145', '金屬量子點顯色技術\n雙視光增豔科技\n支援HDR雙規格', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2005, '智慧顯示器65型(SKU29535)', '2005.png', NULL, 20990, 'SKU29535', '1500*862*90', '小米智慧顯示器 65 型採用全新超薄音響設計。\n以四個強大的音效驅動元件，組成一組20W功率的杜比™立體聲喇叭，\n在家中帶來猶如身臨其境的聽覺享受。', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2006, '55型智慧顯示器(P1)', '2006.png', NULL, 15999, '55型智慧顯示器(P1)', '1230*247*767', '四核心處理器 2GB+16GB\n杜比音效和DTS-HD解碼\nAndroid TV☆ 10', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2007, '65型QLED量子4K安卓智慧聯網全陣列區域控光液晶顯示器(65U8000VS)', '2007.png', NULL, 37900, '65U8000VS', '1462*898*69', '量子黑面板｜全陣列區域控光\nharman/kardon音效\nandroidTV追劇|三年保', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2008, '65型4K HDR安卓區域控光廣色域智慧聯網液晶顯示器(65U7900VS)', '2008.png', NULL, 25900, '65U7900VS', '1500*862*90', '日本設計｜東芝品質｜３年保固\n區域控光｜廣色域｜六真色PRO\nandroid tv 安卓平台', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2009, '55型QLED量子4K安卓智慧聯網全陣列區域控光液晶顯示器(55U8000VS)', '2009.png', NULL, 29900, '55U8000VS', '1452*862*89', '量子黑面板｜全陣列區域控光\nharman/kardon音效\nandroidTV追劇|三年保\n', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2101, '小米AI音箱', '2101.png', NULL, 1495, 'AI音箱', '88 mm x 211.6 mm', '小愛同學身為華語智慧 AI 語音助理領導者，其獨家音色技術，使得它擁有多種情感表現，尤其是對於中文聲音辨識與理解力，與 Google 小姐相比也毫不遜色。除此之外，在音色上也是採用好萊塢 DTS音效等', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2102, '小米 小愛音箱 Art', '2102.png', NULL, 1495, '小愛音箱 Art', '131×104×151mm', '小愛同學身為華語智慧 AI 語音助理領導者，其獨家音色技術，使得它擁有多種情感表現，尤其是對於中文聲音辨識與理解力，與 Google 小姐相比也毫不遜色。除此之外，在音色上也是採用好萊塢 DTS音效等', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2103, '中華電信i寶貝智慧音箱(高階款)', '2103.png', NULL, 5990, '中華電信i寶貝智慧音箱(高階款)', '114 x 224 mm', '「高階款」的音箱有更強大的遠距收音能力，可在5公尺的距離喚醒音箱和下指令，並內建ARM Cortex-A9R4四核架構CPU，讓語音識別速度更快，再搭配360°雙麥克風收音，和全音域渾厚音場。', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2104, '中華電信i寶貝智慧音箱(入門款)', '2104.png', NULL, 2790, '中華電信i寶貝智慧音箱(入門款)', '114x114x45.4mm', 'LUCIA mini 採用輕巧的外型設計，機身設有 4 組麥克風，可進行 360 度全面收音，提高音箱的喚醒率。軟體方面，內建中華電信 i 寶貝智慧聲控服務，同時導入 B2B2C 企業合作方案，支援迎', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2105, 'LUCIA智慧音箱', '2105.png', NULL, 3990, 'LUCIA智慧音箱', '308 x 135 x 97.2mm', 'LUCIA喚醒率達95%，即使撥放音樂的同時，也能聽得到您的呼喚。\n 看MOD、聽音樂、唸童書 、學英文、個人助理 ，還能操控智慧家庭設備。\n LUCIA 獨家的「視覺化語音互動介面」，可自動喚醒手機', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2106, '遠傳愛講智慧音箱 WF62018', '2106.png', NULL, 1680, 'WF62018', '112 x 240 mm', '結合智慧家庭設備 一聲就控\n 標準國語語音辨識 一講就通\n 在地化台灣資訊 一問就知\n 是音箱，更是隨時待命的智慧語音助理。\n 想做什麼就開口，愛講為你啟動便利貼心的智慧生活', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2107, '遠傳愛講小狐狸WG62028', '2107.png', NULL, 3500, 'WG62028', '121x114x45.4mm', '資訊快查：台灣天氣、空氣品質、查股票、匯率換算、維基百科、翻譯\n 生活幫手：設置提醒、查詢時間、設置鬧鐘、萬年曆、單位換算、家庭留言機、計算機\n 學習娛樂：friDay 音樂、KKBOX 音樂雙平台、', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2108, '富連網家 智能AI音箱 (SPK01A)', '2108.png', NULL, 1990, 'SPK01A', '75 mm*185mm', '最多廣播頻道的智能音箱\n 支援 AirPlay/DLNA\n 支援多音源播放\n 最實惠入手價', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2109, '小豹 AI 智能音箱', '2109.png', NULL, 3499, '小豹 AI 智能音箱', '122 x 149 mm', '小豹AI音箱是獵豹移動推出的智慧音箱，內建五顆揚聲器與6隻麥克風陣列，音質表現上有一定水準。音樂方面支援KKBOX，內建的語音助理小豹也能做到小愛同學能做到的事。智慧家庭裝置的部份，目前有支援Life', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2110, 'Acer Halo Smart Speaker', '2110.png', NULL, 4990, 'Acer Halo Smart Speaker', '168 x 96 mm', '由 Acer 於2021最新打造的 Halo 智慧音箱，在規格上使用 DTS Surround 360度環境音效技術，並可搭配多家串流音樂服務平台。還有可設計的個性化面板以及 RGB 燈效，是重視音樂', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2111, 'Amazon echo Dot (4th Gen) Kids', '2111.png', NULL, 1390, 'Amazon echo Dot (4th Gen) Kids', '100 mm x 89mm', 'Echo Dot Kids Edition，造型提供兩種彩色打印版本（熊貓和老虎），更特別為兒童設計了一些功能，如設置動物警報，功課及作業幫助，甚至能打電話給認可的家人和朋友等。', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2112, 'Amazon echo Dot (4th Gen)', '2112.png', NULL, 1790, 'Amazon echo Dot (4th Gen)', '144mm x 133mm', '最新一代 Echo，外型設計上把上一代 Echo 與 Echo Spot 結合，採用了圓球形狀，該球體的大部分表面為格柵，至於塑料底面則設有具燈光效果的 LED 環。它的大小適中，設計時尚簡約，輕鬆融', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2113, 'Apple HomePod mini', '2113.png', NULL, 2799, 'Apple HomePod mini', '84.3 mm x 97.9 mm', '讓房間彌漫音樂，是個聰明伶俐的小助手。幫忙掌控你的智慧家庭生活。確保隱私權與安全性。\n HomePod mini 滿載創新技術，小小體積，揚聲器卻有令人驚歎的響亮音質。它的高度只有 84.3 公釐，幾', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2114, 'HomePod', '2114.png', NULL, 9900, 'HomePod', '172 mm x 142 mm', '這款銳意打造的揚聲器儘管外形小巧，音色卻豐富渾厚、細節分明。HomePod 將 Apple 精心打造的音訊技術與先進軟體巧妙結合，帶來響徹滿室的精準音色。且高度不到 18 公分，HomePod 放在家', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2115, 'Asus AI800M PRO', '2115.png', NULL, 2990, 'Asus AI800M PRO', '99 x 99 x 205 mm', 'ASUS 華碩的小布智慧音箱，主打在地研發語音助理，可播放台灣華視新聞、大愛廣播電台等，整合起本地多元生態圈。也提供個人化語音設定，藉由專屬 App 自訂對話，便可在下達特殊指令時，喚起小布回答事先設', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2116, 'Soundfor elite hifi', '2116.png', NULL, 12990, 'Soundfor elite hifi', '168.5mm x 162mm', 'SOUNDFORM ELITE 是與音響領先專家 Devialet 攜手合作打造的喇叭，能提供高保真聲音，帶來震撼的音訊體驗。我們將 Devialet 非凡的聲學構造與快速的無線充電和屢獲殊榮的設計互', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2117, 'Bose Portable Smart Speaker', '2117.png', NULL, 12500, 'Bose Portable Smart Speaker', '119 x 191.5 mm', '可支援 Airplay 2、Spotify Connect 以及 Google Assistant 的「BOSE 可攜式智慧型揚聲器」。別看這款揚聲器外觀小小的，它可具有 360° 全方位音效、無線藍', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2118, 'Google Nest Audio', '2118.png', NULL, 3180, 'Google Nest Audio', '124×175mm', 'Google打造台灣在地中文服務。\n 開個口，幫你處理生活大小事。\n 開個口，MyMusic音樂 聲控即播。\n 音質更加優異，低音出色，音樂宏亮且富層次感。\n 語音指令控制相容的家用智慧型裝置。\n 提', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2119, 'Google Nest Mini', '2119.png', NULL, 1785, 'Google Nest Mini', '98 mm x 42 mm', 'Google 智慧音箱 Google Nest Mini 算是 Home Mini 進階產品，除了親民價格外，也針對台灣使用者的語言習慣，提升中文語音助理能力。並且能透過 Google 聲音識別技術，', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2201, 'Tapo P100 wifi無線網路智慧插座開關(支援Google assistant音箱)', '2201.png', NULL, 399, 'Tapo P100', '60*38*33mm', '防燃耐熱材質，多種安全防護\n內建獨立控制器，無需額外添購閘道器\n透過無線網路連結居家網路\n內建強力受訊網卡，與家中分享器阻隔3堵牆依然可以連線\n平板/智慧型手機搭配Tapo app 遠端操控家電\n遠端', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2202, 'Tapo P105 wifi無線網路智能智慧插座開關(支援Google nest mini音箱)', '2202.png', NULL, 399, 'Tapo P105', '60*38*33mm', '★全球銷量NO.1無線設備大廠牌出品，品質保證\n★支援更高功率的電器100-125 V，最大負載1800W\n★迷你設計 – 不阻擋鄰近插座的使用空間\n★遠端控制 – Tapo app管理，不在家也能控', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2203, 'HS105 Wi-Fi 無線網路雲智慧插座', '2203.png', NULL, 599, 'HS105', '140*90*88mm', '獨立主機\n家裡有Wi-Fi網路即可使用\n迷你設計，不佔用多餘的插座空間\n2.4GHz無線智慧插座\n具有定時器和設定日程計劃功能\n超值加購', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2204, 'Opro9 智慧插座 (三系統)', '2204.png', NULL, 1099, 'Opro9', '114*54*42mm', '蘋果Apple Homekit授權認證\n可支援APPLE iOS . Google . Amazon Alexa\n透過手機APP或是SIRI\n輕鬆遙控、監控、排程家中的電器設備\n1.透過「家庭」APP', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2205, 'DSP-W118 迷你Wi-Fi智慧插座', '2205.png', NULL, 599, 'DSP-W118', '68*38*35mm', '★透過無線網路連結居家網路\n★平板/智慧型手機搭配mydlink app 遠端操控家電\n★遠端監控、操作排程開關電源\n★支援Google Assistant, Amazon Alexa ,IFTTT輕', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2206, 'Wi-Fi WiZ 智慧照明 智慧插座(PW005)', '2206.png', NULL, 699, 'PW005', '70*70*130mm', '■Wi-Fi 直連無須網關，輕鬆安裝\n■語音控制，設定日程\n■迷你設計不佔用多餘的插座空間\n■平板/智慧型手機APP管理與安裝，簡單方便\n', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2207, 'WIFI無線遙控入牆式智慧插座(崁入式/智能/獨立開關)', '2207.png', NULL, 800, 'WIFI無線遙控入牆式智慧插座', '70*120*40mm', '家裡有Wi-Fi網路就可以使用\n可透過語音指令操作\n手機遠端遙控 多種情境設定\n2.4GHz無線智慧獨立開關\n', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2208, '米家空调伴侣2', '2208.png', NULL, 339, '米家空调伴侣2', 'null', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2209, '小米智能多模网关', '2209.png', NULL, 726, '小米智能多模网关', 'null', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2301, '智慧i系列12W智能三用燈泡 LED-E2712-I', '2301.png', NULL, 499, 'LED-E2712-I', 'null', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2302, 'LED 智慧燈泡 Lite 彩光版', '2302.png', NULL, 395, 'LED 智慧燈泡 Lite 彩光版', 'null', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2303, 'LED 智慧燈泡 Lite 白光版', '2303.png', NULL, 400, 'LED 智慧燈泡 Lite 白光版', 'null', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2304, '智能燈泡', '2304.png', NULL, 680, '智能燈泡', 'null', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2305, 'Wi-Fi WiZ 智慧照明 可調色溫嵌燈(PW003)', '2305.png', NULL, 699, 'PW003', 'null', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2306, 'Wi-Fi WiZ 智慧照明 7.5W全彩燈泡(PW004)', '2306.png', NULL, 799, 'PW004', 'null', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2307, '智慧燈泡 全彩LED', '2307.png', NULL, 1990, '智慧燈泡 全彩LED', 'null', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2308, 'TRÅDFRI Led 燈膽 e27 806流明, 無線調光/白光光譜 透明', '2308.png', NULL, 600, '無線調光/白光光譜 透明', 'null', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2309, 'TRÅDFRI Led 燈膽 e14 600流明, 無線調光/白光光譜 奶白色', '2309.png', NULL, 520, '無線調光/白光光譜 奶白色', 'null', 'null', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2401, 'SOMA Smart Home Smart Tilt 2 智能窗簾機', '2401.png', NULL, 3000, 'SOMA Smart Home Smart Tilt 2', '150*100*50', '旋轉棒控制器可以說是專門為百葉窗簾所設計的，這類控制器可以取代原本百葉窗轉棒的功能，藉此改變葉片的方向。知名產品同樣是SOMA 推出的SOMA Tilt (119鎂)，與SOMA Smart Shad', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2402, '智慧窗簾控制器 第2代', '2402.png', NULL, 5042, '智慧窗簾控制器 第2代', '150*120*50', '如果不想對原先的窗簾做太多的更動，則可以選擇“珠鏈繩控制器”、“窗簾移動機器人” 或“智慧型萬用遙控器” 這類型的產品，安裝起來方便快速。', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2403, '窗簾機器人*2', '2403.png', NULL, 4950, '窗簾機器人*2', '150*120*50', '如果家裡原本的窗簾就是電動窗簾，而且是使用RF射頻遙控器操作的話，還是有辦法讓它變成真正的智慧窗簾的，智慧型萬用遙控器BroadLink RM Pro+ 即可完成此事。', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2404, '智能窗簾電機', '2404.png', NULL, 2800, '智能窗簾電機', '150*120*50', '購買“成品捲簾” 時才需要考慮窗簾布的透光度，看是要全遮光還是半遮光窗簾，可以根據自己需求選購不同產品。', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2405, '捲簾電機軸SOMFY', '2405.png', NULL, 12000, '捲簾電機軸', '770*100*140', '法國的電動窗簾大廠Somfy 就有各種捲簾電機軸相關產品，他們的裝置採用自家通訊技術與遙控器溝通，若要升級成連網智慧窗簾則要搭配訊號轉換器Somfy myLink 或是Somfy TaHoma，搭配後', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13'),
(2406, '捲簾', '2406.png', NULL, 6500, '捲簾', '100*190', '市面的智慧窗簾成品並不多見，大部份都要找廠商專門訂製，所以價格都會拉得比較高。幸運的是，IKEA 在歐美有推出兩款智慧捲簾系列產品，只要找到對的尺寸買回家裝在牆上即可，不會有太多的DIY 步驟。', NULL, NULL, NULL, NULL, '2021-08-21 07:30:13', '2021-08-21 07:30:13');

-- --------------------------------------------------------

--
-- 資料表結構 `products_choice`
--

CREATE TABLE `products_choice` (
  `choi_id` int(11) NOT NULL COMMENT '商品可選擇編號',
  `choi_name` varchar(15) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '商品可選擇名稱',
  `prod_id` int(11) NOT NULL COMMENT '商品編號',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT '新增時間',
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- 資料表結構 `products_img`
--

CREATE TABLE `products_img` (
  `img_id` int(11) NOT NULL COMMENT '商品圖編號',
  `func` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '功能',
  `filename` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '檔案名稱',
  `prod_id` int(11) NOT NULL COMMENT '商品編號',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT '新增時間',
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- 資料表結構 `products_specification`
--

CREATE TABLE `products_specification` (
  `prod_id` int(11) NOT NULL COMMENT '商品編號',
  `specific_id` varchar(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '規格項目編號(A/B/C/D/E)',
  `specific_content` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '內容',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT '新增時間',
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `products_specification`
--

INSERT INTO `products_specification` (`prod_id`, `specific_id`, `specific_content`, `created_at`, `updated_at`) VALUES
(501, 'A', '有', '2021-08-21 07:37:34', '2021-08-21 07:37:34'),
(501, 'B', 'google home', '2021-08-21 07:37:34', '2021-08-21 07:37:34'),
(501, 'C', 'google assistent', '2021-08-21 07:37:34', '2021-08-21 07:37:34'),
(501, 'D', '日間,夜間,休息模式', '2021-08-21 07:37:34', '2021-08-21 07:37:34'),
(501, 'E', '有', '2021-08-21 07:37:34', '2021-08-21 07:37:34'),
(501, 'F', '有', '2021-08-21 07:37:34', '2021-08-21 07:37:34');

-- --------------------------------------------------------

--
-- 資料表結構 `rate_item`
--

CREATE TABLE `rate_item` (
  `cate_id` int(11) NOT NULL COMMENT '類別編號',
  `rate_A_name` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '評價項目A名稱',
  `rate_B_name` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '評價項目B名稱',
  `rate_C_name` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '評價項目C名稱',
  `rate_D_name` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '評價項目D名稱',
  `rate_E_name` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '評價項目E名稱',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT '新增時間',
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `rate_item`
--

INSERT INTO `rate_item` (`cate_id`, `rate_A_name`, `rate_B_name`, `rate_C_name`, `rate_D_name`, `rate_E_name`, `created_at`, `updated_at`) VALUES
(3, '清潔力', '拖地功能', 'CP值', '轉角幅度', '續航力', '2021-08-21 07:52:19', '2021-08-21 07:52:19'),
(4, 'null', 'null', 'null', 'null', 'null', '2021-08-21 07:52:19', '2021-08-21 07:52:19'),
(5, 'null', 'null', 'null', 'null', 'null', '2021-08-21 07:52:19', '2021-08-21 07:52:19'),
(6, 'null', 'null', 'null', 'null', 'null', '2021-08-21 07:52:19', '2021-08-21 07:52:19'),
(12, 'null', 'null', 'null', 'null', 'null', '2021-08-21 07:52:19', '2021-08-21 07:52:19'),
(13, 'null', 'null', 'null', 'null', 'null', '2021-08-21 07:52:19', '2021-08-21 07:52:19'),
(14, 'null', 'null', 'null', 'null', 'null', '2021-08-21 07:52:19', '2021-08-21 07:52:19'),
(15, 'null', 'null', 'null', 'null', 'null', '2021-08-21 07:52:19', '2021-08-21 07:52:19'),
(16, 'null', 'null', 'null', 'null', 'null', '2021-08-21 07:52:19', '2021-08-21 07:52:19'),
(17, 'null', 'null', 'null', 'null', 'null', '2021-08-21 07:52:19', '2021-08-21 07:52:19'),
(18, 'null', 'null', 'null', 'null', 'null', '2021-08-21 07:52:19', '2021-08-21 07:52:19'),
(19, 'null', 'null', 'null', 'null', 'null', '2021-08-21 07:52:19', '2021-08-21 07:52:19'),
(20, 'null', 'null', 'null', 'null', 'null', '2021-08-21 07:52:19', '2021-08-21 07:52:19'),
(21, '音質', '藍牙連接順暢度', '多平台連接', '收音狀況', '功能豐富度', '2021-08-21 07:52:19', '2021-08-21 07:52:19'),
(22, 'null', 'null', 'null', 'null', 'null', '2021-08-21 07:52:19', '2021-08-21 07:52:19'),
(23, 'null', 'null', 'null', 'null', 'null', '2021-08-21 07:52:19', '2021-08-21 07:52:19'),
(24, 'null', 'null', 'null', 'null', 'null', '2021-08-21 07:52:19', '2021-08-21 07:52:19');

-- --------------------------------------------------------

--
-- 資料表結構 `specification_item`
--

CREATE TABLE `specification_item` (
  `cate_id` int(11) NOT NULL COMMENT '類別編號',
  `specific_A` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '規格項目A名稱',
  `specific_B` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '規格項目B名稱',
  `specific_C` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '規格項目C名稱',
  `specific_D` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '規格項目D名稱',
  `specific_E` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '規格項目E名稱',
  `specific_F` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '規格項目F名稱	',
  `specific_G` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '規格項目G名稱	',
  `specific_H` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '規格項目H名稱	',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT '新增時間',
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `specification_item`
--

INSERT INTO `specification_item` (`cate_id`, `specific_A`, `specific_B`, `specific_C`, `specific_D`, `specific_E`, `specific_F`, `specific_G`, `specific_H`, `created_at`, `updated_at`) VALUES
(3, '導航系統', '機身高度', '吸力程度', '斷點續掃', '虛擬牆', '地毯增壓', '集塵盒容量', '拖地機能	', '2021-08-21 08:01:57', '2021-08-21 08:01:57'),
(4, '容量', '連結APP', '手機遠端控制', '多功能料理', '內建菜單', 'null', 'null', 'null', '2021-08-21 08:01:57', '2021-08-21 08:01:57'),
(5, '音控系統', '智慧家庭中樞', '語音助理', '多情境設定', '連結APP', '手機遠端控制', 'null', 'null', '2021-08-21 08:01:57', '2021-08-21 08:01:57'),
(6, '支援語言', '多情境設定', '連結APP', '手機遠端控制', '定時提醒', 'null', 'null', 'null', '2021-08-21 08:01:57', '2021-08-21 08:01:57'),
(12, '容量', '功率（W）', '調理方式', '連結APP', '內鍋材質', 'null', 'null', 'null', '2021-08-21 08:01:57', '2021-08-21 08:01:57'),
(13, '最高輸出', '紅外傳感器', '連結APP', '自動菜單數量', '容易清潔', 'null', 'null', 'null', '2021-08-21 08:01:57', '2021-08-21 08:01:57'),
(14, '智能溫控', '連結APP', '急速冷凍', '能源效率', '食材統計', 'null', 'null', 'null', '2021-08-21 08:01:57', '2021-08-21 08:01:57'),
(15, '免手持式', '手機遠端控制', '多裝置', '電池使用壽命', '開門方式', 'null', 'null', 'null', '2021-08-21 08:01:57', '2021-08-21 08:01:57'),
(16, '手機遠端控制', '畫質', '夜視功能', '藍牙規格', '智慧家庭中樞', 'null', 'null', 'null', '2021-08-21 08:01:57', '2021-08-21 08:01:57'),
(17, '手機遠端控制', '連結APP', '適用坪數', '除溼功能', '是否有耗材', 'null', 'null', 'null', '2021-08-21 08:01:57', '2021-08-21 08:01:57'),
(18, '手機遠端控制', '連結APP', '適用坪數', '是否有耗材', '除濕運做原理', 'null', 'null', 'null', '2021-08-21 08:01:57', '2021-08-21 08:01:57'),
(19, '智能溫控', '連結APP', '手機遠端控制', '情境變化', '音控系統', 'null', 'null', 'null', '2021-08-21 08:01:57', '2021-08-21 08:01:57'),
(20, '螢幕更新率', '手機遠端控制', '連結APP', '護眼機制', '語音互動', '智慧平台整合', '內容共享', 'null', '2021-08-21 08:01:57', '2021-08-21 08:01:57'),
(21, '音訊技術', '360環場音效', '藍芽規格', '音樂服務平台', '語音助理', '智慧家庭中樞', '支援中文', 'null', '2021-08-21 08:01:57', '2021-08-21 08:01:57'),
(22, '連結APP', '無線搖控', '智慧家庭中樞', '場景模式', 'WIFI傳輸', 'null', 'null', 'null', '2021-08-21 08:01:57', '2021-08-21 08:01:57'),
(23, '多情境設定', '智慧家庭中樞', '色溫調節', '音控裝置', '連結APP', 'null', 'null', 'null', '2021-08-21 08:01:57', '2021-08-21 08:01:57'),
(24, '連結APP', '手機遠端控制', '音控裝置', '場景模式', '定時設定', 'null', 'null', 'null', '2021-08-21 08:01:57', '2021-08-21 08:01:57');

-- --------------------------------------------------------

--
-- 資料表結構 `users`
--

CREATE TABLE `users` (
  `user_id` int(11) NOT NULL COMMENT '會員編號',
  `email` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '會員信箱',
  `pwd` varchar(40) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '密碼',
  `user_name` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '會員名稱',
  `photo_sticker` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'https://drive.google.com/file/d/1j9M38egVWwyK5h5Dj7akjR9gNLBM5wtz/view?usp=sharing' COMMENT '會員頭貼(預設)',
  `phone_number` int(10) DEFAULT NULL COMMENT '會員電話',
  `birthday` date DEFAULT NULL COMMENT '會員生日',
  `class` varchar(11) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '一般會員' COMMENT '會員等級(預設)',
  `address` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '會員地址',
  `store_a` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '常用配送超商a',
  `store_b` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '常用配送超商b',
  `store_isDefault` tinyint(1) DEFAULT 0 COMMENT '是否為預設超商(0:A;1:B)',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT '新增時間',
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `users`
--

INSERT INTO `users` (`user_id`, `email`, `pwd`, `user_name`, `photo_sticker`, `phone_number`, `birthday`, `class`, `address`, `store_a`, `store_b`, `store_isDefault`, `created_at`, `updated_at`) VALUES
(1, 'a1@a.a', 'a1', 'sophia01', 'photo_sticke_02', 900000001, '2021-08-01', '一般會員', '台北市大安區復興南路一段390號2樓', '台北店', '香港店', 0, '2021-08-21 06:04:28', '2021-08-21 06:04:28'),
(2, 'a2@a.a', 'a2', 'sophia02', 'photo_sticke_03', 900000002, '2021-08-02', '一般會員', '香港太平山山頂', '台北店', '香港店', 0, '2021-08-21 06:04:28', '2021-08-21 06:04:28'),
(3, 'a3@a.a', 'a3', 'sophia03', 'photo_sticke_01', 900000003, '2021-08-03', '一般會員', '台北市大安區復興南路一段390號2樓', '復興店', '敦北店', 0, '2021-08-21 06:04:28', '2021-08-21 06:04:28'),
(4, 'a4@a.a', 'a4', 'sophia04', 'photo_sticke_02', 900000004, '2021-08-04', '一般會員', '香港太平山山頂', '南港店', '新莊店', 0, '2021-08-21 06:04:28', '2021-08-21 06:04:28'),
(5, 'a5@a.a', 'a5', 'sophia05', 'photo_sticke_03', 900000005, '2021-08-05', '一般會員', '台北市大安區復興南路一段390號2樓', '南投店', '埔里店', 0, '2021-08-21 06:04:28', '2021-08-21 06:04:28'),
(6, 'a6@a.a', 'a6', 'sophia06', 'photo_sticke_01', 900000006, '2021-08-06', '一般會員', '香港太平山山頂', '台北店', '香港店', 0, '2021-08-21 06:04:28', '2021-08-21 06:04:28'),
(7, 'a7@a.a', 'a7', 'sophia07', 'photo_sticke_02', 900000007, '2021-08-07', '一般會員', '台北市大安區復興南路一段390號2樓', '台北店', '香港店', 0, '2021-08-21 06:04:28', '2021-08-21 06:04:28'),
(8, 'a8@a.a', 'a8', 'sophia08', 'photo_sticke_03', 900000008, '2021-08-08', '一般會員', '香港太平山山頂', '台北店', '香港店', 0, '2021-08-21 06:04:28', '2021-08-21 06:04:28'),
(9, 'a9@a.a', 'a9', 'sophia09', 'photo_sticke_01', 900000009, '2021-08-09', '一般會員', '台北市大安區復興南路一段390號2樓', '台北店', '香港店', 0, '2021-08-21 06:04:28', '2021-08-21 06:04:28'),
(10, 'a10@a.a', 'a10', 'sophia10', 'photo_sticke_02', 900000010, '2021-08-10', '一般會員', '香港太平山山頂', '民生店', '松山店', 0, '2021-08-21 06:04:28', '2021-08-21 06:04:28');

-- --------------------------------------------------------

--
-- 資料表結構 `users_coupon`
--

CREATE TABLE `users_coupon` (
  `user_id` int(11) NOT NULL COMMENT '會員編號',
  `code` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '優惠券代碼',
  `isUsed` tinyint(1) NOT NULL COMMENT '是否被使用(0:無;1:有)',
  `content` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '優惠券內容',
  `discount_func` varchar(11) NOT NULL COMMENT '折價方式(percentage/point)',
  `discount` float NOT NULL COMMENT '折扣',
  `deadline` date DEFAULT NULL COMMENT '使用期限',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT '新增時間',
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `users_coupon`
--

INSERT INTO `users_coupon` (`user_id`, `code`, `isUsed`, `content`, `discount_func`, `discount`, `deadline`, `created_at`, `updated_at`) VALUES
(1, 'code90', 1, '九折', 'percentage', 0.9, '0000-00-00', '2021-08-21 06:20:33', '2021-08-21 06:20:33'),
(2, 'code100', 0, '折價100元', 'point', 100, '0000-00-00', '2021-08-21 06:20:33', '2021-08-21 06:20:33'),
(3, 'code90', 1, '九折', 'percentage', 0.9, '0000-00-00', '2021-08-21 06:20:33', '2021-08-21 06:20:33'),
(4, 'code100', 0, '折價100元', 'point', 100, '0000-00-00', '2021-08-21 06:20:33', '2021-08-21 06:20:33'),
(5, 'code90', 1, '九折', 'percentage', 0.9, '0000-00-00', '2021-08-21 06:20:33', '2021-08-21 06:20:33'),
(6, 'code100', 0, '折價100元', 'point', 100, '0000-00-00', '2021-08-21 06:20:33', '2021-08-21 06:20:33'),
(7, 'code90', 1, '九折', 'percentage', 0.9, '0000-00-00', '2021-08-21 06:20:33', '2021-08-21 06:20:33'),
(8, 'code100', 0, '折價100元', 'point', 100, '0000-00-00', '2021-08-21 06:20:33', '2021-08-21 06:20:33'),
(9, 'code90', 1, '九折', 'percentage', 0.9, '0000-00-00', '2021-08-21 06:20:33', '2021-08-21 06:20:33'),
(10, 'code100', 0, '折價100元', 'point', 100, '0000-00-00', '2021-08-21 06:20:33', '2021-08-21 06:20:33');

-- --------------------------------------------------------

--
-- 資料表結構 `users_follow`
--

CREATE TABLE `users_follow` (
  `user_id` int(11) NOT NULL COMMENT '會員編號',
  `prod_id` int(11) NOT NULL COMMENT '商品編號',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT '新增時間',
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- 資料表結構 `users_order`
--

CREATE TABLE `users_order` (
  `user_id` int(11) NOT NULL COMMENT '會員編號',
  `order_id` varchar(13) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '訂單編號',
  `email` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '會員信箱',
  `transport_area` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '運送地區',
  `transport_type` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '運送方式',
  `transport_payment` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '付款方式',
  `transport_arrival_time` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '送達時間',
  `recipient_email` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '收件者 E-mail',
  `recipient_name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '收件者姓名',
  `recipient_phone_number` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '收件者手機號碼',
  `recipient_address` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '收件者地址',
  `recipient_comments` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '收件者備註',
  `invoice_type` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '發票類型',
  `invoice_carrier` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '發票載具',
  `invoice_carrier_number` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '發票載具編號',
  `coupon_code` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '優惠券代碼',
  `card_number` varchar(16) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '信用卡號碼',
  `card_valid_date` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '信用卡到期年限',
  `card_ccv` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '信用卡CCV',
  `card_holder` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '信用卡持有人',
  `total` int(11) DEFAULT NULL COMMENT '總額',
  `total_m` int(11) DEFAULT NULL COMMENT '優惠後總額',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT '新增時間',
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `users_order`
--

INSERT INTO `users_order` (`user_id`, `order_id`, `email`, `transport_area`, `transport_type`, `transport_payment`, `transport_arrival_time`, `recipient_email`, `recipient_name`, `recipient_phone_number`, `recipient_address`, `recipient_comments`, `invoice_type`, `invoice_carrier`, `invoice_carrier_number`, `coupon_code`, `card_number`, `card_valid_date`, `card_ccv`, `card_holder`, `total`, `total_m`, `created_at`, `updated_at`) VALUES
(1, 'b001', 'a1@a.a', '台北', '宅配', '信用卡', '2021/09/03', 'a1@a.a', 'sophia01', '0900000001', '台北市大安區復興南路一段390號2樓', '請讓單身的外送員來送', '實體發票', '隨包裹寄出', 'null', 'code90', '0000000000000000', '21/09', '093', 'sophia01', 99999, 9000, '2021-08-21 06:41:50', '2021-08-21 06:41:50'),
(2, 'b002', 'a2@a.a', '香港', '宅配', '信用卡', '2021/09/03', 'a2@a.a', 'sophia02', '0900000002', '香港太平山山頂', '請讓單身的外送員來送', '載具', '手機載具', 'aa-0002', 'code100', '1111111111111111', '21/09', '093', 'sophia02', 6666, 6000, '2021-08-21 06:41:50', '2021-08-21 06:41:50'),
(3, 'b003', 'a3@a.a', '台北', '超商取貨', '信用卡', '2021/09/03', 'a3@a.a', 'sophia03', '0900000003', '台北市大安區復興南路一段390號2樓', '請讓單身的外送員來送', '實體發票', '隨包裹寄出', 'null', 'code90', '1111111111111111', '21/09', '093', 'sophia03', 6666, 6000, '2021-08-21 06:41:50', '2021-08-21 06:41:50'),
(4, 'b004', 'a4@a.a', '香港', '宅配', '信用卡', '2021/09/03', 'a4@a.a', 'sophia04', '0900000004', '香港太平山山頂', '請讓單身的外送員來送', '載具', '手機載具', 'aa-0004', 'code100', '2222222222222222', '21/09', '093', 'sophia04', 6666, 6000, '2021-08-21 06:41:50', '2021-08-21 06:41:50'),
(5, 'b005', 'a5@a.a', '台北', '超商取貨', '信用卡', '2021/09/03', 'a5@a.a', 'sophia05', '0900000005', '台北市大安區復興南路一段390號2樓', '請讓單身的外送員來送', '實體發票', '隨包裹寄出', 'null', 'code90', '2222222222222222', '21/09', '093', 'sophia05', 6666, 6000, '2021-08-21 06:41:50', '2021-08-21 06:41:50'),
(6, 'b006', 'a6@a.a', '香港', '宅配', '信用卡', '2021/09/03', 'a6@a.a', 'sophia06', '0900000006', '香港太平山山頂', '請讓單身的外送員來送', '載具', '手機載具', 'aa-0006', 'code100', '6666666666666666', '21/09', '093', 'sophia06', 6666, 6000, '2021-08-21 06:41:50', '2021-08-21 06:41:50'),
(7, 'b007', 'a7@a.a', '台北', '超商取貨', '信用卡', '2021/09/03', 'a7@a.a', 'sophia07', '0900000007', '台北市大安區復興南路一段390號2樓', '請讓單身的外送員來送', '實體發票', '隨包裹寄出', 'null', 'code90', '7777777777777777', '21/09', '093', 'sophia07', 6666, 6000, '2021-08-21 06:41:50', '2021-08-21 06:41:50'),
(8, 'b008', 'a8@a.a', '香港', '宅配', '信用卡', '2021/09/03', 'a8@a.a', 'sophia08', '0900000008', '香港太平山山頂', '請讓單身的外送員來送', '載具', '手機載具', 'aa-0008', 'code100', '8888888888888888', '21/09', '093', 'sophia08', 6666, 6000, '2021-08-21 06:41:50', '2021-08-21 06:41:50'),
(9, 'b009', 'a9@a.a', '台北', '超商取貨', '信用卡', '2021/09/03', 'a9@a.a', 'sophia09', '0900000009', '台北市大安區復興南路一段390號2樓', '請讓單身的外送員來送', '實體發票', '隨包裹寄出', 'null', 'code90', '9999999999999999', '21/09', '093', 'sophia09', 6666, 6000, '2021-08-21 06:41:50', '2021-08-21 06:41:50'),
(10, 'b010', 'a10@a.a', '香港', '宅配', '信用卡', '2021/09/03', 'a10@a.a', 'sophia10', '0900000010', '香港太平山山頂', '請讓單身的男外送員來送', '載具', '手機載具', 'aa-0010', 'code100', '0000000000000000', '27/01', '183', 'sophia10', 6666, 6000, '2021-08-21 06:41:50', '2021-08-21 06:41:50');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `articles`
--
ALTER TABLE `articles`
  ADD PRIMARY KEY (`arti_id`);

--
-- 資料表索引 `brands`
--
ALTER TABLE `brands`
  ADD PRIMARY KEY (`brand_id`);

--
-- 資料表索引 `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`cate_id`);

--
-- 資料表索引 `orders_detail`
--
ALTER TABLE `orders_detail`
  ADD PRIMARY KEY (`order_id`,`prod_id`);

--
-- 資料表索引 `orders_rate`
--
ALTER TABLE `orders_rate`
  ADD PRIMARY KEY (`order_id`,`prod_id`);

--
-- 資料表索引 `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`prod_id`);

--
-- 資料表索引 `products_choice`
--
ALTER TABLE `products_choice`
  ADD PRIMARY KEY (`choi_id`);

--
-- 資料表索引 `products_img`
--
ALTER TABLE `products_img`
  ADD PRIMARY KEY (`img_id`);

--
-- 資料表索引 `products_specification`
--
ALTER TABLE `products_specification`
  ADD PRIMARY KEY (`prod_id`,`specific_id`);

--
-- 資料表索引 `rate_item`
--
ALTER TABLE `rate_item`
  ADD PRIMARY KEY (`cate_id`);

--
-- 資料表索引 `specification_item`
--
ALTER TABLE `specification_item`
  ADD PRIMARY KEY (`cate_id`);

--
-- 資料表索引 `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`user_id`);

--
-- 資料表索引 `users_coupon`
--
ALTER TABLE `users_coupon`
  ADD PRIMARY KEY (`user_id`,`code`);

--
-- 資料表索引 `users_follow`
--
ALTER TABLE `users_follow`
  ADD PRIMARY KEY (`user_id`,`prod_id`);

--
-- 資料表索引 `users_order`
--
ALTER TABLE `users_order`
  ADD PRIMARY KEY (`user_id`),
  ADD UNIQUE KEY `order_id` (`order_id`) USING BTREE;

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `articles`
--
ALTER TABLE `articles`
  MODIFY `arti_id` int(11) NOT NULL AUTO_INCREMENT COMMENT '文章編號', AUTO_INCREMENT=9923;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `brands`
--
ALTER TABLE `brands`
  MODIFY `brand_id` int(11) NOT NULL AUTO_INCREMENT COMMENT '品牌編號', AUTO_INCREMENT=8885;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `categories`
--
ALTER TABLE `categories`
  MODIFY `cate_id` int(11) NOT NULL AUTO_INCREMENT COMMENT '類別編號', AUTO_INCREMENT=25;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `products`
--
ALTER TABLE `products`
  MODIFY `prod_id` int(11) NOT NULL AUTO_INCREMENT COMMENT '商品編號', AUTO_INCREMENT=2407;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `products_choice`
--
ALTER TABLE `products_choice`
  MODIFY `choi_id` int(11) NOT NULL AUTO_INCREMENT COMMENT '商品可選擇編號';

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `products_img`
--
ALTER TABLE `products_img`
  MODIFY `img_id` int(11) NOT NULL AUTO_INCREMENT COMMENT '商品圖編號';

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `users`
--
ALTER TABLE `users`
  MODIFY `user_id` int(11) NOT NULL AUTO_INCREMENT COMMENT '會員編號', AUTO_INCREMENT=11;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `users_order`
--
ALTER TABLE `users_order`
  MODIFY `user_id` int(11) NOT NULL AUTO_INCREMENT COMMENT '會員編號', AUTO_INCREMENT=11;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
