-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2021-08-21 14:46:01
-- 伺服器版本： 10.4.20-MariaDB
-- PHP 版本： 8.0.8

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫: `techit_origin`
--

-- --------------------------------------------------------

--
-- 資料表結構 `products_ver2`
--

CREATE TABLE `products_ver2` (
  `prod_id` int(11) NOT NULL COMMENT '商品編號',
  `prod_name` varchar(100) DEFAULT NULL COMMENT '商品名稱',
  `prod_thumbnail` varchar(255) DEFAULT NULL COMMENT '商品縮圖',
  `prod_image` varchar(255) DEFAULT NULL COMMENT '商品主要圖片',
  `prod_price` int(11) DEFAULT NULL COMMENT '商品價格',
  `prod_type` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '商品型號',
  `prod_size` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '商品尺寸',
  `prod_description` varchar(255) DEFAULT NULL COMMENT '商品描述',
  `prod_discount` varchar(16) DEFAULT NULL COMMENT '優惠標示',
  `cate_id` int(11) DEFAULT NULL COMMENT '類別編號',
  `cate_id_set` varchar(100) DEFAULT NULL COMMENT '類別編號集合',
  `brand_id` int(11) DEFAULT NULL COMMENT '品牌編號',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT '新增時間',
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `products_ver2`
--

INSERT INTO `products_ver2` (`prod_id`, `prod_name`, `prod_thumbnail`, `prod_image`, `prod_price`, `prod_type`, `prod_size`, `prod_description`, `prod_discount`, `cate_id`, `cate_id_set`, `brand_id`, `created_at`, `updated_at`) VALUES
(301, '石頭掃地機器人 S6 MaxV', ' 0301.png', NULL, 17999, 'S6 MaxV', ' 353mm * 350mm *96.5mm', '全球首創：AI雙鏡頭避障\n 搭載全球首創8核CPU\n 業界最強吸力2500PA\n 即時視訊連線，單向聲音傳輸\n 300g仿真人加壓拖地\n 500萬相素雙鏡頭，立體視覺有效避障\n 297ml恆壓電控大水箱\n 智能AI斷點續掃、APP記憶地圖多達4層樓', NULL, 3, '1,3', 8857, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(302, '石頭掃地機器人二代 S6 Pure', ' 0302.png', NULL, 12999, 'S6 Pure', ' 353mm * 350mm *96.5mm', '延續旗艦Roborock S6功能三大優勢新進化\n 電量管家，自動回充至清掃剩餘面積之電量\n 180 ml 大水箱， 2 段式水量調節\n 地圖記憶達 4 個樓層，透天厝也不怕\n 支援小米AI音箱、Alexa、Google home\n 續航力 2.5 小時，單次清掃 可達75 坪\n 釐米級雷射掃描，98% 地圖精準度\n 手機APP自選掃區，智慧個人化遠端操控', NULL, 3, '1,3', 8857, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(303, 'A10s 掃地/拖地 雷射兩用機器人', ' 0303.png', NULL, 9680, 'A10s', ' 330mm * 320mm *95mm', '\"拖地最乾淨：3段電控出水+每分1200下強力3D振動水箱\n 吸力最兇猛：2500pa離心氣旋＋噴射濾網\n 音量最小：45分貝運轉音量\n 清潔最方便：快拆邊刷與不纏繞膠刷\n 規劃最詳盡：分房間、分樓層、打掃區、禁掃區、地毯區、虛擬牆、斷點續掃\n 操作最方便：APP、實體遙控器，雙管齊下\n 語音助理：Google、Alexa\"', NULL, 3, '1,3', 8837, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(304, 'W400 洗地機器人', ' 0304.png', NULL, 9080, 'W400', ' 282mm * 292mm *118mm', 'W400ILIFE W400 重新設計了『噴』、『刷』、『吸』、『刮』四種循環流程，真正有效拔除地板髒汙，同時是全市場唯一的『髒汙水箱分離』設計，也真正讓你用乾淨的水清潔地板，達到更乾淨、更省力的清潔效果。', NULL, 3, '1,3', 8837, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(305, 'Roomba s9+ 掃地機器人', ' 0305.png', NULL, 56880, 'Roomba s9+', ' 310mm * 310mm *89mm', 'WiFi+APP+每日預約定時功能\n 專利第三代PLUS加長30%塑膠滾筒雙主刷+五腳角刷\n 沒電自動返航+回充續掃+自動倒垃圾\n 髒汙偵測+定點打掃\n 雙功能虛擬牆/APP虛擬禁止區\n 吸力增加40倍,掃地能力再升級\n 高效過濾網+可水洗集塵盒\n 智慧地圖+客製化清掃區域+串聯技術(Braava Jet m6)\n D型設計,邊角一網打盡', NULL, 3, '1,3', 8841, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(306, 'Roomba i7 掃地機器人', ' 0306.png', NULL, 29880, 'Roomba i7', ' 340mm * 93mm', 'WiFi+APP+每日預約定時功能\n 專利第三代塑膠滾筒雙主刷\n 沒電自動返航+回充續掃\n 髒汙偵測+定點打掃\n 雙功能虛擬牆/APP虛擬禁止區\n 吸力增加10倍,掃地能力再升級\n 高效過濾網+可水洗集塵盒\n 智慧地圖+客製化清掃區域+串聯技術(Braava Jet m6)', NULL, 3, '1,3', 8841, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(307, 'Roomba 960 掃地機器人', ' 0307.png', NULL, 19880, 'Roomba 960', ' 353mm * 92mm', 'WiFi+APP+每日預約定時功能\n 專利第二代塑膠滾筒雙主刷\n 沒電自動返航+回充續掃\n 髒汙偵測+定點打掃\n 雙功能虛擬牆\n 吸力增加5倍,掃地能力增加1.5倍\n 高效過濾網\n 視覺導航+三種清潔路徑選擇+串聯技術(Braava Jet m6)', NULL, 3, '1,3', 8841, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(308, 'Roomba e5 掃地機器人', ' 0308.png', NULL, 56880, 'Roomba e5', ' 353mm * 92mm', 'WiFi+APP+每日預約定時功能\n 專利第三代塑膠滾筒雙主刷\n 沒電自動返航+回充續掃 ■髒汙偵測+定點打掃\n 雙功能虛擬牆\n 吸力增加5倍,掃地能力增加1.5倍\n 高效過濾網\n 可水洗集塵盒', NULL, 3, '1,3', 8841, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(309, 'PURE i9.2 2020年新一代機器人PI92-6DGM', ' 0309.png', NULL, 18888, 'PI92-6DGM', ' 460mm * 350mm *110mm', '互動式地圖規畫，一指選定區域打掃。\n3D Vision 超視能科技，不碰撞、不纏繞、不受困。\n三角外型及立體八爪邊刷 深入清潔死角。', NULL, 3, '1,3', 8825, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(310, 'PURE i9.2新一代型動機器人PI92-6STN', ' 0310.png', NULL, 26900, 'PI92-6STN', ' 300mm * 60mm', '全球專利3D立體視覺科技\n三角型動設計，角落清潔力最強\n互動式地圖功能，一指選定區域打掃', NULL, 3, '1,3', 8825, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(311, 'D7 雷射掃描掃地機器人吸塵器', ' 0311.png', NULL, 19900, 'D7', ' 350mm * 94.5mm', '可連結微信 Wechat、亞馬遜 Alexa 遠端遙控\n區域清掃功能，輕鬆劃分多空間清掃\n專利雷射掃描自動認路/分區/返航\n地圖顯示清掃範圍，一目瞭然\nAPP WiFi遠端啟動/暫停/定時清掃\nAPP 設定虛擬禁止通行線\n手動APP遙控吸塵器\nECO與MAX兩種吸力供選擇\n自動回充續掃功能\n貼牆滾刷+邊刷加強牆角清掃\n緩衝防撞/階梯防掉落感應', NULL, 3, '1,3', 8853, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(312, 'N9+自動回洗掃拖一體智能機器人', ' 0312.png', NULL, 17900, 'N9+', ' 350mm * 350mm *81.5mm', '髒抹布自動回洗，保持拖布潔淨\n掃吸拖洗一次完成，一機抵多機\n旋轉加壓擦地，搞定頑漬汙垢', NULL, 3, '1,3', 8824, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(313, 'DEEBOT T8超智能掃地機器人', ' 0313.png', NULL, 13999, 'DEEBOT T8', ' 350mm * 350mm *82mm', 'dTof導航，精準快速建圖\n仿電動牙刷擦地模式，細緻而乾淨\n微塵級清潔，吸塵率高達93%', NULL, 3, '1,3', 8824, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(314, 'DEEBOT T8 AIVI', ' 0314.png', NULL, 17999, 'DEEBOT T8 AIVI', ' 340mm * 93mm', 'dTof導航，精準快速建圖\n仿電動牙刷擦地模式，細緻而乾淨\n微塵級清潔，吸塵率高達93%', NULL, 3, '1,3', 8824, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(315, 'L70雷射導航掃地拖地機器人(白)T2190', ' 0315.png', NULL, 15900, 'T2190', ' 300mm * 60mm', '掃拖合一/輕易越障/強勁吸力\n雷射導航/斷點續掃/不跌落\nAPP&語音控制，只清潔不搗亂', NULL, 3, '1,3', 8830, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(316, 'G10智慧動能導航掃地拖地機器人(黑) T2150', ' 0316.png', NULL, 7900, 'T2150', ' 340mm * 93mm', '掃拖合一/纖薄機身/強勁吸力\n陀螺儀導航/斷點續掃/不跌落\nAPP&語音控制，只清潔不搗亂', NULL, 3, '1,3', 8830, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(317, '超薄濕拖 智慧掃地機器人FC8796/31', ' 0317.png', NULL, 7500, 'FC8796/31', ' 460mm * 350mm *110mm', '\"5.8cm超薄,輕鬆清潔傢俱底部\n 濕拖纖維布拖板,更易清潔微塵及污漬\n EPA12濾網,提供更出色的過濾效果\n 6組紅外線感測器,探測更靈敏\n 5組防跌落感測器,全方位保護\n 24h提前規劃清掃行程\"', NULL, 3, '1,3', 8856, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(318, '智能掃地機器人FC8776/31', ' 0318.png', NULL, 16800, 'FC8776/31', ' 300mm * 60mm', '機身僅6公分、清潔無障礙\n智能感應器19顆\n自動回充、鋰電池、低噪音\n最高可連續使用130分鐘\n四種智慧清潔模式\n紅外線遙控器', NULL, 3, '1,3', 8856, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(319, '米家 二合一掃拖機器人2代 掃地機器人 雷射偵測導航版', ' 0319.png', NULL, 8990, 'STY902YM', ' 152mm * 74.6mm *99.5mm', '智能電控水箱 保護木質地板\n2100Pa大吸力 清掃更徹底\n全新升級LDS雷射導引 地圖更準確', NULL, 3, '1,3', 8875, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(320, '米家掃拖機器人1C(白)', ' 0330.png', NULL, 5295, 'HJSTC1', ' 353mm * 350mm * 81.5mm', '視覺動態\n地圖構建\n智慧電控水箱\n2500Pa超大吸力', NULL, 3, '1,3', 8875, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(321, '米家 掃拖機器人(G1)', ' 0321.png', NULL, 4995, 'HJSTG1', ' 355mm * 355mm', '四段吸力\n三重過瀘系統\n8.2cm超薄機身', NULL, 3, '1,3', 8875, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(401, '全功能智慧烹飪機', ' 0401.png', NULL, 2980, '全功能智慧烹飪機', ' 314x368x315', 'null', NULL, 4, '1,4', 8862, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(402, 'IH智能翻炒鍋(EL19008)', ' 0402.png', NULL, 12990, 'EL19008', ' 28.7cm x 寬36.9cm x 高27.7cm', 'null', NULL, 4, '1,4', 8823, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(403, '九陽炒菜機器人A1', ' 0403.png', NULL, 16088, 'A1', ' 33.5cm x 28.5cm x 28.5cm', 'null', NULL, 4, '1,4', 8874, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(404, 'MU全自動炒菜機‧IH爐智能機器人', ' 0404.png', NULL, 19000, 'MU全自動炒菜機‧IH爐智能機器人', ' null', 'null', NULL, 4, '1,4', 8850, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(405, '全自動炒菜機', ' 0405.png', NULL, 6080, '全自動炒菜機', ' null', 'null', NULL, 4, '1,4', 8831, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(406, 'Solista 獨奏智能炒菜機', ' 0406.png', NULL, 4400, 'Solista 獨奏智能炒菜機', ' null', 'null', NULL, 4, '1,4', 8875, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(407, 'PY18-X2/X1S炒菜機機器人', ' 0407.png', NULL, 7281, 'PY18-X2/X1S炒菜機機器人', ' null', 'null', NULL, 4, '1,4', 8848, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(408, '飯來F1S 烹飪機器人', ' 0408.png', NULL, 8900, '飯來F1S 烹飪機器人', ' null', 'null', NULL, 4, '1,4', 8875, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(501, '主控機器人+開關機器人(套組)', ' 0501.png', NULL, 4690, '主控機器人+開關機器人(套組)', ' null', '13 種家電4000 品牌\n360 度無死角控制\n​定時聲控一手包\n使用距離無上限', NULL, 5, '1,5', 8865, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(502, 'EQL Qubi Robot', ' 0502.png', NULL, 11000, 'EQL Qubi Robot', ' null', 'SLAM 智能演算技術\n多重清掃模式\nApp 手繪虛擬牆\n自動返回充電\n遠端控制\n語音提示\n智慧感測系統\nOTA 技術', NULL, 5, '1,5', 8828, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(503, '公子小白Pro', ' 0503.png', NULL, 8594, '公子小白Pro', ' 170mm *170mm *260mm', '擁有即插即用（可控制空調、檯燈、麵包機、電水壺、冰箱、電視機、電飯鍋、吸塵器、電風扇、暖氣等）\n語音控制\nAPP遠程控制\n定時開關\n日常功能：語音調教、調教功能、自定義問答、音樂鬧鐘、日程提醒、天氣預報、聲控拍照、有聲讀物、音樂、故事、評論戲曲、算算術、背誦詩詞、成語接龍、知識百科等', NULL, 5, '1,5', 8879, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(504, '公子小白成长版Ⅱ', ' 0504.png', NULL, 5729, '公子小白成长版Ⅱ', ' 170mm *170mm *260mm', '講故事（1000+故事資源）\n音樂播放（卡通音樂，中英兒歌，睡眠音樂，流行歌曲）\n人機對話\n定時提醒（語音提醒），日程提醒，節日提醒，鬧鐘提醒\n自我學習能力\n呆萌表情', NULL, 5, '1,5', 8879, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(505, '公子小白成长版', ' 0505.png', NULL, 3433, '公子小白成长版', ' 170mm *170mm *260mm', '擁有語音聊天、講故事、播音樂、成語接龍、腦筋急轉彎、繞口令、冷知識、猜謎語、親情微聊、藍牙音箱、知識百科、詩詞國學、快樂算術、小學同步教材、中譯英、英語口語評測、起床鬧鐘、天氣預報、日程提醒等功能', NULL, 5, '1,5', 8879, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(506, 'Olly', ' 0506.png', NULL, 1225, 'Olly', ' 200mm * 160mm * 250 mm', '能夠透過內建的四個麥克風和臉部偵測系統，收集使用者的表情、語調、嘴部動作等，去辨識當下的情感\n可以連結各種 app，如網路電台、社群媒體和電子郵件', NULL, 5, '1,5', 8826, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(601, 'Ers-1000 ERS 1000 aibo寵物機器狗', ' 0601.png', NULL, 159999, 'Ers-1000 ERS 1000', ' 350mm * 350mm *82mm', '緊湊的機身提供22個自由軸（關節），以實現平穩的車身驅動。 眼睛內中採用兩個OLED，並巧妙地表達各種情感。 \n通過獨特的AI技術了解與所有者的互動，其中主體和雲端合作並親自發展。 可收集數據，甚至更智能', NULL, 6, '1,6', 8864, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(602, '小狗探險隊', ' 0602.png', NULL, 1522, '小狗探險隊', ' 180 * 293 * 305 mm', '培養孩子策略思考、邏輯判斷\n遊戲中學會團隊合作與溝通與討論\n加深視覺空間概念與方向辨識', NULL, 6, '1,6', 8843, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(603, 'Lovot', ' 0603.png', NULL, 76154, 'Lovot', ' 180 * 190 * 200 mm', '可分辨人類的聲音、動作\n家居保安功能\n低電量時自動返回充電座', NULL, 6, '1,6', 8833, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(604, 'DC13991 互動式機器人', ' 0604.png', NULL, 1299, 'DC1399', ' 140mm * 160mm * 90 mm', '互動功能\n陪伴與辨識功能', NULL, 6, '1,6', 8818, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(605, 'XLNB Intelligent Dance Robot Dog', ' 0605.png', NULL, 1531, 'XLNB Intelligent Dance Robot D', ' null', 'null', NULL, 6, '1,6', 8872, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(606, 'Tapia', ' 0606.png', NULL, 40525, 'Protecting Life Support Humano', ' null', 'null', NULL, 6, '1,6', 8820, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(607, 'Toyota Kirobo Mini', ' 0607.png', NULL, 10948, 'Toyota Kirobo Mini', ' null', 'null', NULL, 6, '1,6', 8869, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1201, '智慧萬用鍋 (HD2133)', ' 1201.png', NULL, 2888, 'HD2133', ' 314x368x315', '蒸、煮、燉、滷、無水烹調五大烹飪功能\n■16種智慧化自動烹飪設定\n■特殊無水烹調功能\n■人性化24小時預約/12小時保溫功能，隨時享受美食\n■可拆洗式內蓋，易於清洗\n■ 9 道安全控壓控溫保護裝置，確認烹調安全無虞', NULL, 12, '2,7,12', 8856, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1202, '迷你智能溫控舒肥萬用鍋/壓力鍋', ' 1202.png', NULL, 2990, 'CY625170', ' 287x 369x 277', '陶晶球釜62度黃金雙對流角\n舒肥,燉,煎,煮,炒,烘烤\n18道安全機制 使用好安心', NULL, 12, '2,7,12', 8867, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1203, '雙重脈衝智慧萬用鍋(金小萬) HD2195', ' 1203.png', NULL, 12900, 'HD2195', ' 335 x 285 x 285', '飛利浦雙重脈衝智慧萬用鍋，能深度釋放營養，煮出食物深層精華，讓摯愛家人，天天享用最美味的營養', NULL, 12, '2,7,12', 8856, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1204, '電子壓力鍋 PC-MA2W', ' 1204.png', NULL, 4999, 'PC-MA2W', ' 324x318x316', '針對亞洲人的烹調習慣所設計，有低壓、高壓與超高壓等3階段模式讓您能根據不同食譜做細膩的火候控制以及易於開闔的鍋蓋設計等，各種基本需求一次滿足。', NULL, 12, '2,7,12', 8839, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1205, '微電腦6L壓力快鍋萬用鍋IEC-610', ' 1205.png', NULL, 2480, 'IEC-610', ' 367x 319x 228', '這台壓力鍋予人極高的自由度。既提供內建的65種調理選項，還可以切換成手動模式，不論是改良食譜中的料理，或是嘗試完全原創的菜色都能在此鍋上完成。\n\n', NULL, 12, '2,7,12', 8838, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1206, '智慧型萬用壓力鍋-6.0L CW-6101', ' 1206.png', NULL, 2480, 'CW-6101', ' 330 x 200 x 265', '這款電子壓力鍋的功能性有平均以上水準，且可供手動調整烹調時的壓力，可調段數也偏多，能配合不同料理方式、食材做出屬於個人的獨到口味。而在調理評比中，由它所烹煮的紅燒魚和法式燉菜湯兩道表現均佳，細小的魚骨、葉菜的纖維都完全軟化，醬汁和湯汁的味道也濃郁醇厚。', NULL, 12, '2,7,12', 8816, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1207, '智慧型微電腦萬用壓力鍋-6L CW-6112W', ' 1207.png', NULL, 2280, 'CW-6112W', ' 326x328x314', '國際牌推出的這款電子壓力鍋搭載4種調理模式，包含基本的悶蒸與加壓，並對應無水調理及健康湯品兩種，應用方式相當廣泛。而且它的操作介面簡單，但又能提供細膩的時間設定，螢幕上還有指示箭頭提醒使用者目前進行的操作為何，大大減少失誤的可能。', NULL, 12, '2,7,12', 8816, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1208, '5L電氣壓力鍋 SR-PG501-', ' 1208.png', NULL, 6220, 'SR-PG501', ' 257x 359x 259', '不但能調整壓力段數，也可將壓力完全取消，回歸最傳統的燉煮方式。面板還是採用旋鈕調節，食譜選項又精簡，因此從設定到開始烹調的過程相當流暢，易用性獲得評比團隊肯定。', NULL, 12, '2,7,12', 8855, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1301, '32公升微電腦變頻微波爐 NN-ST65', ' 1301.png', NULL, 5480, 'NN-ST65', ' null', 'null', NULL, 13, '2,7,13', 8855, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1302, '20L微電腦蒸氣烘烤爐 NU-SC180B', ' 1302.png', NULL, 11610, 'NU-SC180B', ' null', 'null', NULL, 13, '2,7,13', 8855, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1303, '過熱水蒸氣烘烤微波爐 MROVS700T', ' 1303.png', NULL, 15210, 'MROVS700T', ' null', 'null', NULL, 13, '2,7,13', 8835, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1304, '25L微電腦微波爐 R-T25KS(W)', ' 1304.png', NULL, 2990, 'R-T25KS(W)', ' null', 'null', NULL, 13, '2,7,13', 8860, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1305, '過熱水蒸氣烘焙微波爐 MRONBK5000T', ' 1305.png', NULL, 39510, 'MRONBK5000T', ' null', 'null', NULL, 13, '2,7,13', 8835, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1306, '20L微電腦鏡面微波爐 WMWE200S', ' 1306.png', NULL, 2790, 'WMWE200S', ' null', 'null', NULL, 13, '2,7,13', 8871, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1307, '32L獨立式萬用蒸烤箱WSO3200B', ' 1307.png', NULL, 16900, 'WSO3200B', ' null', 'null', NULL, 13, '2,7,13', 8871, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1308, '米家智能空氣炸鍋', ' 1308.png', NULL, 1895, '米家智能空氣炸鍋', ' null', 'null', NULL, 13, '2,7,13', 8876, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1309, '米家智能蒸氣小烤箱', ' 1309.png', NULL, 2590, '米家智能蒸氣小烤箱', ' null', 'null', NULL, 13, '2,7,13', 8876, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1401, '米家互聯網十字四門冰箱 486L (銀色)', ' 1401.png', NULL, 12246, '米家互聯網十字四門冰箱 486L', ' null', 'null', NULL, 14, '2,7,14', 8876, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1402, '米家互聯網對開門冰箱 540L (深灰)', ' 1402.png', NULL, 11602, '米家互聯網對開門冰箱 540L', ' null', 'null', NULL, 14, '2,7,14', 8876, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1403, '米家互聯網對開門冰箱450L (白色)', ' 1403.png', NULL, 11172, '米家互聯網對開門冰箱450L', ' null', 'null', NULL, 14, '2,7,14', 8876, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1404, 'RT62 雙循環雙門系列 623L 不鏽鋼時尚銀', ' 1404.png', NULL, 33800, 'RT62 雙循環雙門系列', ' null', 'null', NULL, 14, '2,7,14', 8859, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1405, 'RT43 雙循環雙門系列 443L 時尚銀', ' 1405.png', NULL, 23900, 'RT43 雙循環雙門系列', ' null', 'null', NULL, 14, '2,7,14', 8859, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1406, 'RT32 雙循環雙門系列 323L 奢華棕', ' 1406.png', NULL, 20400, 'RT32 雙循環雙門系列', ' null', 'null', NULL, 14, '2,7,14', 8859, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1501, '【Philips 飛利浦-智能鎖】 9300 IOT遠端全自動智能電子鎖', ' 1501.png', NULL, 36000, '9300 IOT', ' 422x756x52', '適合用於管理各種小型出租場地如套房、\n民宿、演講室等，可在租借者付費後配發電子鑰匙，\n省去人事費用。', NULL, 15, '2,8,15', 8856, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1502, 'SHS-H505台灣專用極簡精美款', ' 1502.png', NULL, 15999, 'SHS-H505', ' 81 x 302 x 66 ', '為三星專為台灣氣候設計的防潮專用機種，\n表面與內部經過加強防潮處理，讓機體更加耐用。\n開鎖可以設定密碼、感應卡或原廠感應吊飾開門；\n而三星獨家專利的動態隨機密碼系統，\n在按下密碼前需要先解除隨機亮起的數字後才能啟用\n降低透過殘留指紋被破解密碼的風險。', NULL, 15, '2,8,15', 8859, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1503, 'SHS-P718(金色)/SHP-DH537(古銅色)', ' 1503.png', NULL, 18900, 'SHS-P718', ' 818 x320 x 668 ', '這款智慧所的鎖頭可以直接裝在門框表面，無須內嵌於喇叭鎖孔或原鎖孔，因此厚度較薄的拉門也能安裝。外鎖處增加了紅外線偵測防盜功能，偵測到有人靠近並同時按下開門按鈕才會開門，可防止誤觸或非正常操作造成解鎖。們鎖卡榫採用雙倒勾設計，可防止小偷利用工具撥動機關解鎖。', NULL, 15, '2,8,15', 8859, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1504, 'DP850指紋/卡片/密碼/鑰匙/藍芽一鍵推拉式智慧電子鎖（金/銀）', ' 1504.png', NULL, 22000, 'DP850', ' 42x9x23', '智慧所內建中文語音提示的功能，不需說明書也能輕鬆完成設定，方便隨時自行調整出入權限和指紋登記。可同時認證20組指紋與30組密碼，除了一搬家用也可應用於中小型辦公室。', NULL, 15, '2,8,15', 8821, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1505, '智能電子鎖 ID60', ' 1505.png', NULL, 26040, 'ID60', ' 3755x755x285 ', '另附有虛位密碼功能，可以在輸入密碼時隨機在密碼前後輸入數字，減少密碼破解機率。另外由於具有遠端遙控功能，如果用於一般出租辦公室或小型飯店等等，可以節省更多管理人力。', NULL, 15, '2,8,15', 8813, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1506, '智能電子鎖 ID80', ' 1506.png', NULL, 28140, 'ID80', ' 381x80x27', 'LED 顯示螢幕可確認上鎖狀態，並有低電量安全提醒。內側有防貓眼竊盜功能，專為欄杆式的舊式鐵門設計，防止小偷意圖從外側使用鐵絲勾鎖開門。也有防惡作劇模式能適時斷電，防止無聊人士亂按門鎖取樂。', NULL, 15, '2,8,15', 8813, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1507, 'FSL-800 六合一 密碼/指紋/卡片/鑰匙/金色', ' 1507.png', NULL, 35720, 'FSL-800', ' 81x302x66', '同時支援了指紋、密碼、卡片、藍芽、鑰匙、遠端密碼等多達六種解鎖方式，讓使用者更便利；此外，不僅具備了低電量提醒，在失去電力時也能夠使用機械鑰匙開啟，或是透過外接電池緊急供應電力，不用再擔心進不了家門的情況發生。', NULL, 15, '2,8,15', 8821, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1508, 'Yale 3115A', ' 1508.png', NULL, 15888, 'Yale 3115A', ' 818 x 320 x 668', '採用熱感應式的觸碰鍵盤，讓機器不需24小時待命，以手掌接觸螢幕後才會亮起觸控鍵盤，大大延長電池壽命。專屬的APP除了可以即時遠端遙控開鎖，也能即時接收警報訊息，隨時掌握家中安全。可支援40張卡片資料，可用悠遊卡、RFID 信用卡、訂做 ID 卡等當作解鎖鑰匙。', NULL, 15, '2,8,15', 8846, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1509, 'PHILIPS 飛利浦 電子鎖/門鎖(9200)(紅古銅)', ' 1509.png', NULL, 38000, '9200', ' 81 x 302 x 66 ', '除了能夠支援所有門把種類之外，還有特殊防入侵功能；藉由內部結構的特殊設計，在外人嘗試破壞門鎖時，將會即時向手機 app 發出警報，同時也會觸發警報器聲響以嚇阻入侵者。另有緊急密碼功能，如果有外人意圖強行入侵家門，輸入緊急密碼後系統會以手機訊息通知家人，以便家人在第一時間緊急協助應變。', NULL, 15, '2,8,15', 8856, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1601, 'Tapo C210 300萬畫素', ' 1601.png', NULL, 999, 'Tapo C210', ' 866*85*1177', '3百萬畫素，廣角旋轉鏡頭\n★連續10年，全球市占率第一名的無線網路品牌\n★擁有300萬畫素高解析度，給您高清畫質\n★360º 水平旋轉，114º 垂直旋轉，超廣角的覆蓋範圍，隨時捕捉每個細節\n★紅外線夜視功能，即使在完全黑暗的環境下，也能提供高達9公尺的可視距離', NULL, 16, '2,8,16', 8870, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1602, 'Tapo C200', ' 1602.png', NULL, 799, 'Tapo C200', ' 866*85*1177', '高畫質影像: 以清晰的1080p 捕捉每一個細節。\n進階型的夜視: 即使在晚上，攝影機也可以提供高達9公尺的可視距離。\n移動偵測通知: 如果偵測到任何可疑的事件會發出通知。\n聲光警報 : 當有陌生人靠近時會可發出聲光效果達到嚇阻效果。', NULL, 16, '2,8,16', 8870, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1603, 'TP-Link Tapo C100', ' 1603.png', NULL, 649, 'TP-Link Tapo C100', ' 675*548*989', '極強夜視 資安保障\n★可在任何有無線網路的環境使用\n★高畫質影片 – 清晰1920*1080p畫質錄製所有影像\n★進階的夜視功能 - 提供可見距離高達9公尺\n★移動偵測和通知 - 通知您何時攝影機偵測到移動\n★聲音和燈光警示 - 觸發聲光效果警示可疑的陌生人', NULL, 16, '2,8,16', 8870, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1604, 'C920e', ' 1604.png', NULL, 3880, 'C920e', ' 434*93*71', '保持銳利、自動運作\n可拆卸隱私遮罩\n針對商務用途設計', NULL, 16, '2,8,16', 8847, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1605, 'Webcam MEETUP 超廣角視訊會議系統 自動對焦', ' 1605.png', NULL, 52800, 'Webcam MEETUP', ' 104*400*85', '◆ MeetUp 具有 4K 光學解析度與超廣角 120 度視野，讓會議桌的每個座位都清晰可見。\n◆ 其整合的音訊功能針對小型房間聲學環境最佳化，確保每個人的聲音影像都清晰可見可聞。\n◆ 超廣角 120° 視野', NULL, 16, '2,8,16', 8847, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1606, 'C310 HD 視訊攝影機', ' 1606.png', NULL, 945, 'C310 HD', ' 313*712*684', 'HD 720p 高品質視訊通話\n可一鍵上傳至Facebook及YouTuBe\n最高可達 五百萬畫素 照片拍攝\n實用有趣的影像軟體\n修正補光及雜訊過濾技術', NULL, 16, '2,8,16', 8847, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1701, 'Airdog X5 空氣淨化機', ' 1701.png', NULL, 49800, 'Airdog X5s', ' 30.6x31.6x65cm', '美國矽谷研發的全球最強空氣淨化器\n醫學專家精選空氣淨化器\n去除達0.0146微米，是\n病毒的六分之一流感病毒99.8%去除/細菌99.9%去除/PM2 .5 99.9%去除/ 去除甲醛99.9%\n採用美國專利TPA過濾器的過濾器\n採用塔板結構，不會造成堵塞。即使抽440支煙，性能也只會下降0.2%\n，無需更換濾芯。你可以在家裡洗。運行費用 0 日元\n30 分鐘可清潔 42 張榻榻米空間。', NULL, 17, '2,9,17', 8803, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1702, 'Dyson Pure Hot Cool Link HP03 三合一', ' 1702.png', NULL, 23900, 'Dyson Pure Hot Cool Link HP03', ' 632 x 112 x 154mm ', '淨化PM2.5，過濾髒空氣及過敏原  四季皆宜  無須收納 省空間\n★淨化99.95%的PM0.1、污染物及過敏原。\n★淨化過敏原：360度圓形濾網，淨化空氣不受角度、方向限制。\n★獨家氣流倍增技術幫助室內空氣循環、高效淨化全區空氣，乾淨空氣循環整個房間。\n★可選擇暖風功效，無季節限制，清淨空氣同時幫助室內調節溫度。', NULL, 17, '2,9,17', 8822, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1703, 'Pure Hot+Cool 三合一涼暖風扇空氣清淨機 HP04', ' 1703.png', NULL, 19900, 'Pure Hot+Cool HP04', ' 764 mm x 130 mm x 205 mm', '●可過濾PM0.1微米細懸浮微粒 達99.95%\n●四效合一：涼風+暖風+空氣清淨機+ APP智能監控 四季都不用收\n●吹送/捕捉/感應：徹底智慧淨化全室\n●360度全方位進氣： 機器任意方向擺放都可以360°全方位吸入髒空氣\n●氣流倍增科技：無需葉片，每秒可吹送出310公升的空氣，產生平穩有力的氣流，將乾淨氣流送至室內每個角落。\n●智慧監控: 連接 Bluetooth, Wi-Fi 自動監控、回應及淨化，手機 Dyson link應用程式可遙控並及時檢查清淨效能', NULL, 17, '2,9,17', 8822, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1704, '三合一涼暖智慧空氣清淨機 型號HP09 白金色', ' 1704.png', NULL, 28900, 'HP09', ' 76.4*130*20.5cm', '過濾H1N1病毒。\n偵測及持續消滅甲醛。\n濾除H1N1病毒90及99.95%超細微粒。', NULL, 17, '2,9,17', 8822, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1705, '次氯酸空氣淨化器 Viruswasher', ' 1705.png', NULL, 25124, 'SVW-AQA2000(S)', ' 370x 290x 600mm', '使用“次氯酸鹽”的空間殺菌和除臭和“高性能HEPA過濾器”的空氣淨化兩種功能來淨化室內空氣。發揮抑製作用、殺菌、除臭、集塵。三層過濾網強力收集花粉、PM2.5、屋塵等，淨化室內空氣。', NULL, 17, '2,9,17', 8861, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1706, '大金15.5坪 保濕雙重閃流空氣清淨機 MCK70VSCT-W', ' 1706.png', NULL, 19800, 'MCK70VSCT-W', ' 395x600x287mm', '獨家TAFU濾網防水、油有效防止濾網阻塞\n雙重閃流放電有效分解濾網上有害物質及異味\n主動離子有效分解空氣中細菌及過敏原\nTUFA濾網最長可用10年\n三重感知器(灰塵、PM2.5、異味)\n美肌保濕有效保持舒適環境\n強力立體3D進氣快速有效集塵\n創新垂直式設計有效降低運轉噪音\n4段風段大小、3種模式選擇\n\n', NULL, 17, '2,9,17', 8817, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1707, '12.5坪MINI閃流空氣清淨機 MC55USCT', ' 1707.png', NULL, 14800, 'MC55USCT', ' 高500X寬270X深270mm', '專利閃流放電有效分解濾網上有害物質及異味\n主動離子有效分解空氣中細菌及過敏原\n靜電HEPA濾網最長可用10年\n三重感知器(灰塵、PM2.5、異味)\n強力立體3D進氣快速有效集塵\n創新垂直式設計有效降低運轉噪音\n4段風段大小、3種模式選擇\n附遙控器', NULL, 17, '2,9,17', 8817, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1708, '觸媒&閃流除臭觸媒強力空氣清靜機MC75LSC', ' 1708.png', NULL, 13800, 'MC75LSC', ' H576×W395×D230mm', '閃流空氣清淨機具備大金引以為傲的放電科技，「閃流放電」可產生具有強效氧化的高速電子，不僅能清除細菌與黴菌，連有害化學物質與過敏原等也能一併除去，更可去除PM2.5細懸浮微粒達99.9%。因為對空氣品質的執著，大金空氣清淨機堅持做到最好。', NULL, 17, '2,9,17', 8817, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1709, '【BALMUDA】The pure 空氣清淨機(A01D-WH)', ' 1709.png', NULL, 10888, 'A01D-WH', ' 寬26 x 深26 x 高70cm', '•適用室內18坪\n•搭載TrueHEPA濾網\n•獨家的整流翼及扇葉設計\n•光柱設計-運轉狀態一目瞭然', NULL, 17, '2,9,17', 8810, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1710, 'Levoit Core 300空氣清淨機', ' 1710.png', NULL, 5540, 'Levoit Core 300', ' 長22*寬22*高41公分', '1. 榮獲2020年iF設計獎和2019年紅點設計獎。\n2. 美日熱銷機種，亞馬遜超過4顆星以上評價。\n3. 4層HEPA過濾可減少99.97％最小至0.1微米過敏原，如花粉、黴菌、病毒、灰塵、寵物毛屑、香煙及PM2.5等。\n4. 在10坪左右範圍，每1小時讓室內空氣循環5次，CADR值260立方公尺/小時，高淨化效率遠勝同階產品。\n5. 以臥室使用情境設計，最低噪音24db（約類似樹林風吹）。\n6. 以睡眠模式驅動，每小時功耗僅9W，1天24小時開啟電費約0.35元。', NULL, 17, '2,9,17', 8829, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1711, '薄型空氣清淨機 PA-301T', ' 1711.png', NULL, 11990, 'PA-301T', ' 370×130×687 MM', '強效三層過濾網\n空氣品質可視化顯示燈條\n日式極簡外型與工藝細節質感', NULL, 17, '2,9,17', 8805, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1712, '日本IRIS OHYAMA 衣服乾燥除濕機-DDD-50E', ' 1712.png', NULL, 9980, 'DDD-50E', ' 29.7×28.6×66cm', '日本IRIS衣服乾燥除濕機\n能縮短約1/5室內曬乾衣物的乾燥時間\n裝載循環器，強力速度乾燥，有效抑制濕氣及黴菌\n廣域送風、搖擺頭部功能裝載\n用50°·70°·90°的3等級，改變搖擺頭部的範圍\n一年四季都適合使用\n夜晚靜音模式，室內曬衣也不須擔心噪音', NULL, 17, '2,9,17', 8840, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1713, '空氣清淨機 PMMS-DC110', ' 1713.png', NULL, 4990, 'PMMS-DC110', ' 400*201*586(mm)', '◆ 搭載智能室內空氣品質監測器\n◆ 具備了渦輪噴氣技術，配合高成本進口靜音馬達\n◆ 三層濾網 高效淨化 立體防護', NULL, 17, '2,9,17', 8840, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1714, 'Stadler Form Roger 空氣清淨機', ' 1714.png', NULL, 9000, 'Stadler Form Roger', ' 42*50*20(cm)', '■ 德國高效能雙層濾網\n■ 結合HEPA與活性炭濾網\n■ CADR 521 m3/h\n■ 顏色顯示自動偵測空氣品質\n■ 1-7小時定時功能', NULL, 17, '2,9,17', 8827, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1715, '高效抗菌智能旗艦清淨機Pure A9(PA91-406GY 優雅灰9-14坪)', ' 1715.png', NULL, 14900, 'Pure A9 PA91-406GY', ' 長315 x 寬315 x 高590 (mm)', '◆首創獨家五角設計\n◆360度HEPA 13級抗菌濾網\n◆16超低分貝\n◆安裝獨特RFID智慧標籤\n◆大面積濾網2.7平方公尺', NULL, 17, '2,9,17', 8827, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1716, 'LEAF 320i 藍光光觸媒空氣清淨機 - 精實版(無Wi-Fi)', ' 1716.png', NULL, 19900, 'LEAF 320i', ' 寬242*高652(mm)', '榮獲德國IF設計大獎\n全方位360度潔淨空氣高速循環\n新型藍光光觸媒淨化分解病黴菌\n手機Wi-Fi遠端設定控制及偵測\n最適合13坪大小空間無接縫機身時尚尊貴優雅', NULL, 17, '2,9,17', 8815, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1717, '加濕空氣清浄機 KI-NX75', ' 1717.png', NULL, 22950, 'KI-NX75', ' 400*259*693(mm)', '適用17坪 集塵 脫臭 循環氣流 KI-HX75 KI-JX75 KI-LX75後繼 2020年式', NULL, 17, '2,9,17', 8860, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1718, '保濕雙重閃流空氣清淨機 MCK70VSCT-W', ' 1718.png', NULL, 19480, 'MCK70VSCT-W', ' 395x600x287mm', '獨家TAFU濾網防水、油有效防止濾網阻塞\n雙重閃流放電有效分解濾網上有害物質及異味\n主動離子有效分解空氣中細菌及過敏原\nTUFA濾網最長可用10年\n三重感知器(灰塵、PM2.5、異味)\n美肌保濕有效保持舒適環境\n強力立體3D進氣快速有效集塵\n創新垂直式設計有效降低運轉噪音\n4段風段大小、3種模式選擇', NULL, 17, '2,9,17', 8817, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1719, '清淨機9.5坪 (MC40USCT)', ' 1719.png', NULL, 9800, 'MC40USCT', ' 高500X寬270X深270mm', '專利閃流放電有效分解濾網上有害物質及異味\n靜電HEPA濾網最長可用10年\n三重感知器(灰塵、PM2.5、異味)\n強力立體3D進氣快速有效集塵\n創新垂直式設計有效降低運轉噪音\n4段風段大小、3種模式選擇', NULL, 17, '2,9,17', 8817, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1720, '閃流放電除臭強力空氣清淨機(MC75LSC)', ' 1720.png', NULL, 9000, 'MC75LSC', ' H576×W395×D230mm', '＊光觸媒二氧化鈦磷灰石：利用二氧化鈦磷灰石牢牢吸住細菌與病毒後，再以閃流光觸媒加以分解與去除。  \n＊閃流放電：強效氧化力的高速電子迅速分解異味與過敏物質。  \n＊閃流除臭功能：將異味與過敏物質吸附於觸媒上，再以閃流加以分解。 \n＊電漿集塵：讓灰塵與花粉產生正電，以帶負電的靜電集塵濾紙進行集塵。 ', NULL, 17, '2,9,17', 8817, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1721, 'nanoe 空氣清淨機 (F-PXM35W)', ' 1721.png', NULL, 6690, 'F-PXM35W', ' 長300*寬189*高520mm', '◆nanoe主動出擊淨化\n◆HEPA集塵濾網+除臭濾網\n◆異味感知\n◆5段風速(自動/強/中/弱/強力運轉)\n◆睡眠模式(8小時)\n◆濾網更換指示', NULL, 17, '2,9,17', 8855, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1722, '12坪 ECONAVI智慧省電雙科技空氣清淨機 F-PXM55W', ' 1722.png', NULL, 9810, 'F-PXM55W', ' 580*300*205(mm)', '＊適用坪數:12坪\n＊nanoe主動出擊淨化\n＊HEPA高密度濾網+奈米清淨除臭濾網\n＊ECONAVI智慧省電\n＊4大智慧感知(PM2.5/微塵/異味/照明)\n＊5段風速(自動/強/中/弱/PM2.5淨化)\n＊(2/4/8hr)計時關閉功能搭載\n＊兒童安全鎖搭載\n＊地上30cm強力吸附雙感知氣流，根據汙染原調整最佳氣流方向\n＊濾網更換提醒', NULL, 17, '2,9,17', 8855, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1723, '3M 倍淨型空氣清淨機FA-E180', ' 1723.png', NULL, 9990, 'FA-E180', ' 257*250*634(mm)', '輕聲濾淨不擾眠，睡眠模式下運轉下僅25.6dB．介於樹葉摩擦聲和輕聲細語音量間\n採用DC直流變頻馬達，最高轉速耗電量70W，每日開機12小時，一個月平均每日電費不到1.4元，每月不到41元* *以非營業用電，每月家庭用電120度電以下電費試算', NULL, 17, '2,9,17', 8801, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1724, 'MITSUBISHI 三菱 SP-ME32A 家用智能 空氣清淨機香檳金', ' 1724.png', NULL, 13500, 'SP-ME32A', ' 高645×寬385×深220mm', '日本三菱重工獨家HIFIL高效粉塵濾網對抗PM2.5\n去除有害氣體蜂巢型除臭濾網\n循環氣流全方位潔淨\n˙抗敏除箘，奈米銀初效濾網\n˙去除有害氣體，蜂巢型除臭濾網\n˙循環氣流，全方位潔淨\n˙五段風速\n˙三重智慧感應，自動調節\n˙定時開關機\n˙睡眠模式', NULL, 17, '2,9,17', 8849, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1725, '無印良品|空氣清淨機 MJ-AP1TW', ' 1725.png', NULL, 13900, 'MJ-AP1TW', ' 寬25×深25×高49.8cm', '透過「雙迴圈計數風扇」及「360°集塵脫臭濾網」產生循環氣流，快速將ＰＭ2.5與花粉等浮游物質浮游物質集塵、脫臭。', NULL, 17, '2,9,17', 8851, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1726, '日本象印 空氣凈化器(白)PU-AA50-WA', ' 1726.png', NULL, 8976, 'PU-AA50-WA', ' 295x295x725 mm', '新款低噪音智能空氣凈化器。最大消費電量10W，365天24小時運轉也安心的節能設計', NULL, 17, '2,9,17', 8873, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1727, '小米空氣淨化器 3', ' 1727.png', NULL, 3995, '小米空氣淨化器 3', ' 240*240*520(mm)', '400m3/h 顆粒物。CADOLED 觸控顯示螢幕。高精度雷射顆粒物感應器。', NULL, 17, '2,9,17', 8875, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1728, '米家空氣淨化器Pro', ' 1728.png', NULL, 6595, '米家空氣淨化器Pro', ' 26*26*73.5(cm)', 'OLED顯示螢幕\n雷射顆粒物感應器\n3色指示燈\n空氣品質 清晰可見\n淨化效能 : 500m³/h\n適用面積 : 35m² ~ 60m²', NULL, 17, '2,9,17', 8875, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1801, '雙效空氣清淨除濕機(FD-A90W)', ' 1801.png', NULL, 9900, 'FD-A90W', ' 37.3*27.5*59.6(cm)', '除濕能力9.5L/日１機３用 清淨/除濕/乾衣！ 高效除濕+空氣濾淨，雙效合一 不需除濕功能 也可開啟獨立空氣清淨\n3M 雙效空氣清淨除濕機(FD-A90W)?除濕能力9.5L/日\n█１機３用，清淨/除濕/乾衣！\n█高效除濕+空氣濾淨，雙效合一\n█不需除濕功能 也可開啟獨立空氣清淨\n█造型簡約優雅，提升居家生活品味\n█採用日本除濕輪科技，免冷媒、無壓縮機\n█除濕能力9.5公升/每日，效能再升級\n█超微米靜電濾網，過濾PM2.5達99.9%\n█負離子釋放，空氣更清新\n█3段除濕模式、3段乾衣模式\n█定時設計', NULL, 18, '2,9,18', 8801, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1802, '16公升雙效空氣清淨除溼機FD-Y160L', ' 1802.png', NULL, 14990, 'FD-Y160L', ' 38.4 x 65.9 x 28.3 cm', '先除溼再淨化，真正一乾二淨\n10分鐘過濾99.9%的細菌\n優於新制能效一級標準\n一台乾＋淨，省下40%+空間', NULL, 18, '2,9,18', 8801, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1803, '除濕輪除濕機-6.5公升(DD8061)', ' 1803.png', NULL, 4990, 'DD8061', ' 寬26.9x深17.4x高44.5(公分)', '●熱觸媒技術\n●日本抗過敏原濾網\n●除濕除臭除過敏原\n●乾衣不怕滋生黴菌\n●無壓縮機永不結霜', NULL, 18, '2,9,18', 8804, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1804, '除濕輪除濕機 (DD181FW)', ' 1804.png', NULL, 6980, 'DD181FW', ' 寬175x深295x高475(mm)', '日本除濕輪新科技，免壓縮機\n強效除濕力8L/日，永不結霜\n3D導風板+自動擺葉，寬廣無死角\n負離子+奈米銀濾網，濾淨空氣', NULL, 18, '2,9,18', 8804, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1805, '電子式負離子迷你防潮除濕機 灰色HL710-GY(負離子除濕機)', ' 1805.png', NULL, 1480, 'HL710-GY', ' 205 x 131 x 340 mm', '●負離子空氣清淨功能\n●最新半導體除濕技術\n●低功率節能省電環保\n●水滿自動停機保護\n●迷你輕巧美型', NULL, 18, '2,9,18', 8834, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1806, '負離子清淨防潮除濕機EPI-610AK', ' 1806.png', NULL, 2380, 'EPI-610AK', ' W205 x D131 x H340 (mm)', '● 搭配專屬負離子空氣清淨功能、除濕清淨一次完成\n● 熱電半導體制冷模式，節能省電\n● 無壓縮機除濕技術、低噪音', NULL, 18, '2,9,18', 8834, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1807, '10公升負離子清淨舒適除濕機 RD-200HS(閃亮銀)', ' 1807.png', NULL, 12990, 'RD-200HS', ' 365寬x625高x305深(mm)', '＊除濕能力：10公升/日 ＊負離子清淨功能 ＊PM2.5清淨濾網 ＊鏡面觸控面板 ＊雙吹出口導風 ＊白光LED顯示 ＊超大容量水箱 ＊電源自動收線 ＊聲光水位顯示 ＊四輪萬向移動 ＊快速乾衣', NULL, 18, '2,9,18', 8835, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1808, '8公升一級能效除濕機(RD-16FQ/RD-16FR)', ' 1808.png', NULL, 10590, 'RD-16FQ/RD-16FR', ' 330寬x600高x220深(mm)', '除溼能力 : 8公升/日\nLED按鍵式面板\n超廣角上吹\n舒適節電\n低濕乾燥\n自定濕度', NULL, 18, '2,9,18', 8835, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1809, '日立6公升除濕機 RD-12BR(玫瑰金)', ' 1809.png', NULL, 9290, 'RD-12BR', ' 高600*寬330*深220(mm)', '除濕能力：6公升/日\n連續除濕\n能源效率第一級\n滿水自動停止運轉\nMIT台灣製造', NULL, 18, '2,9,18', 8835, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1810, '負離子微電腦電子除濕機(KJ-HC02)', ' 1810.png', NULL, 1745, 'KJ-HC02', ' W240xD150xH360mm', '滿水位自動停止運作\n運轉低噪音安靜舒適\n無壓縮機環保概念新機種\n除濕/防霉/除臭\n水滿自動關閉運轉\n滿水位自動停止運作\n運轉低噪音安靜舒適\n減少黴菌塵蹣滋生率\n低耗電+負離子去除霉味\n無壓縮機環保概念新機種\n除濕/防霉/除臭\n水滿自動關閉運轉\n適用於小坪數房間(約1~4坪)', NULL, 18, '2,9,18', 8842, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1811, '負離子雙製冷晶片除濕機(KJ-HC05)', ' 1811.png', NULL, 1980, 'KJ-HC05', ' 24X14X36.5cm', '除濕淨化一次搞定\n超大液晶面板顯示\n渦流風道設計，立體噴射風量吸收濕氣\n雙製冷晶片，效能更加倍\n滿水位提示、溫度/相對濕度顯示\n小功率用電超省\n除濕淨化一次搞定\n超大液晶面板顯示\n滿水位提示、溫度/相對濕度顯示\n雙製冷晶片，效能更加倍\n負離子、智能觸控\n1~12小時定時功能\n超低噪音\n渦流風道設計，立體噴射風量吸收濕氣\n適用面積：1~4坪(依環境而定)', NULL, 18, '2,9,18', 8842, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1812, '【Life Plus】靜音節能迷你除濕機/衣櫥除濕機(白粉)', ' 1812.png', NULL, 1580, 'GZ-1607-1', ' 150*125*210(mm)', '輕鬆操作，一鍵搞定\n半導體製冷技術，除濕效果佳\n◆體積小|小坪數空間除濕無死角\n◆極安靜|風阻小運作超靜音\n◆超省電|耗電量僅22W\n◆高智慧|水滿系統自動斷電\n◆好安心|台灣BSMI認證變壓器', NULL, 18, '2,9,18', 8844, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1813, '25公升一級能效智慧變頻高效節能除濕機(MJ-EV250HM-TW)', ' 1813.png', NULL, 27900, 'MJ-EV250HM-TW', ' 寬410 × 深299 × 高630(㎜)', '高速除濕＋節能省電智慧變頻，高效節能新搭載 PM2.5 抗菌除臭濾網，空氣清淨更升級可自行設定喜好濕度大型水箱5.5公升', NULL, 18, '2,9,18', 8849, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1814, '12L日本製輕巧除濕機MJ-E120AN', ' 1814.png', NULL, 15300, 'MJ-E120AN', ' 寬37.2*深28.1*高59.4(CM)', '強勁送風、廣角90度自動擺葉搭載PM 2.5抗菌消臭濾網日除濕能力 12.0L●精巧機身\n獨家三重除濕系統\nPM2.5抗菌除臭濾網\n超靜音38dB\n大容量儲水箱4.7L\n獨立空清運轉', NULL, 18, '2,9,18', 8849, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1815, '9公升智慧型除濕輪除濕機(F-YZJ90W)', ' 1815.png', NULL, 8990, 'F-YZJ90W', ' 52x19.3x39cm', '除濕能力：9L/日(室溫27℃，相對濕度80%)\n創新方式：除濕輪式無冷媒低噪音\n高效烘衣：9種乾衣模式、自動偵測超貼心\n160°廣角出風口，3D立體烘衣\n33dB超靜音\n6項安全裝置', NULL, 18, '2,9,18', 8855, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1816, '11公升一級能效ECONAVI空氣清淨除濕機(F-Y22EN)', ' 1816.png', NULL, 9990, 'F-Y22EN', ' (高)600 X (寬)350 X (深)230', '奈米銀抗菌抗敏清淨濾網\n25項安全裝置\n萬向輪\n除濕能力：11L/日(室溫27℃/相對溼度60%)\n適用室溫範圍：1℃~40℃\n適用坪數大小：~14坪 (46m²)\n能源因數值2.41L/kWh', NULL, 18, '2,9,18', 8855, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1817, '8公升一級能效清淨除濕機(F-Y16EN)', ' 1817.png', NULL, 7560, 'F-Y16EN', ' 高580 × 寬315 × 深225 (㎜) ', '■ 除濕能力8L/日(室溫27℃/相對溼度60%)\n■ 能源因數值2.41L/kWh\n■ 25項安全裝置\n■ nanoe X 奈米健康科技\n■ 定時功能：1~12小時\n■ 一級能效', NULL, 18, '2,9,18', 8855, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1818, '10L空氣清淨除濕機(F-Y20JH)', ' 1818.png', NULL, 12720, 'F-Y20JH', ' 寬370x高650x深322mm', '除濕能力 10公升/日(室溫27°C/相對溼度60%) \n5.5公升超大水箱設計\nnanoe™ X健康科技奈米水離子除臭、抑菌\nHEPA集塵濾網(H13等級)+活性碳?臭濾網\nW-HEXS雙重除濕系統\nECONAVI智慧節能乾衣\n前面版TFT全彩液晶螢幕\n(濕度顯示 / 異味偵測顯示 / PM2.5+PM1.0顯示)\nWifi模組內藏化 \nAI舒適、聲控智慧操作\n下吹出風\n萬向滑輪剎車功能、移動省力\n自動捲線設計', NULL, 18, '2,9,18', 8855, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1819, '一級能效6公升空氣清淨除濕機(AD-WA712T)', ' 1819.png', NULL, 4480, 'AD-WA712T', ' 290 寬 x 478 高 x 190 深 (mm)', '❁除濕能力：6L/日\n❁十重安全防護，使用好安心\n❁連續排水設計(可接水管)，免去倒水之困擾 \n❁三段定時關機設定(2、4、6小時)\n❁可自由設定濕度，40%/50%/60%/連續\n❁甲殼素濾網裝置，抑菌/除塵多重保護\n❁新國家一級能效標準認證，省電又環保\n❁底部滑輪、貼心把手設計，移動機體好輕鬆\n❁微電腦控制面板，有自動除霜功能，上吹烘衣功能\n❁3機一體，除濕機/清淨機/烘衣機，一年四季乾爽舒適\n❁高效能迴轉式壓縮機，除濕效率大幅提升，節能省電再進化', NULL, 18, '2,9,18', 8858, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1820, '20L甲殼素PICO PURE清淨除濕機 DHY-GA20P', ' 1820.png', NULL, 16490, 'DHY-GA20P-', ' 390*691*275', '每日除濕力20公升\nAIE智慧模式，自動轉換除濕/清淨模式\n大螢幕LCD營幕顯示與操作\n玻璃鏡面美型、易清潔\n萬向腳輪，多重安全防護\n溫度/濕度感應\n水箱5公升，連續排水設計\nPICO PURE 清淨功能，甲殼素濾網\n1級能效，節能標章預計11月下旬取得\n1-12小時定時關機★', NULL, 18, '2,9,18', 8858, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1821, '聲寶16公升/日PICO PURE清淨型除濕機AD-W732P', ' 1821.png', NULL, 11590, 'AD-W732P', ' 346寬x590高x242深mm', '◆除濕能力：16L/日\n◆可單獨使用PICOPURE清淨功能\n◆連續排水設計，免去倒水之困擾\n◆十項高規格安全防護，使用超安心\n◆新國家一級能效標準認證，省電又環保\n◆PICOPURE全效淨化，除菌、防霉、抗過敏、脫臭\n◆3機一體，除濕機/清淨機/烘衣機，一年四季乾爽舒適\n◆8段定時(1~8hr)、10段濕度設定(40%~80%、連續)、2段風速(強、弱)，自由操作好便利\n◆自動除霜功能，環境溫度過低時自動啟動\n◆抗菌濾網裝置，抑菌/除塵多重保護\n◆萬向腳輪設計，輕鬆移動更省力\n◆自動導風板，上吹烘衣好便', NULL, 18, '2,9,18', 8858, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1822, 'SHARP 夏普 衣物乾燥空氣清淨除濕機 DW-J10FT-W', ' 1822.png', NULL, 10499, 'DW-J10FT-W', ' W35.9 x D30.1 x H66.5 CM', '4.6L大容量儲水箱\n高濃度自動除菌離子除菌脫臭\n防菌防黴運行，抑制99%黴菌\n額定除濕能力: 10公升/日(室溫27度 相對濕度60%)', NULL, 18, '2,9,18', 8860, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1823, '6L自動除菌離子除濕機(DW-L71HT-W)', ' 1823.png', NULL, 6030, 'DW-L71HT-W', ' 30.5 × 20.3 × 52.6', '能源效率1級\n除濕能力6L/日(B式/室溫27 ℃/相對濕度60%)\nPlasmacluster自動除菌離子除菌脫臭/定點脫臭\n下吹式45度除溼乾衣清淨氣流，有效乾燥潮濕地板/地毯及抑制細菌\n搭載溫濕度感應器自動偵測除濕\n除溼模式(強/弱/自動)\n衣物乾燥(離子脫臭/強/弱)\n定時關(2、4、6小時)/兒童安全鎖\n自動除霜/滿水自動保護功能\n提把設計，移動輕鬆便利\n搭載高密度前置過濾網，有效過濾灰塵及毛絮', NULL, 18, '2,9,18', 8860, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1824, '6L自動除菌離子清淨除濕機 1級能效 DW-H6HT-W', ' 1824.png', NULL, 6449, 'DW-H6HT-W', ' W304 x D203 x H480mm', '除濕能力6L/日(B式/室溫27 ℃/相對濕度60%)\nPlasmacluster自動除菌離子除菌脫臭/定點脫臭\n搭載溫濕度感應器自動偵測除濕\n空氣清淨/連續除濕/衣物乾燥三種模式\n自動除霜/滿水自動保護功能\n自動擺風(上下擺風)\n提把設計，移動輕鬆便利\n定時關機(2H、4H、6H)\n多重安全保護裝置，防燃安心設計，操作面板部採用UL94-V0等級防火材質\n搭載高密度過濾網，有效過濾灰塵及毛絮\n兒童安全鎖及運行12小時自動關機貼心安全保護功能\n採用R-134a環保冷媒', NULL, 18, '2,9,18', 8860, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1825, '8公升一級能效節能除濕機(TDH-168MB-NW)', ' 1825.png', NULL, 5888, 'TDH-168MB-NW', ' H578*W352*D277(mm)', '．一級能源效率\n．自動溼度感測\n．水滿自動停機\n．LED顯示&9種安全保護\n．除濕溼度控制&連續除濕模式\n．連續排水設計\n．隱藏式把手設計\n．採環保冷媒R134A\n．電源：110V/60HZ\n．消耗功率185W\n．額定除濕能力：8L/D(室溫27℃相對溼度60%)\n．水箱容量：2.5L', NULL, 18, '2,9,18', 8866, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1826, '6公升除濕機 (TDH-120MX)', ' 1826.png', NULL, 4990, 'TDH-120MX', ' 長29cm X 寬19cm X 高47.8cm', '．除濕能力(DB27℃，RH60%)\n．水箱容量：2.0L\n．輕巧化設計，不占空間\n．隱藏式把手\n．9重安全防護設計', NULL, 18, '2,9,18', 8866, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1827, '6公升除濕機 TDH-125MB', ' 1827.png', NULL, 4480, 'TDH-125MB', ' 520*300*225mm', '◎除濕能力：6L/日(27℃相對溼度60%RH)\n◎水箱容量：2.5L\n◎定時功能：2-4-8R小時定時關機設定\n◎具備自我除霜功能\n◎三段濕度控制\n◎9種安全保護設計\n◎單向滑輪，移動方便\n◎型號 : TDH-125MB\n◎電壓：110V-60Hz\n◎消耗功率：115W\n◎產品尺寸：520*300*225mm(高寬深)\n◎重量：13.5K', NULL, 18, '2,9,18', 8866, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1828, '360°衣物乾燥除濕機(7L/日) RJ-XAF70', ' 1828.png', NULL, 12990, 'RJ-XAF70', ' 29.5x29.5x55(cm)', '■ 除濕能力：7L/日 (室温20℃，相對濕度60%)\n■ 360度送風、立體旋轉擺葉+上下風向，3D循環乾燥\n■ 沸石式除濕，不受寒冷氣候限制，維持穩定除濕力\n■ 適用於各種日常空間，除濕不間斷乾爽又舒適◎ 電壓：110V60Hz\n■ 消耗功率：660W\n■ 除濕能力：7L/日 (室温20℃，相對濕度60%)\n■ 水箱容量：約2.8L (自動停止容量)\n■ 商品重量約:9.5kg', NULL, 18, '2,9,18', 8873, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1829, '【RF-FA20】乾燥機 強力風量 快速乾燥 季節模式 衣物 棉被 烘被 烘鞋機 除蟎 除濕', ' 1829.png', NULL, 5760, 'RF-FA20', ' 23 x 15 x 36', '■智能\n不需要傳統烘乾機中的墊子和軟管，只需打開即可設置並立即開始運行。\n■強勁\n雙風扇高效傳遞風量的結構和噴嘴的進化，使風量更加強勁。\n■精巧\n設計更精巧，同時增加風量。它易於存放在床邊，只需折疊即可輕鬆收起。\n■出風口角度可根據您要烘乾的衣物、鞋子等進行上下調節。', NULL, 18, '2,9,18', 8873, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(1830, '6L 沸石式 / 除濕輪 除濕機 SD-014V', ' 1830.png', NULL, 5180, 'SD-014V', ' 55.5(高)Ｘ34.4(寬)Ｘ28.8(深)/CM ', '◎ 微電腦控制\n◎ 連續運轉 (高 / 中 / 低 / 自動)\n◎ 自動除濕模式 (40% 50% 60%)\n◎ 過濾網(前置塑膠濾網 / 蜂巢狀除甲醛濾網)\n◎ 隱藏式提把 + 貼心滾輪設計\n◎ 滿水指示燈，水箱容量4L\n◎ 異常指示燈閃爍\n◎ 更換濾網提醒燈(蜂巢狀除甲醛濾網)\n◎ 1-7小時定時', NULL, 18, '2,9,18', 8878, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2001, '32型Android智慧連網液晶顯示器(2T-C32BE1T)', ' 2001.png', NULL, 8455, '(2T-C32BE1T', ' null', 'null', NULL, 20, '2,10,20', 8860, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2002, '42型Android智慧連網液晶顯示器(2T-C42BE1T)', ' 2002.png', NULL, 10355, '2T-C42BE1T', ' null', 'null', NULL, 20, '2,10,20', 8860, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2003, '43型4K HDR智慧連網電視(UA43TU8000WXZW)', ' 2003.png', NULL, 16900, 'UA43TU8000WXZW', ' null', 'null', NULL, 20, '2,10,20', 8859, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2004, '50型4K HDR智慧連網QLED量子電視(QA50Q60TAWXZW)', ' 2004.png', NULL, 21900, 'QA50Q60TAWXZW', ' 1264 x 780 x 145', '金屬量子點顯色技術\n雙視光增豔科技\n支援HDR雙規格', NULL, 20, '2,10,20', 8859, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2005, '智慧顯示器65型(SKU29535)', ' 2005.png', NULL, 20990, 'SKU29535', ' 1500*862*90', '小米智慧顯示器 65 型採用全新超薄音響設計。\n以四個強大的音效驅動元件，組成一組20W功率的杜比™立體聲喇叭，\n在家中帶來猶如身臨其境的聽覺享受。', NULL, 20, '2,10,20', 8875, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2006, '55型智慧顯示器(P1)', ' 2006.png', NULL, 15999, '55型智慧顯示器(P1)', ' 1230*247*767', '四核心處理器 2GB+16GB\n杜比音效和DTS-HD解碼\nAndroid TV☆ 10', NULL, 20, '2,10,20', 8875, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2007, '65型QLED量子4K安卓智慧聯網全陣列區域控光液晶顯示器(65U8000VS)', ' 2007.png', NULL, 37900, '65U8000VS', ' 1462*898*69', '量子黑面板｜全陣列區域控光\nharman/kardon音效\nandroidTV追劇|三年保', NULL, 20, '2,10,20', 8868, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2008, '65型4K HDR安卓區域控光廣色域智慧聯網液晶顯示器(65U7900VS)', ' 2008.png', NULL, 25900, '65U7900VS', ' 1500*862*90', '日本設計｜東芝品質｜３年保固\n區域控光｜廣色域｜六真色PRO\nandroid tv 安卓平台', NULL, 20, '2,10,20', 8868, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2009, '55型QLED量子4K安卓智慧聯網全陣列區域控光液晶顯示器(55U8000VS)', ' 2009.png', NULL, 29900, '55U8000VS', ' 1452*862*89', '量子黑面板｜全陣列區域控光\nharman/kardon音效\nandroidTV追劇|三年保\n', NULL, 20, '2,10,20', 8868, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2101, '小米AI音箱', ' 2101.png', NULL, 1495, 'AI音箱', ' 88 mm x 211.6 mm', '小愛同學身為華語智慧 AI 語音助理領導者，其獨家音色技術，使得它擁有多種情感表現，尤其是對於中文聲音辨識與理解力，與 Google 小姐相比也毫不遜色。除此之外，在音色上也是採用好萊塢 DTS音效等級，結合1600萬種 LED燈珠所產生燈光效果，讓人更能盡情享受音樂、燈效帶來的愉悅氛圍。加上小米智慧生態系也相當豐富，不必擔心能搭配的智能家電不足。結合上述優勢，推薦習慣下達中文指令，或是想當做孝親禮物的讀者選購。', NULL, 21, '2,10,21', 8875, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2102, '小米 小愛音箱 Art', ' 2102.png', NULL, 1495, '小愛音箱 Art', ' 131×104×151mm', '小愛同學身為華語智慧 AI 語音助理領導者，其獨家音色技術，使得它擁有多種情感表現，尤其是對於中文聲音辨識與理解力，與 Google 小姐相比也毫不遜色。除此之外，在音色上也是採用好萊塢 DTS音效等級，結合1600萬種 LED燈珠所產生燈光效果，讓人更能盡情享受音樂、燈效帶來的愉悅氛圍。加上小米智慧生態系也相當豐富，不必擔心能搭配的智能家電不足。結合上述優勢，推薦習慣下達中文指令，或是想當做孝親禮物的讀者選購。', NULL, 21, '2,10,21', 8875, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2103, '中華電信i寶貝智慧音箱(高階款)', ' 2103.png', NULL, 5990, '中華電信i寶貝智慧音箱(高階款)', ' 114 x 224 mm', '「高階款」的音箱有更強大的遠距收音能力，可在5公尺的距離喚醒音箱和下指令，並內建ARM Cortex-A9R4四核架構CPU，讓語音識別速度更快，再搭配360°雙麥克風收音，和全音域渾厚音場。', NULL, 21, '2,10,21', 8877, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2104, '中華電信i寶貝智慧音箱(入門款)', ' 2104.png', NULL, 2790, '中華電信i寶貝智慧音箱(入門款)', ' 114x114x45.4mm', 'LUCIA mini 採用輕巧的外型設計，機身設有 4 組麥克風，可進行 360 度全面收音，提高音箱的喚醒率。軟體方面，內建中華電信 i 寶貝智慧聲控服務，同時導入 B2B2C 企業合作方案，支援迎賓服務的聲控客服、校園接送提醒功能。此外，首度搭載台語聲控 KKBOX、MOD 轉台服務，讓習慣使用台語的用戶，也能享有便利的智慧生活體驗。', NULL, 21, '2,10,21', 8877, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2105, 'LUCIA智慧音箱', ' 2105.png', NULL, 3990, 'LUCIA智慧音箱', ' 308 x 135 x 97.2mm', 'LUCIA喚醒率達95%，即使撥放音樂的同時，也能聽得到您的呼喚。\n 看MOD、聽音樂、唸童書 、學英文、個人助理 ，還能操控智慧家庭設備。\n LUCIA 獨家的「視覺化語音互動介面」，可自動喚醒手機螢幕，優化互動體驗。\n 以北歐彎月造型搭配高質感織布，外觀線條優雅。\n 智慧情境呼吸燈 調氛圍也調心情。\n DPS音效增強技術 讓聽 更動聽。', NULL, 21, '2,10,21', 8880, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2106, '遠傳愛講智慧音箱 WF62018', ' 2106.png', NULL, 1680, 'WF62018', ' 112 x 240 mm', '結合智慧家庭設備 一聲就控\n 標準國語語音辨識 一講就通\n 在地化台灣資訊 一問就知\n 是音箱，更是隨時待命的智慧語音助理。\n 想做什麼就開口，愛講為你啟動便利貼心的智慧生活', NULL, 21, '2,10,21', 8882, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2107, '遠傳愛講小狐狸WG62028', ' 2107.png', NULL, 3500, 'WG62028', ' 121x114x45.4mm', '資訊快查：台灣天氣、空氣品質、查股票、匯率換算、維基百科、翻譯\n 生活幫手：設置提醒、查詢時間、設置鬧鐘、萬年曆、單位換算、家庭留言機、計算機\n 學習娛樂：friDay 音樂、KKBOX 音樂雙平台、樂學有聲書、博客思聽有聲書、愛播有聲書、空中英語教室每日一句\n 新聞廣播：Yahoo新聞、TVBS、非凡、彭博直播新聞、警廣、寶島新聲、IC 之音廣播\n 智慧家庭：控制家電（EQL 智能小管家、智慧燈泡、智慧插座）、藍牙應用（藍牙播放）', NULL, 21, '2,10,21', 8882, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2108, '富連網家 智能AI音箱 (SPK01A)', ' 2108.png', NULL, 1990, 'SPK01A', ' 75 mm*185mm', '最多廣播頻道的智能音箱\n 支援 AirPlay/DLNA\n 支援多音源播放\n 最實惠入手價', NULL, 21, '2,10,21', 8883, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2109, '小豹 AI 智能音箱', ' 2109.png', NULL, 3499, '小豹 AI 智能音箱', ' 122 x 149 mm', '小豹AI音箱是獵豹移動推出的智慧音箱，內建五顆揚聲器與6隻麥克風陣列，音質表現上有一定水準。音樂方面支援KKBOX，內建的語音助理小豹也能做到小愛同學能做到的事。智慧家庭裝置的部份，目前有支援LifeSmart智慧家庭系統的配件，未來可能會與小米生態系、聲寶、東元等廠商合作，會有更多智慧裝置支援小豹AI音箱，不會是一個封閉的生態系', NULL, 21, '2,10,21', 8884, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2110, 'Acer Halo Smart Speaker', ' 2110.png', NULL, 4990, 'Acer Halo Smart Speaker', ' 168 x 96 mm', '由 Acer 於2021最新打造的 Halo 智慧音箱，在規格上使用 DTS Surround 360度環境音效技術，並可搭配多家串流音樂服務平台。還有可設計的個性化面板以及 RGB 燈效，是重視音樂、燈光氣氛的人不可錯過的一款產品。而在智慧語音助理程度上，結合 Google Assistant，最多可串聯上萬種智慧型家電，輕鬆升級 Smart 家庭生活。', NULL, 21, '2,10,21', 8802, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2111, 'Amazon echo Dot (4th Gen) Kids', ' 2111.png', NULL, 1390, 'Amazon echo Dot (4th Gen) Kids', ' 100 mm x 89mm', 'Echo Dot Kids Edition，造型提供兩種彩色打印版本（熊貓和老虎），更特別為兒童設計了一些功能，如設置動物警報，功課及作業幫助，甚至能打電話給認可的家人和朋友等。', NULL, 21, '2,10,21', 8806, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2112, 'Amazon echo Dot (4th Gen)', ' 2112.png', NULL, 1790, 'Amazon echo Dot (4th Gen)', ' 144mm x 133mm', '最新一代 Echo，外型設計上把上一代 Echo 與 Echo Spot 結合，採用了圓球形狀，該球體的大部分表面為格柵，至於塑料底面則設有具燈光效果的 LED 環。它的大小適中，設計時尚簡約，輕鬆融入不同的家居風格。', NULL, 21, '2,10,21', 8806, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2113, 'Apple HomePod mini', ' 2113.png', NULL, 2799, 'Apple HomePod mini', ' 84.3 mm x 97.9 mm', '讓房間彌漫音樂，是個聰明伶俐的小助手。幫忙掌控你的智慧家庭生活。確保隱私權與安全性。\n HomePod mini 滿載創新技術，小小體積，揚聲器卻有令人驚歎的響亮音質。它的高度只有 84.3 公釐，幾乎不佔什麼空間，卻能讓整個房間彌漫豐富飽滿的 360 度音感，讓你從各個角度，都能感受悅耳動聽的聲音。', NULL, 21, '2,10,21', 8807, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2114, 'HomePod', ' 2114.png', NULL, 9900, 'HomePod', ' 172 mm x 142 mm', '這款銳意打造的揚聲器儘管外形小巧，音色卻豐富渾厚、細節分明。HomePod 將 Apple 精心打造的音訊技術與先進軟體巧妙結合，帶來響徹滿室的精準音色。且高度不到 18 公分，HomePod 放在家中的任何角落都合適。', NULL, 21, '2,10,21', 8807, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2115, 'Asus AI800M PRO', ' 2115.png', NULL, 2990, 'Asus AI800M PRO', ' 99 x 99 x 205 mm', 'ASUS 華碩的小布智慧音箱，主打在地研發語音助理，可播放台灣華視新聞、大愛廣播電台等，整合起本地多元生態圈。也提供個人化語音設定，藉由專屬 App 自訂對話，便可在下達特殊指令時，喚起小布回答事先設定的回覆或服務，可說是相當貼近本土生活化的使用環境。', NULL, 21, '2,10,21', 8809, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2116, 'Soundfor elite hifi', ' 2116.png', NULL, 12990, 'Soundfor elite hifi', ' 168.5mm x 162mm', 'SOUNDFORM ELITE 是與音響領先專家 Devialet 攜手合作打造的喇叭，能提供高保真聲音，帶來震撼的音訊體驗。我們將 Devialet 非凡的聲學構造與快速的無線充電和屢獲殊榮的設計互相結合，為您的家居打造出這款高效能的智能喇叭。 SOUNDFORM ELITE 具備 Google 助理功能，您可以播放和控制音樂，同時在家中體驗身歷其境的震撼音質*。', NULL, 21, '2,10,21', 8811, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2117, 'Bose Portable Smart Speaker', ' 2117.png', NULL, 12500, 'Bose Portable Smart Speaker', ' 119 x 191.5 mm', '可支援 Airplay 2、Spotify Connect 以及 Google Assistant 的「BOSE 可攜式智慧型揚聲器」。別看這款揚聲器外觀小小的，它可具有 360° 全方位音效、無線藍牙連接機能，還有長達 12 小時播放的電力以及防潑水的設計，很適合一般人帶去戶外使用，在野餐或是派對時也能夠享受音樂所帶來的樂趣。', NULL, 21, '2,10,21', 8814, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2118, 'Google Nest Audio', ' 2118.png', NULL, 3180, 'Google Nest Audio', ' 124×175mm', 'Google打造台灣在地中文服務。\n 開個口，幫你處理生活大小事。\n 開個口，MyMusic音樂 聲控即播。\n 音質更加優異，低音出色，音樂宏亮且富層次感。\n 語音指令控制相容的家用智慧型裝置。\n 提供個人化的專屬資訊（天氣/新聞/行程/提醒等）。\n 適合每個房間的貼心設計', NULL, 21, '2,10,21', 8832, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2119, 'Google Nest Mini', ' 2119.png', NULL, 1785, 'Google Nest Mini', ' 98 mm x 42 mm', 'Google 智慧音箱 Google Nest Mini 算是 Home Mini 進階產品，除了親民價格外，也針對台灣使用者的語言習慣，提升中文語音助理能力。並且能透過 Google 聲音識別技術，最多可支援6位不同使用者，為家中成員提供個人化的語音服務。\n 再加上其能與 Google 系統聯動的上萬種智慧裝置，若是使用過前代商品的讀者，不妨繼續感受看看功能更加出色的 Nest Mini！', NULL, 21, '2,10,21', 8832, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2201, 'Tapo P100 wifi無線網路智慧插座開關(支援Google assistant音箱)', ' 2201.png', NULL, 399, 'Tapo P100', ' 60*38*33mm', '防燃耐熱材質，多種安全防護\n內建獨立控制器，無需額外添購閘道器\n透過無線網路連結居家網路\n內建強力受訊網卡，與家中分享器阻隔3堵牆依然可以連線\n平板/智慧型手機搭配Tapo app 遠端操控家電\n遠端監控、操作排程開關電源', NULL, 22, '2,11,22', 8870, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2202, 'Tapo P105 wifi無線網路智能智慧插座開關(支援Google nest mini音箱)', ' 2202.png', NULL, 399, 'Tapo P105', ' 60*38*33mm', '★全球銷量NO.1無線設備大廠牌出品，品質保證\n★支援更高功率的電器100-125 V，最大負載1800W\n★迷你設計 – 不阻擋鄰近插座的使用空間\n★遠端控制 – Tapo app管理，不在家也能控制插座上的電器設備', NULL, 22, '2,11,22', 8870, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2203, 'HS105 Wi-Fi 無線網路雲智慧插座', ' 2203.png', NULL, 599, 'HS105', ' 140*90*88mm', '獨立主機\n家裡有Wi-Fi網路即可使用\n迷你設計，不佔用多餘的插座空間\n2.4GHz無線智慧插座\n具有定時器和設定日程計劃功能\n超值加購', NULL, 22, '2,11,22', 8870, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2204, 'Opro9 智慧插座 (三系統)', ' 2204.png', NULL, 1099, 'Opro9', ' 114*54*42mm', '蘋果Apple Homekit授權認證\n可支援APPLE iOS . Google . Amazon Alexa\n透過手機APP或是SIRI\n輕鬆遙控、監控、排程家中的電器設備\n1.透過「家庭」APP，輕鬆遙控您的家電\n2. 可搭配其他Apple Homekit授權配件使用\n3. 支援美規(ETL/FCC)、台規(NCC)插座\n4. 過電流警示防護及防火阻燃\n5. 原廠一年保固\n', NULL, 22, '2,11,22', 8854, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2205, 'DSP-W118 迷你Wi-Fi智慧插座', ' 2205.png', NULL, 599, 'DSP-W118', ' 68*38*35mm', '★透過無線網路連結居家網路\n★平板/智慧型手機搭配mydlink app 遠端操控家電\n★遠端監控、操作排程開關電源\n★支援Google Assistant, Amazon Alexa ,IFTTT輕鬆實現免動手的語音控制功能', NULL, 22, '2,11,22', 8819, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2206, 'Wi-Fi WiZ 智慧照明 智慧插座(PW005)', ' 2206.png', NULL, 699, 'PW005', ' 70*70*130mm', '■Wi-Fi 直連無須網關，輕鬆安裝\n■語音控制，設定日程\n■迷你設計不佔用多餘的插座空間\n■平板/智慧型手機APP管理與安裝，簡單方便\n', NULL, 22, '2,11,22', 8856, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2207, 'WIFI無線遙控入牆式智慧插座(崁入式/智能/獨立開關)', ' 2207.png', NULL, 800, 'WIFI無線遙控入牆式智慧插座', ' 70*120*40mm', '家裡有Wi-Fi網路就可以使用\n可透過語音指令操作\n手機遠端遙控 多種情境設定\n2.4GHz無線智慧獨立開關\n', NULL, 22, '2,11,22', 8812, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2208, '米家空调伴侣2', ' 2208.png', NULL, 339, '米家空调伴侣2', ' null', 'null', NULL, 22, '2,11,22', 8876, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2209, '小米智能多模网关', ' 2209.png', NULL, 726, '小米智能多模网关', ' null', 'null', NULL, 22, '2,11,22', 8876, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2301, '智慧i系列12W智能三用燈泡 LED-E2712-I', ' 2301.png', NULL, 499, 'LED-E2712-I', ' null', 'null', NULL, 23, '2,11,23', 8881, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2302, 'LED 智慧燈泡 Lite 彩光版', ' 2302.png', NULL, 395, 'LED 智慧燈泡 Lite 彩光版', ' null', 'null', NULL, 23, '2,11,23', 8876, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2303, 'LED 智慧燈泡 Lite 白光版', ' 2303.png', NULL, 400, 'LED 智慧燈泡 Lite 白光版', ' null', 'null', NULL, 23, '2,11,23', 8876, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2304, '智能燈泡', ' 2304.png', NULL, 680, '智能燈泡', ' null', 'null', NULL, 23, '2,11,23', 8852, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2305, 'Wi-Fi WiZ 智慧照明 可調色溫嵌燈(PW003)', ' 2305.png', NULL, 699, 'PW003', ' null', 'null', NULL, 23, '2,11,23', 8856, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2306, 'Wi-Fi WiZ 智慧照明 7.5W全彩燈泡(PW004)', ' 2306.png', NULL, 799, 'PW004', ' null', 'null', NULL, 23, '2,11,23', 8856, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2307, '智慧燈泡 全彩LED', ' 2307.png', NULL, 1990, '智慧燈泡 全彩LED', ' null', 'null', NULL, 23, '2,11,23', 8845, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2308, 'TRÅDFRI Led 燈膽 e27 806流明, 無線調光/白光光譜 透明', ' 2308.png', NULL, 600, '無線調光/白光光譜 透明', ' null', 'null', NULL, 23, '2,11,23', 8836, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2309, 'TRÅDFRI Led 燈膽 e14 600流明, 無線調光/白光光譜 奶白色', ' 2309.png', NULL, 520, '無線調光/白光光譜 奶白色', ' null', 'null', NULL, 23, '2,11,23', 8836, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2401, 'SOMA Smart Home Smart Tilt 2 智能窗簾機', ' 2401.png', NULL, 3000, 'SOMA Smart Home Smart Tilt 2', ' 150*100*50', '旋轉棒控制器可以說是專門為百葉窗簾所設計的，這類控制器可以取代原本百葉窗轉棒的功能，藉此改變葉片的方向。知名產品同樣是SOMA 推出的SOMA Tilt (119鎂)，與SOMA Smart Shades 一樣，可由USB孔充電，也可由太陽能板供電。當然，如果想接入第三方智慧家庭平台HomeKit 或Google Home 也得搭配SOMA Connect。', NULL, 24, '2,11,24', 8863, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2402, '智慧窗簾控制器 第2代', ' 2402.png', NULL, 5042, '智慧窗簾控制器 第2代', ' 150*120*50', '如果不想對原先的窗簾做太多的更動，則可以選擇“珠鏈繩控制器”、“窗簾移動機器人” 或“智慧型萬用遙控器” 這類型的產品，安裝起來方便快速。', NULL, 24, '2,11,24', 8863, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2403, '窗簾機器人*2', ' 2403.png', NULL, 4950, '窗簾機器人*2', ' 150*120*50', '如果家裡原本的窗簾就是電動窗簾，而且是使用RF射頻遙控器操作的話，還是有辦法讓它變成真正的智慧窗簾的，智慧型萬用遙控器BroadLink RM Pro+ 即可完成此事。', NULL, 24, '2,11,24', 8865, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2404, '智能窗簾電機', ' 2404.png', NULL, 2800, '智能窗簾電機', ' 150*120*50', '購買“成品捲簾” 時才需要考慮窗簾布的透光度，看是要全遮光還是半遮光窗簾，可以根據自己需求選購不同產品。', NULL, 24, '2,11,24', 8808, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2405, '捲簾電機軸SOMFY', ' 2405.png', NULL, 12000, '捲簾電機軸', ' 770*100*140', '法國的電動窗簾大廠Somfy 就有各種捲簾電機軸相關產品，他們的裝置採用自家通訊技術與遙控器溝通，若要升級成連網智慧窗簾則要搭配訊號轉換器Somfy myLink 或是Somfy TaHoma，搭配後可將窗簾接入Google Home、IFTTT 或Amazon Alexa。', NULL, 24, '2,11,24', 8863, '2021-08-21 14:37:52', '2021-08-21 14:37:52'),
(2406, '捲簾', ' 2406.png', NULL, 6500, '捲簾', ' 100*190', '市面的智慧窗簾成品並不多見，大部份都要找廠商專門訂製，所以價格都會拉得比較高。幸運的是，IKEA 在歐美有推出兩款智慧捲簾系列產品，只要找到對的尺寸買回家裝在牆上即可，不會有太多的DIY 步驟。', NULL, 24, '2,11,24', 8836, '2021-08-21 14:37:52', '2021-08-21 14:37:52');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `products_ver2`
--
ALTER TABLE `products_ver2`
  ADD PRIMARY KEY (`prod_id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `products_ver2`
--
ALTER TABLE `products_ver2`
  MODIFY `prod_id` int(11) NOT NULL AUTO_INCREMENT COMMENT '商品編號', AUTO_INCREMENT=2407;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
